[{"CITY\/TOWN":"BELCHERTOWN","YEAR":2015,"SUMMARY":"Healthy Hampshire organized a walk audit of Route 202 in Belchertown, covering the area from the town common to the Eastern Hampshire District Courthouse. The audit aimed to foster awareness of infrastructure elements that contribute to the walking environment, evaluate the safety and quality of the route, and recommend improvements. It involved 18 older adult volunteers, the Planning Director, and the Conservation Commissioner, with participant recruitment by the Senior Center and Healthy Hampshire staff.","LONG TERM RECOMMENDATIONS":"- Implement traffic calming techniques​ to slow traffic down.\n- Increase safety and visibility of crosswalks by redesigning them to be truly accessible to everyone (raised crosswalks, blinking lights, curb ramps, detectable warning strips, etc.).\n-Tighten the turning radius at each intersection and driveway ​to slow turning traffic and increase pedestrian sightlines, visibility and length of crossings.\n- Make sidewalks clearly continuous across curb cuts and driveways ​using continuous materials such as concrete to indicate the appropriate path for pedestrians.\n- Sidewalks should always be added ​in this area when there is new construction.\n- Connect sidewalks to walking and recreational trails​.\n- Plan for bicyclist and pedestrians first​ when renovating any street or road.","SHORT TERM RECOMMENDATIONS":"- Increase safety and visibility of crosswalks by repainting.\n- Install push-button pedestrian activated signals.\n- Add benches, spruce up green spaces, and plant shade trees​to make it more inviting.\n- Consolidate driveways or narrow driveways ​to reduce the number of curb cuts.\n- Establish a dedicated sidewalk maintenance budget ​to repair\/replace sidewalk in this corridor.","STREETS, INNTERSECTIONS + AREA COVERED":"Route 202 (State St & Maple St)","THEMES":"Comfort & Safety, \"Traffic Calming, Speed, Safety \", Bike or Bus, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1HhXErq2HADD1XPiCXjo2tl-bo6_Ad8Z3\/view?usp=drive_link","CITY":"BELCHERTOWN","NEIGHBORHOOD":null,"TOWN_ID":24.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"BLANDFORD","YEAR":2021,"SUMMARY":"The Hilltowns CDC, Healthy Hampshire, and WalkMass are leading a 5-year grant project to improve walkability in Hilltowns Village Centers, including Blandford, through walk audits and infrastructure planning. Blandford is simultaneously working on a Resilient Master Plan and Open Space and Recreation Plan, prioritizing improved walking connections between key destinations like Watson Park, the Town Common, and the library. Plans include redesigning the Town Common, expanding Veteran’s Memorial Park, and improving connectivity to enhance village center walkability and accessibility for all ages.","LONG TERM RECOMMENDATIONS":"- Improve safety and visibility of existing pedestrian crossings within the village center.\n- Consider redesign of the North Street\/Rt 23 intersection to a T intersection to provide a safe crossing for people moving between the Historical Society building and the parking area.","SHORT TERM RECOMMENDATIONS":"- Reduce traffic speeds on Route 23 through the Blandford village center.\n- Consider pedestrian wayfinding signage along walking route(s) to advertise their existence and promote walking in the village center.\n- Ensure that the walking route, village center and Bicentennial Park are well maintained.\n- Identify a safe crossing location across North Street to connect the White Church to the Hill Cemetery and Town Common.","STREETS, INNTERSECTIONS + AREA COVERED":"Russel Stage Rd., Main St., North St., & South Part of Watson Park Walking Trail","THEMES":"Comfort , \"Traffic Calming, Speed, Safety \", Connectivity, Accessibility, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Brendan Kearney ","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/Blandford-Walk-Audit.pdf?70fb4f&70fb4f","CITY":"BLANDFORD","NEIGHBORHOOD":null,"TOWN_ID":33.0,"TYPE":"T","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"BOSTON (ROSLINDALE VILLAGE)","YEAR":2015,"SUMMARY":"In partnership with WalkUP Roslindale, a community advocacy group, a walk audit was conducted in Roslindale Square to assess walking conditions and develop recommendations for the Boston Transportation Department. While the Square’s pre-WWII design fosters a walkable and lively atmosphere, issues such as confusing one-way street configurations, high vehicle volumes, and insufficient crosswalks and WALK signals were identified. These factors detract from pedestrian safety despite the area's vibrant street life and active local economy. The audit highlights opportunities to improve walkability and enhance Roslindale as a safe and inviting neighborhood for all.","LONG TERM RECOMMENDATIONS":"- Consider converting one-way streets to two-way.\n- Consider safer placement of bicycle lanes.","SHORT TERM RECOMMENDATIONS":"-  Increase the number and safety of street crossings and improve WALK signal timings.\n- Remove selected in-street parking spaces to improve pedestrian visibility in the immediate vicinity of crosswalks.","STREETS, INNTERSECTIONS + AREA COVERED":"South St, Washington St, Corinth St, & Belgrade Ave","THEMES":"\"Traffic Calming, Speed, Safety \", Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass & Adi Nochur","VIEW_link":"https:\/\/walkuproslindale.org\/pdf\/2016-01-29%20Roslindale%20WalkBoston%20Walk%20Audit.pdf","CITY":"BOSTON","NEIGHBORHOOD":"ROSLINDALE VILLAGE","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON","YEAR":2015,"SUMMARY":"WalkBoston aided students from Codman Academy Charter School with identifying the safety benefits of closing Epping St after a student was struck and seriously injured on the one block, one lane roadway bordering the academy in 2014. ","LONG TERM RECOMMENDATIONS":"- Epping St should be closed, and the campus should be extended across Epping St to improve student and staff safety and to cretae a more cohesive campus.","SHORT TERM RECOMMENDATIONS":"- Implement measures to stop drivers from turning abruptly onto Epping St to avoid the red traffic light at the Norfolk\/Talbot intersection.","STREETS, INNTERSECTIONS + AREA COVERED":"Epping St, Norfolk St, Talbot St","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/117NygPbCjUA5CxONL9ZLKbwgRe-zM1d5\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":null,"TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (DORCHESTER)","YEAR":2015,"SUMMARY":"The goal of the Walk Audit is to identify safe and easy walking access from a proposed new development on East Cottage Street in Dorchester to the shops, services, and Uphams Corner Station, located four blocks southeast on the Fairmount Commuter Line. The 2.75-acre development includes commercial\/industrial space along East Cottage Street and 88–92 units of affordable housing set back behind the commercial space. Despite its proximity to Uphams Corner, there are no walking connections between the development and the neighborhood center, commuter rail station, or bus lines along Dudley Street and Columbia Road.","LONG TERM RECOMMENDATIONS":"- Consider creating a roundabout at the East Cottage\/Norfolk\/Humphreys intersection to reduce vehicle speeds and improve pedestrian crossings.\n- Incorporate additional pedestrian pathways within the East Cottage Development for better neighborhood connectivity.\n- Plan for expanded street infrastructure improvements once the development is fully realized, ensuring pedestrian connections to other nearby areas.","SHORT TERM RECOMMENDATIONS":"- Create a walking connection at Harrow Street to the proposed East Cottage Development, using public land where Harrow Street meets the development site.\n- Tighten curb radii at the East Cottage\/Norfolk\/Humphreys intersection to reduce crossing distances and improve pedestrian safety.\n- Paint visible, ladder-style crosswalks at the East Cottage\/Norfolk\/Humphreys intersection for better driver awareness.\n- Widen the sidewalk on East Cottage Street to ensure enough space for pedestrians, especially around the Diamond Window and Doors area.\n- Construct a sidewalk on Hillsboro Street to improve pedestrian access to other parts of the neighborhood.","STREETS, INNTERSECTIONS + AREA COVERED":"Harrow St, East Cottage St, Hillsboro St, Intersection of the East Cottage \/Norfolk\/Humphreys","THEMES":"Connectivity, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1CrIrcRyZ62VbaljTbQzKMFdyRm2nk7ES\/view?usp=drive_link","CITY":"BOSTON","NEIGHBORHOOD":"DORCHESTER","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (MATTAPAN)","YEAR":2016,"SUMMARY":"A group of Mattapan seniors, WalkMass, the Elderly Commission, local organizations, city agencies, and elected officials conducted an Age-Friendly walk audit starting at ABCD Mattapan. After a “Ped 101” presentation on pedestrian infrastructure and a discussion on local walking challenges, the group split into two teams to assess traffic and walking conditions: one at the Blue Hill Ave, River St, and Cummins Hwy intersection, and the other along Blue Hill Ave through the business district. They reconvened at ABCD to discuss strategies for improving Mattapan Square's walking environment.","LONG TERM RECOMMENDATIONS":"- Develop a multi-stakeholder working group (potentially including Boston Transportation Department [BTD], Public Works Department [PWD], Department of Conservation and Recreation [DCR], Town of Milton, Mattapan Food and Fitness Coalition and others) to ensure coordination under the Age-Friendly umbrella of different projects in\/around Mattapan Square.\n- Reach out to State Representatives and Senators (Rep. Cullinane, Rep. Holmes, Sen. Forry) to follow up on the $500,000 earmarked for a traffic study in Mattapan Square, which may address roadway design and signal phasing issues.","SHORT TERM RECOMMENDATIONS":"- Address WALK signal timing issues.\n- Balance the need for seniors to have places to sit (benches, bus shelters, etc.) with concerns about public safety and loitering. \n- Plant shade trees at several locations, such as the church at the corner of Cummins Hwy and River St.\n- Add more seating in areas near Fairway Street that have good tree shading and room for benches.\n- Add more trees and greenery in areas that currently lack it – there’s too much brick and concrete in the Square.\n- Conduct a parking srudy.","STREETS, INNTERSECTIONS + AREA COVERED":"Blue Hill Ave, River St, Cummins Hwy, Blue Hill Ave, & Babson St","THEMES":"Comfort & Safety, Policy, Age Friendly","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1pMjAewjvROQmf_UhvqM-YQsIj-UkS78l\/view?usp=drive_link","CITY":"BOSTON","NEIGHBORHOOD":"MATTAPAN","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON","YEAR":2016,"SUMMARY":"On September 14, 2016, Urban Edge and WalkBoston conducted a walk assessment in Egleston Square to examine pedestrian infrastructure conditions in the highly trafficked Main St corridor. The intention for the assessment was to help lead to on-the-ground build environment changes in Egleston Square that enable active and sustainable transportation for all. Beforehand, WalkBoston and partner organizations Boston Cyclists Union and LivableStreets submitted a joint letter to the Boston Planning and Development Agency (BPDA) outlining numerous recommendations for enhancing pedestrian and bicycling infrastructure in the study area. After the walk assessment was conducted, several of the recommendations from the assessment were then presented to the Egleston Square Neighborhood Association (ESNA).","LONG TERM RECOMMENDATIONS":"- Consider eliminating right-turn lanes (potentially in conjunction with curb extensions) and\/or banning left turns; consider gathering traffic counts to determine the implications of such changes and how traffic might be diverted to other streets.\n- Implement a road diet on Columbus Ave (reduce from two travel lanes to one).\n- Consider adding \"Don't Block the Box\" at the intersection of Washington St and School St as well as other heavily congested locations.\n- Consider changing traffic circulation patterns around Egleston Square (e.g. converting two-way segment on School St between Washington St and Weld Ave to one-way, banning\/blocking left turns from Columbus Ave onto Weld Ave); consider gathering traffic counts to determine the implications of such changes and how traffic might be diverted to other streets.\n- Address collision hazards at Westminster Ave and wardman Road where Westminster Ave bottlenecks due to parked cars.\n- Address curb drainage issues at Waldren Road and Westminster Ave.","SHORT TERM RECOMMENDATIONS":"- Add crosswalks across streets and intersections (e.g. Washington St, Columbus Ave); add high-visibility signage to enhance pedestrian safety; daylight the crosswalk to improve visibility.\n- Use curb extensions to reduce crossing distances and calm traffic at the Washington St\/Columbus Ave.\n- Reconfigure signal timings to create more predictable WALK signal cycle; consider making WALK cycle automatic, thus eliminating the need for pedestrians to push a button.\n- Consider moving the crosswalk across Washington St at Atherton St from the south side of the intersection to the north side, thus enhancing visibility between pedestrians in the crosswalk and drivers turning right onto Washington St from Columbus Ave.\n- Enhance the mid-block crossing outside Egleston Branch Library by adding more visible pedestrian signage in the median and\/or a flashing beacon.\n- Add a mid-block crossing with visible pedestrian signage and\/or a flashing beacon across Columbus Ave at the Rafael Hernandez School.\n- Add WALK signals to all sides of the crosswalks across Columbus Ave at Bragdon St and remove obstructions in the medians to facilitate access for seniors and people with disabilities.","STREETS, INNTERSECTIONS + AREA COVERED":"Columbus Ave, Dixwell St, School St, Washington St, Westminster Ave, Waldren Rd","THEMES":"Accessibility, Age Friendly , Comfort & Safety, Policy","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/10aHpooj1pKtEB9g1bvoec_xROlfNJ4vE\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":null,"TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (EAST BOSTON)","YEAR":2016,"SUMMARY":"East Boston seniors, WalkMass, the City of Boston Elderly Commission, and local organizations conducted an Age-Friendly walk audit near the East Boston Neighborhood Health Center in Maverick Square. Part of the Age-Friendly Walking initiative, the audit focused on the Meridian Street corridor between Maverick Square and Central Square, identifying strengths like vibrant pedestrian activity and streetscape elements, along with challenges such as unsafe street crossings, traffic congestion, and construction impacts.","LONG TERM RECOMMENDATIONS":"- Create a safe pedestrian crossing to the Maverick Blue Line station at the northernmost edge of Maverick Square.\n- Create safer crossings along Meridian Street by adding bumpouts\/curb extensions, daylight crosswalks to enhance visibility, in-street pedestrian crossing signs in crosswalks across Meridian Street, additional signage, and raised crosswalks. ","SHORT TERM RECOMMENDATIONS":"- Create safer pedestrian crossings and walkways around Central Square.\n- Enhance the public realm along the Meridian Street corridor. \n- Enhance Harborwalk Access at Liberty Plaza.","STREETS, INNTERSECTIONS + AREA COVERED":"Mavericlk Sq, Meridian St, Saratoga St, Border St, Liberty Plaza, & Harborwalk","THEMES":"Accessibility, Comfort & Safety, Connectivity, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass & Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1IkIH1b4GYPn-qMr6kwinIG3G4gcVJzT8\/view?usp=drive_link","CITY":"BOSTON","NEIGHBORHOOD":"EAST BOSTON","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (ROXBURY)","YEAR":2017,"SUMMARY":"WalkBoston met with Mr. Sam Balto, the physical education teacher and safety coach at the Ellis School, to review safety conditions around the school on September 14, 2017 after the school expressed concern about the safety of children walking to school. It was observed that crossing the streets was unsafe for children because drivers regularly drove at speeds going up to 35 mph, especially at Walnut Ave.","LONG TERM RECOMMENDATIONS":"- Daylight street corners and mid-block crossings so drivers have a clear view of pedestrians. This is especially important at some intersections because Walnut St has many curves.\n- Create curb extensions and\/or speed table on Walnut to slow vehicles and make people waiting to corss more visible to people driving.\n- Consider a bump out at the Cobden\/Walnut intersection to improve visibility; install a median island to control cars making short lefts and require them to go around it.\n- Consider a mini traffic circle at the Walnut\/Holworthy\/Crawford intersection, or bump out the northwest corner to make the turn more of a right angle and remove parking near the crosswalk to make the stop sign and people waiting to cross more visible to drivers.","SHORT TERM RECOMMENDATIONS":"- Paint the word SCHOOL on the pavement near the school and add school zone signs to better indicate to drivers they are entering the school zone.\n- Install a speed feedback board along Walnut St.\n- Use V types of crossing at Ruthven\/Walnut to make a larger crosswalk area; a similar V crossing has been installed at Longwood\/Riverway in the Longwood Medical District.\n- Remove a parking space on each side of the Ruthven\/Walnut intersection to daylight the crosswalk.\n- Change the angle of the school zone sign to make it clear the school zone is down Walnut Ave.","STREETS, INNTERSECTIONS + AREA COVERED":"Ruthven St, Westminster St, Walnut Ave, Holworthy St, Crawford St","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Brendan Kearney","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1h-wdpI-jDhSn8A7KithlodmCBGxXvTzw\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":"ROXBURY","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (SOUTH)","YEAR":2018,"SUMMARY":"WalkBoston conducted a walk audit along Dorchester St to observe existing pedestrian conditions. When making observations and suggestions, the participants had in mind a survey of South Boston residents conducted by LivableStreets about improving transportation safety in the neighborhood. These residents were asked questions about pedestrian safety, and many of their responses matched with the recommendations the audit participants had for Dorchester St.","LONG TERM RECOMMENDATIONS":"- Build bump outs to shorten crossing distances, ensure that parking is pulled back to daylight intersections, and narrow Dorchester Street.\n- Investigate and possibly modify zoning\/site plan review regulations to reduce\/prevent the addition of new curb cuts for driveways on Dorchester Street with particular attention to closely spaced curb cuts and curb cuts to ramped garage entries, both of which are hazards to pedestrians.\n- Put Dorchester Street on a road diet by narrowing the street to one-lane in each direction with intermittent left-turn lanes if needed to manage traffic. The new design would include safe pedestrian crossings, additional sidewalk width and tree planting, bicycle accommodation, and adequate curb space for deliveries, bus stops,\nand TNCs (Uber\/Lyft).","SHORT TERM RECOMMENDATIONS":"- Provide daylighting for all Dorchester Street and side street crosswalks by removing\nparking spaces adjacent to the crosswalks where there is approaching traffic. The distance required should be determined by the sight lines – the curve of the streets will require different distances. Physical barriers such as flex posts will be needed to ensure that drivers do not park adjacent to the crosswalks.\n- Provide additional mid-street “Yield to Pedestrian” signs, and where possible find merchants or residents to adopt the signs and put them back in place if they are pushed aside or tell the Public Works Department if replacements are necessary.\n- Adjacent to places serving vulnerable users such as senior housing (Marian Manor) or schools, implement 20-MPH safety zones.\n- Investigate the addition of parking-protected bike lanes which would both improve bike safety and significantly narrow the very wide street and make it easier to cross.","STREETS, INNTERSECTIONS + AREA COVERED":"Dorchester St","THEMES":"Age Friendly , \"Traffic Calming, Speed, Safety \", Bike or Bus, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Brendan Kearney, Wendy Landman","VIEW_link":"https:\/\/drive.google.com\/file\/d\/160XoVfZDf1oQ-3mxKGOzZc0lqt2gXpzl\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":"SOUTH","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON (CHARLESTOWN)","YEAR":2018,"SUMMARY":"WalkBoston conducted a walk audit along Medford St from Chelsea St to the Schrafft's Center with the purpose of identifying opportunities and challenges to creating stronger connections between the Charlestown community and the Mystic River waterfront and Harborwalk. ","LONG TERM RECOMMENDATIONS":"- Provide better connections from Medford St and the neighborhood to the existing portions of the Harborwalk.\n- Add benches and shade along the Harborwalk for the comfort of pedestrians and enourage walking.\n- Prevent cars from parking close to crosswalks to improve visibility for both pedestrians and drivers.\n- Repair sidewalks and curb ramps in disrepair along Medford St.","SHORT TERM RECOMMENDATIONS":"- Add signs and consider landscaping along Medford St to open up the locations of direct connection to the Harborwalk.\n- Evaluate landscape improvements to soften the Medford St edge and make it more attractive for walking.\n- Implement more crosswalks along Medford St.\n- Add stop signs and \"yield to pedestrians\" sings in areas of high traffic.","STREETS, INNTERSECTIONS + AREA COVERED":"Intersections between Medford St and Decatur St, Old Landing Way, Monument St, Polk St, Elm St, Terminal St, St. Martin St, Pearl St, Allston St, Sackville St, Belmont St, Chappie St, and Main St","THEMES":"\"Traffic Calming, Speed, Safety \", Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Wendy Landman","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1LaoxyUJlZMLYMkdjANhiUHIs9C-yV9Us\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":"CHARLESTOWN","TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BOSTON","YEAR":2025,"SUMMARY":"Shared Spaces, a coalition of advocates from the community of Boston, Boston Center for Independent Living (BCIL), Riders' Transportation Access Group (RTAG), Transportation for Massachusetts (T4MA), WalkMass, Boston Cyclists Union (BCU), and MassBike, organized a site visit to Tremont Street on April 14, 2025 to bring together individuals from the city and provide them with a firsthand understanding of shared spaces, their limitations, and potential conflicts. The visit aimed to promote more informed decision making and facilitate relationships between communities.","LONG TERM RECOMMENDATIONS":"- Re-install benches at floating bus stop locations, including at Tremont and Worcester St; if there is limited space in the bus stop, add a bench on the wide, newly paved sidewalk\n- Improve delineation between the sidewalk and the curb ramp to prevent drivers from parking on the sidewalk\n- Ensure that all parking spaces are usable by users with ramps; spacing of barriers should be intentional to facilitate ramp deployment and allow wheelchair users to exit their vehicles reliably\n- Level the sloped sidewalk near 778 Tremont St\n- Add a fully accessible concrete path on the old section of Tremont St","SHORT TERM RECOMMENDATIONS":"- Designate areas for dumpster storage and other similar needs\n- Ensure there are no obstructions that block the right-of-way of all road users\n- Ensure bus stops are compliant with ADA guidelines regarding length and width\n- Increase wayfinding signage\n- Ensure Accessible Pedestrian Signal (APS) is fully accessible\n- Enforce regulations regarding designated accessible parking spots\n- Update accessible parking map from City of Boston to reflect accurate information","STREETS, INNTERSECTIONS + AREA COVERED":"Tremont St, Massachusetts Ave, Worcester St, Northhampton St, W Springfield St","THEMES":"Accessibility, Bike or Bus, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1bHxct_DzAB-fE6QQsEeNcLX5_ZhfBZ82\/view?usp=sharing","CITY":"BOSTON","NEIGHBORHOOD":null,"TOWN_ID":35.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"BROCKTON \n(LEGION PARKWAY)","YEAR":2014,"SUMMARY":"WalkMass conducted a walk assessment in Brockton on October 21, 2014, as part of MassDOT's Bicycle and Pedestrian Safety Program to improve pedestrian safety and walking conditions. The assessment identified high-priority intersections, infrastructure deficits like faded crosswalks and uneven sidewalks, and broader safety concerns, including 9 pedestrian fatalities in 2014. Recommendations ranged from immediate fixes, such as crosswalk repainting, to long-term studies on raised crosswalk feasibility.","LONG TERM RECOMMENDATIONS":"- Redesign roads to prioritize multimodal transportation, including wider sidewalks and pedestrian-focused infrastructure.\n- Install pedestrian-scale lighting to enhance safety and visibility.\n- Develop a comprehensive pedestrian education campaign to encourage compliance with traffic signals.","SHORT TERM RECOMMENDATIONS":"- Extend pedestrian signal crossing times and consider installing pedestrian countdown signals.\n- Repair and install ADA-compliant curb ramps and detectable warning strips at intersections.\n- Trim roadside signs or adjust their height to improve visibility along sidewalks.\n- Add temporary wayfinding signs to guide pedestrians.","STREETS, INNTERSECTIONS + AREA COVERED":"School St, Main St, Pleasant St, Warren Ave, Legion Pkwy, Intersection of Main St\/Legion Pkwy,  Intersection of Main St\/Pleasant St, & Intersection of Pleasant St\/Warren Ave  ","THEMES":"Comfort & Safety, \"Traffic Calming, Speed, Safety \", Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1plzxTt5Zu2AMtd6_ExyHeYq6P4e5Ghp3\/view?usp=drive_link","CITY":"BROCKTON","NEIGHBORHOOD":"LEGION PARKWAY","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (DOWNTOWN)","YEAR":2021,"SUMMARY":"The Downtown Brockton Virtual Walk Audit is part of a statewide initiative examining the links between social infrastructure, walkability, and transit access in five Massachusetts Gateway Cities. Co-hosted by WalkMass and MassINC, with support from the Solomon Foundation, the project gathers resident input through virtual discussions and self-led audits. Its goals are to improve local streets and influence state policy to prioritize investments in Gateway Cities.","LONG TERM RECOMMENDATIONS":"- Provide more opportunities for individuals to seek short- and long-term shelter in Brockton.\n- Shorten driveway widths to limit interruptions to the sidewalk.\n- Consider a road diet for Warren Avenue to reduce speeds and make more space for planting street trees and widening the sidewalk.\n- Add street lamps to increase visibility after sunset.\n- As the Redevelopment Authority continues to sell parcels along this stretch, prioritize land uses that will bring street-level activity and encourage people to spend time in the area. Also prioritize creating opportunities for small, local businesses that want to invest in fostering community and civic engagement to take root in this area.","SHORT TERM RECOMMENDATIONS":"- Add wayfinding signage, historical markers, and welcoming banners around City Hall Plaza, while increasing green space, plantings, and seating in existing open areas to encourage people to explore and linger downtown.\n- Allow food trucks or other activation of unused parking spaces (such as parklets).\n- Design a public awareness campaign about existing health and shelter resources for people who are unhoused that reaches people who need this assistance and spend time downtown.\n- Asses downtown parking space usage, while collaborating with local businesses to create short-term pop-ups and repurpose unused parking for people-focused areas like seating or play spaces.\n- Conduct a sidewalk inventory and make needed repairs.\n- Add shelters and seating at bus stops, along with landscaping and protective buffers at existing open spaces.\n- Use placemaking strategies to enhance vacant storefronts, encourage property owners to remove fencing, inventory trash cans to improve collection, and create friendly signage to promote litter-free spaces.\n- Work with public health officials and service providers to increase resources and create a public awareness campaign about available support for substance abuse, mental health, and homelessness in downtown Brockton.","STREETS, INNTERSECTIONS + AREA COVERED":"School St, Montello St, Centre St, Legion Pkwy, Warren Ave, L St, & Frederick Douglass Ave\n","THEMES":"Equity , Comfort & Safety, Public Health ","VIEW":"PDF","FACILITATOR\/AUTHOR":"Ayesha Mehrotra & Brendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/Downtown-Brockton-Walk-Audit_-Recommendations-Memo.pdf?8621dc&8621dc&70fb4f&70fb4f","CITY":"BROCKTON","NEIGHBORHOOD":"DOWNTOWN","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (D.W. FIELD PARK)","YEAR":2023,"SUMMARY":"A walk audit in Brockton, conducted on August 16th with the Wildlands Trust Green Team, focused on D.W. Field Park to identify walkability and pedestrian safety challenges. The audit, involving youth from the Brockton area, gathered insights on shared-use roadways and pedestrian trails, with the goal of informing recommendations to improve mobility for all park users. ","LONG TERM RECOMMENDATIONS":"- Install a push button APS near D.W. Field Park entrance and redesign entrances with curb extensions for improved pedestrian visibility.\n- Analyze and improve wayfinding materials to enhance storytelling and highlight the park's history.\n- Use eco-friendly materials for proper drainage on pedestrian paths and ensure safe separation of transportation modes.\n- Install gazebos and other shelters throughout the park to improve the user experience and to protect pedestrians in inclement weather.\n- Construct permanent restrooms at both ends of the park, add an information hub near the entrance, improve signage, and implement a dog waste management system with additional bins and signage.","SHORT TERM RECOMMENDATIONS":"- Install pedestrian signage on Oak Street to increase driver awareness and repaint crosswalks with zebra striping for better visibility.\n- Enhance wayfinding signage and install kiosks in key locations to provide visitors with important information.\n- Draft a plan for pedestrian-only paths and improve signage for better communication between park transportation modes.\n- Install more bike racks at park entrances and explore separating transit modes with bike lanes.\n- Fix drainage issues on pedestrian paths and explore ways to improve park usability year-round.\n- Improve porta potty conditions with regular cleaning, increase their number, and place them strategically throughout the park.","STREETS, INNTERSECTIONS + AREA COVERED":"D.W. Field East and West Pkwy","THEMES":"Bike or Bus, Comfort & Safety, Accessibility","VIEW":"PDF ","FACILITATOR\/AUTHOR":"Iolando Spinola & Chiara Palagi","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2023\/10\/DW-Fields-Park_-Brockton-Walk-Audit-Report.pdf?70fb4f&70fb4f","CITY":"BROCKTON","NEIGHBORHOOD":"D.W. FIELD PARK","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (CAMPELLO)","YEAR":2025,"SUMMARY":"The Campello neighborhood walk audit was conducted on June 26, 2025, by WalkMassachusetts, local residents, and community partners. It aimed to evaluate pedestrian conditions, identify barriers to walkability, and recommend improvements for the Campello neighborhood in Brockton. The audit was supported by the Underserved Communities Traffic Safety Grant and conducted in partnership with Old Colony Planning Council.","LONG TERM RECOMMENDATIONS":"- Consider hiring a dedicated city transportation planner.\n- Reconstruct sidewalks to modern standards (wider, continuous).\n- Reduce curb radii at intersections, install permanent bus shelters, plant more street trees.\n- Signalize hazardous intersections (Nilsson\/Main, Main\/Forest), and upgrade crossings with accessible pedestrian signals.\n- Redesign parking and commercial back entrances for safer access.\n- Implement traffic calming (raised crosswalks, curb extensions).\n- Continue community engagement and public education on pedestrian safety.\n- Pursue comprehensive, permanent infrastructure improvements in line with Brockton’s and OCPC’s safety plans.","SHORT TERM RECOMMENDATIONS":"- Paint high-visibility crosswalks, upgrade to ADA compliance, add tactile pavers\/curb ramps.\n- Install trash bins near businesses and bus stops.\n- Add benches and temporary shade at major transit stops.\n- Enforce sidewalk parking, improve lighting, prune\/replace trees, replace missing signage.\n- Commission access management studies to reduce driveway conflicts and enhance safety at key intersections.","STREETS, INNTERSECTIONS + AREA COVERED":"Main Street, Nilsson Street, Warren Avenue, Florence Street, and Forest Avenue.","THEMES":"Equity , Racial Equity , Connectivity, Economic Development","VIEW":"Campello Neighborhood Walk Audit Report Brockton 2025","FACILITATOR\/AUTHOR":"Iolando Spinola, Brendan Kearney, & Christine Park","VIEW_link":"https:\/\/docs.google.com\/document\/d\/10YbBu6ntac2lQaunasSa5mPnXTp8Ap2WyejmBcmnrS8\/edit?tab=t.0","CITY":"BROCKTON","NEIGHBORHOOD":"CAMPELLO","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (MONTELLO)","YEAR":2025,"SUMMARY":"The Montello neighborhood walk auidt was conducted on May 21, 2025, organized by WalkMassachusetts and Old Colony Planning Council with support from the Underserved Communities Traffic Safety Grant. The audit focused on pedestrian safety, accessibility, comfort, and equity—especially for underserved and vulnerable residents. The neighborhood is experiencing transformation, with new zoning and planning efforts aiming for walkable, vibrant mixed-use development.","LONG TERM RECOMMENDATIONS":"- Full reconstruction of sidewalks and crosswalks, ensuring ADA compliance and logical, continuous pedestrian network.\n- Installing permanent RRFBs (flashing beacons) and audible pedestrian signals at high-traffic crossings.\n- Traffic calming: curb bumpouts, raised crosswalks, road diets, speed feedback signage, and reduced speed limits (city should consider opting into 25 mph standard).\n- Comprehensive wayfinding systems for MBTA, schools, parks, and businesses.\n- Permanent amenities: benches, shelters, street trees, upgraded lighting.\n- Addressing chronic flooding with engineered drainage solutions.\n- Regular maintenance for all pedestrian infrastructure.\n- Coordinated efforts between city council, traffic commission, and public works.\n- Integrate walkability and equity into all transportation and land use planning.\n- Consider hiring a dedicated transportation planner.","SHORT TERM RECOMMENDATIONS":"- Restriping faded crosswalks, relocating them for better connectivity.\n- Adding high-visibility crossing markings and temporary curb ramps\/tactile surfaces for ADA compliance.\n- Repairing malfunctioning pedestrian signals, especially around MBTA station and major intersections.\n- Clearing sidewalk obstructions (cars, snow, overgrowth) and ensuring ADA ramps connect logically.\n- Temporary improvements: speed feedback signs, benches at bus stops\/along routes, temporary wayfinding signs, enhanced lighting, temporary flood mitigation.\n- Using “See-Click-Fix” and maintenance reporting tools for rapid hazard response.","STREETS, INNTERSECTIONS + AREA COVERED":"Montello MBTA station, Wilmington Street, North Main Street, and Ames Street","THEMES":"MBTA, Transit, Climate Change - Heat , Bike or Bus, Schools, Racial Equity , Equity , Policy","VIEW":"Montello Neighborhood Walk Audit Report Brockton 2025","FACILITATOR\/AUTHOR":"Iolando Spinola, Brendan Kearney, Jonathan Gomez-Pereira, Emma Itri, & Christine Park","VIEW_link":"https:\/\/docs.google.com\/document\/d\/1HEm5Ih6uuH-_XU1eylvg8bFMa8CeKK1yCYHzPX14uAY\/edit?tab=t.0","CITY":"BROCKTON","NEIGHBORHOOD":"MONTELLO","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (EAST SIDE)","YEAR":2025,"SUMMARY":"The East Side walk auidt in Brockton was conducted on August 14, 2025 by WalkMassachusetts and Old Colony Planning Council, with support from the Underserved Communities Traffic Safety Grant. The focus was on evaluating walkability, accessibility, and pedestrian equity along Center Street, Galen Street, Crescent Street, and Quincy Street. Participants included residents, local and state officials, public health, environmental justice, and educational stakeholders—all prioritizing safer, more inclusive mobility.\n\n","LONG TERM RECOMMENDATIONS":"- Citywide ADA curb ramp upgrade plan—ensure all ramps meet standards, with tactile and auditory features.\n- Hire a dedicated transportation planner or create a city transportation department.\n- Adopt road diets on Centre and Crescent, narrowing lanes for calmer traffic and reallocating space for sidewalks, bike lanes, or landscaped buffers.\n- Systematically fill gaps in sidewalk networks; improve routes to schools, parks, Massasoit Community College, and transit.\n- Add mid-block crossings with refuge islands and\/or beacons; expand the street tree program for cooling and comfort.\n- Implement consistent, citywide bike lanes separated from traffic.\n- Pursue grants to support sidewalk, crossing, and lighting upgrades.\n- Expand accessible pedestrian routes from Crescent Street into the plaza and investigate safer drop-off zones.\n- Establish annual walkability assessments for ongoing equity.\n- Develop infrastructure plans for new developments (sidewalks, shade, benches).","SHORT TERM RECOMMENDATIONS":"- Install truncated domes (tactile warning surfaces) at Centre and Quincy.\n- Use barriers or landscaping to clearly separate sidewalks from business parking areas.\n- Repave Crescent Street landings for ADA access to the plaza\/grocery.\n- Install Rapid Flashing Beacon across Crosby Road; install a stop sign at Adams and Centre.\n- Upgrade\/reposition pedestrian signals at Crescent and Quincy; install new\/raised crosswalks, especially near Caffrey Towers.\n- Re-time pedestrian signals on Crescent for slower walkers.\n- Make all crosswalk lines visible and add new signals near Brockton Hospital.\n- Address drop-off\/pick-up safety for students at the Crescent Plaza.","STREETS, INNTERSECTIONS + AREA COVERED":"Center Street, Galen Street, Crescent Street, and Quincy Street.","THEMES":"Age Friendly , Accessibility, Equity , Racial Equity , Economic Development , Climate Change - Heat , Transit, Bike or Bus","VIEW":"East Side Walk Audit Report Brockton 2025","FACILITATOR\/AUTHOR":"Iolando Spinola, Brendan Kearney, Jonathan Gomez-Pereira, & Christine Park","VIEW_link":"https:\/\/docs.google.com\/document\/d\/1qXP93QoH8q9IyHt3zxMJY5sAZleh8M8aQGrZ6Xoqgjo\/edit?usp=sharing","CITY":"BROCKTON","NEIGHBORHOOD":"EAST SIDE","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROCKTON (WEST SIDE)","YEAR":2025,"SUMMARY":"This audit, conducted June 26, 2025 by WalkMassachusetts and the Old Colony Planning Council, reviewed pedestrian conditions along West Street, West Elm Street, Moraine Street, Belmont Street, and Torrey Street. It brought together residents, city officials, local advocates, youth leaders, and environmental groups to evaluate accessibility, safety, and walkability for all users, particularly focusing on equity and the lived experiences of families, seniors, people with disabilities, and students.","LONG TERM RECOMMENDATIONS":"- Develop a citywide ADA curb ramp upgrade plan, ensuring tactile and auditory features.\n- Hire a full-time transportation planner or create a city transportation department to coordinate mobility improvements.\n- Adopt road diets for Belmont and Torrey, reallocating space for pedestrians and cyclists.\n- Fill sidewalk network gaps, prioritizing routes to schools, parks, transit, and residential areas.\n- Add mid-block crossings and pedestrian refuge islands, especially along long blocks.\n- Systematic expansion of separated bike lanes and consistent citywide pavement markings.\n- Expand tree planting on both sides of all priority corridors.\n- Launch regular (annual) walkability assessments for ongoing progress.\n- Pursue state, federal, and private grants for capital investment in walking infrastructure.","SHORT TERM RECOMMENDATIONS":"- Install high-visibility pedestrian crossings, particularly on West Elm near bus stops and at West Elm & West Street.\n- Expand street tree canopy on sides lacking shade to improve heat resilience and comfort.\n- Launch waste bin partnership with local businesses to reduce litter.\n- Maintain and repaint crosswalks, especially at high-traffic and school-adjacent intersections.\n- Regularly trim overgrown vegetation along key corridors.\n- Improve pedestrian signals by adding countdown timers and “no turn on red” signage at priority intersections.\n- Enhance lighting on Belmont and Torrey Streets.\n- Add benches along walking routes and at bus stops.\n- Increase education and enforcement around pedestrian right-of-way and safe speeds.","STREETS, INNTERSECTIONS + AREA COVERED":"West Street, West Elm Street, Moraine Street, Belmont Street, and Torrey Street","THEMES":"Schools, Racial Equity , Equity , Youth, Policy, Bike or Bus","VIEW":"West Side Walk Audit Report Brockton 2025","FACILITATOR\/AUTHOR":"Iolando Spinola, Brendan Kearney, Jonathan Gomez-Pereira, & Christine Park","VIEW_link":"https:\/\/docs.google.com\/document\/d\/158M7zfwB4RB6WXL-B5Hh7clYeQ-xfxN2S8LMYtaWmCk\/edit?tab=t.0","CITY":"BROCKTON","NEIGHBORHOOD":"WEST SIDE","TOWN_ID":44.0,"TYPE":"C","COUNTY":"PLYMOUTH"},{"CITY\/TOWN":"BROOKLINE","YEAR":2016,"SUMMARY":"WalkBoston and MassBike conducted an assessment of pedestrian and bicycle infrastructure along Harvard Street in the Town of Brookline on Tuesday, August 9, 2016. The assessment focused on Harvard Street between Longwood Avenue to the south and Shailer Street to the north in the Coolidge Corner area of Brookline, MA with hopes to address the safety and accessibility concerns regarding the region.","LONG TERM RECOMMENDATIONS":"- Provide continuous separated bike lanes throughout the study area by conducting further analysis on the potential to narrow travel lanes, remove travel lanes, or remove parking.\n- Further study feasibility of relocating on-street parking north of Beacon St to Centre St parking lot to provide wider sidewalks and high quality bicycle facilities.\n- Provide bicycle facilities on nearby Centre St, Winchester St, and Park St which may provide an alternate route for bicyclists routing around Coolidge Corner.\n- Reconstruct curb ramps to meet accessibility standards.\n- Shorten crosswalks with curb extensions or pedestrian crossing islands where such treatments would not interfere with current or future bicycle facilities.\n- Coordinate intersection improvements with the selected Babcock St alternative.","SHORT TERM RECOMMENDATIONS":"- Conduct a traffic analysis of the Harvard St corridor and surrounding street network for potential mitigation of traffic flow along the corridor.\n- Reduce pedestrian tripping hazards by replacing sidewalk panels and further implementing the Town's pervious tree grate program; develop strategies to improve the quality and health of street trees such as installation of permeable pavement.\n- Identify citizen or business sponsors to install, program, and maintain parklets in high pedestrian areas.\n- Add bicycle left-turn queue boxes where feasible.\n- Modify the \"WALK YOUR BIKE\" signs or rotate the signs to clarify the circumstances in which bicyclists should walk their bikes.\n- Install additional bike parking or on-street bike corrals in convenient and visible locations throughout the study area.\n- Install pedestrian countdown indications at signalized intersections; extend leading pedestrian intervals.\n- Review or reevaluate far-side bus stops to replace existing near bus stop.\n- Add 'Don't Block the Box' markings and signs that conform to the latest version of the MUTCD.\n- Restrict left turns from Longwood Ave onto Harvard St southbound.\n- Install in-street warning signs on the Harvard St and Longwood Ave crosswalks.\n- Widen bicycle lane by reducing width of travel lanes and install flexposts.\n- Remove warning signs and replace with a bike lane sign.\n- Install wayfinding signage on southbound Harvard St north of Beacon St to inform drivers of the need to position for a left turn onto Longwood Ave prior to Beacon St.\n- Remove right-turn lane and allocate the space for bicycle facilities for the Beacon St westbound approach.\n- Remove or redesign the two existing small islands on the Harvard St\/Beacon St intersection.\n- Replace the existing crosswalks with high visibility ladder style crosswalks.\n- Study providing one stage pedestrian crossings across Beacon St.\n- Maximize pedestrian crossing times for all approaches.\n- Install bicycle box for the Harvard St southbound approach to Beacon St.\n- Evaluate adding contraflow bicycle lane on Green St and potential intersection improvements at Harvard and Green St.\n- Modify signal to lagging left turn instead of leading left turns to allow people waiting to cross first.\n- Close exit driveway from Centre St parking lot or restrict parking by removing adjacent parking meters, adding NO PARKING pavement markings, and adding NO PARKING signs.","STREETS, INNTERSECTIONS + AREA COVERED":"Harvard St, Babcock St, Green St, Beacon St, Longwood Ave","THEMES":"Comfort & Safety, Bike or Bus, \"Traffic Calming, Speed, Safety \", Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothy Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1bjGgq_0_nZnM1iAIdtNNpfgfbEt5uZoi\/view?usp=sharing","CITY":"BROOKLINE","NEIGHBORHOOD":null,"TOWN_ID":46.0,"TYPE":"T","COUNTY":"NORFOLK"},{"CITY\/TOWN":"CAMBRIDGE","YEAR":2014,"SUMMARY":"MassBike and WalkMass led a walk and bike assessment in Cambridge on November 5, 2014, as part of MassDOT's program to improve safety in high-crash areas. The assessment aimed to enhance local knowledge, guide safety projects, and promote safer walking and biking.","LONG TERM RECOMMENDATIONS":"- Distribute space to modes with the largest volumes, similar to Times Square.\n- Remove traffic signals and install a roundabout at Cambridge and Hampshire Streets; close off minor streets to simplify traffic patterns.\n- Convert Cambridge and Hampshire Streets into one-way streets or prioritize pedestrian and bicycle use on one street.\n- Conduct a parking supply and demand study to explore removing parking for improved bike facilities.\n- Reduce ambiguous intersection space and separate movements.\n- Shrink crosswalk lengths and improve walkability by connecting open spaces.\n- Convert the single intersection at Springfield, Cambridge, and Hampshire Streets into two intersections.\n- Coordinate signal timing for cars and cyclists across the study area to improve traffic flow.","SHORT TERM RECOMMENDATIONS":"- Close Hampshire Street between Prospect and Cambridge Streets or make it a shared street.\n- Prohibit parking during rush hour and use parking spaces as travel lanes for cars or bikes.\n- Increase enforcement of parking violations in bike lanes, double parking, jaywalking, and running red lights.\n- Evaluate signal timings to ensure bicyclists have adequate clearance time.\n- Pilot geometric or temporal street closures on Hampshire and Cambridge Streets for public space use.\n- Add dedicated bike-signal heads at Hampshire and Beacon Streets.","STREETS, INNTERSECTIONS + AREA COVERED":"Inman Square","THEMES":"Economic Development , Connectivity, Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Wendy Landman, Stacey Beuttell, & Kasia Hart","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-InmanSquareWalkandBikeAssessment-Cambridge.pdf?70fb4f&70fb4f","CITY":"CAMBRIDGE","NEIGHBORHOOD":null,"TOWN_ID":49.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"CHELSEA","YEAR":2013,"SUMMARY":"WalkBoston held a Walk Audit training with the Chelsea Walking Group, which included community members, Health Center staff, and city officials. The training aimed to engage participants in evaluating Chelsea's walking environment and learning how to report needed safety improvements. Participants were introduced to the \"See Click Fix\" app, which many downloaded for future use. ","LONG TERM RECOMMENDATIONS":"- Install a curb extension or bump-out on Broadway at the northwest corner of Bellingham Square to shorten crossing distances and improve pedestrian visibility.\n- Narrow curb cut openings on Hawthorne Street between Broadway and Division Street to enhance pedestrian safety, especially during reconstruction projects.","SHORT TERM RECOMMENDATIONS":"- Contact Community Outreach Group (COG) to create a beautification plan for a small commercial and residential area in Chelsea.\n- Install a crosswalk at the intersection of Shurtleff\/Central on the east crossing of Central.\n- Repair broken sidewalks on Hawthorne Street, Shawmut Street, and other noted locations.\n- Remove or repair tree grates on Hawthorne Street to eliminate tripping hazards and improve wheelchair accessibility.\n- Relocate the Bellingham Square bus stop from the narrow sidewalk on Broadway to north Broadway.","STREETS, INNTERSECTIONS + AREA COVERED":"Bellingham St, Broadway, Central Ave,  Shawmut St, & Hawthorne St","THEMES":"\"Traffic Calming, Speed, Safety \", Public Health, Accessibility, Connectivity, Age Friendly","VIEW":"PDF","FACILITATOR\/AUTHOR":"Wendy Landman & Dorothea Hass","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAudit-Chelsea.pdf?70fb4f&70fb4f","CITY":"CHELSEA","NEIGHBORHOOD":null,"TOWN_ID":57.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"CHELSEA","YEAR":2017,"SUMMARY":"On May 31, 2017, WalkBoston conducted a walk assessment in the Sector 4 area of downtown Chelsea, with support from the Massachusetts Department of Public Health’s Mass in Motion program. Chelsea is undergoing a wave of urban revitalization, yet long-standing community concerns about crime and public safety persist, and many poorly designed intersections create dangerous conditions for people walking, biking, taking transit, and driving. The goals of the walk assessment were to examine these issues related to public and traffic safety and to recommend improvements to the local built environment that create safer walking conditions for everyone.","LONG TERM RECOMMENDATIONS":"- Create a comprehensive local pilot focused on street lighting, neighborhood beautification, and traffic calming.\n- Consider fining landlords who do not take adequate measures to keep their properties clean.\n- Plant street trees and fill empty tree pits with mulch or permeable pavers to create a more even and attractive sidewalk environment while providing a green canopy cover that also protects against the strong urban heat island effects in Chelsea.","SHORT TERM RECOMMENDATIONS":"- Provide additional trash receptacles in places with a lot of litter to help beautify the neighborhood and improve perceptions of safety by conveying that the community cares for the area.\n- Use paint, plastic flex posts and\/or planters to take away excess roadway space from motor vehicles, reduce speeding and pedestrian crossing distances, and provide pedestrian refuge islands.\n- Add lane markings and fog lines on the pavement to more clearly delineate vehicular movements and narrow travel lanes.\n- Restripe and add crosswalks with highly visible ladder designs and install in-street pedestrian crossing signs at crosswalks.\n- Add and retime WALK signals to provide sufficient pedestrian crossing time.\n- Restrict parking next to crosswalks to improve driver and pedestrian sightlines.\n- Upgrade dim lights to brighter LEDs where possible and trim street trees to ensure they do not obstruct lights; all lighting should be pedestrian-scaled to adequately illuminate sidewalks as well as streets.\n- Add a highly visible crosswalk at the bus stop at the Everett Ave\/Chestnut St\/Third St intersection; the current median island should be enhanced to better accommodate pedestrians.\n- Add signage, pavement markings, and plastic flex posts and\/or planters to discourage and block illegal U-turns.","STREETS, INNTERSECTIONS + AREA COVERED":"Park Square, Park St, Pearl St, Congress Ave, Cross St, Fay Square, Washington St, Sixth St, Chestnut St, Fourth St, Route 1, Everett Ave, Third St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/19QSFUdhKmMZL4tDekAS6y-U2nKe6Bu3s\/view?usp=sharing","CITY":"CHELSEA","NEIGHBORHOOD":null,"TOWN_ID":57.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"CHELSEA","YEAR":2017,"SUMMARY":"On September 7, 2017, WalkBoston conducted a walk assessment in the Park Square area of downtown Chelsea, with support from the Massachusetts Executive Office of Public Safety and Security (EOPSS). The goal of the walk assessment was to recommend  improvements to the local built environment that improve pedestrian safety.","LONG TERM RECOMMENDATIONS":"- Improve visibility at the crosswalk across Hawthorne St by adding curb extensions and physically restricting parking next to the crosswalk, using paint, plastic flex posts, and \"No Parking\" signage.\n- Turn the triangular white painted area at Pearl and 4th St as well as the triangular cobblestone area at Park Square and Congress Ave into a pedestrian refuge island with plastic flex posts and planters to protect people crossing the street and to further calm and delineate the movements of turning vehicles.\n- Create curb extensions with paint and plastic flex posts to narrow vehicular turning radii, thus calming traffic, improving driver\/pedestrian sightlines, and reducing pedestrian crossing distances.\n- Add STOP signs facing east and west on Central Ave at Shurtleff St to replace the non-operational signals there (these signals can potentially be relocated to other locations in Chelsea that may require signalization).","SHORT TERM RECOMMENDATIONS":"- Narrow the travel lane on Hawthorne St by painting a bike lane, thus turning Hawthorne St into a truly multimodal transportation corridor with slower vehicular traffic.\n- Add signage telling drivers turning left from Hawthorne St onto Pearl\/4th St to yield to pedestrians and informing pedestrians crossing Pearl St to look out for turning traffic.\n- Relocate the crosswalks across the Park St and Hawthorne St approaches closer to the intersection to improve sightlines for drivers and pedestrians and to reduce the incidence of drivers rolling through\/blocking the crosswalks.\n- Add in-street pedestrian crossing signs at crosswalks to calm traffic.\n- Add travel lane markings to clearly delineate vehicular movements approaching and continuing through the Park\/Hawthorne\/Central intersection.\n- Add plastic flex posts to the existing white painted area on the northwest side of the Park\/Hawthorne\/Central intersection to physically restrict parking there.\n- Add a new crosswalk across Park Square at Cross St.\n- Add signage at the eastern and western edges of Park Square telling turning drivers to yield to pedestrians and informing pedestrians to look out for turning traffic.","STREETS, INNTERSECTIONS + AREA COVERED":"Park Square, Park St, Central Ave, Hawthorne St, Cross St, Congress Ave, Pearl St, 4th St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Wendy Landman, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/13o6Awb31hE1C42jxv4gKP7YIOjNnYZbW\/view?usp=sharing","CITY":"CHELSEA","NEIGHBORHOOD":null,"TOWN_ID":57.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"CHESTERFIELD","YEAR":2021,"SUMMARY":"The Hilltowns CDC, Healthy Hampshire, and WalkMass are leading a 5-year grant project to enhance age-friendly walkability in Hilltowns Town Centers, including Chesterfield, through walk audits and infrastructure planning. Chesterfield residents prioritize safer walking routes, including sidewalks along Main Road near the CDC offices and Davenport Childcare Center, as well as social spaces like Russell Memorial Park and the Chesterfield General Store & Cafe. Suggestions include adding benches, enhancing recreational opportunities for older adults, and improving safety features for key walking routes to foster community cohesion.","LONG TERM RECOMMENDATIONS":"- Update other park elements, such as the swing set and play structures, and include a fall safe surface to mitigate the impact of any falls. An adaptive swing set and other play structures would also increase the accessibility of the park.\n- Consider planting more trees to increase shade.\n- Improve walking connection from the Town Center to the Chesterfield General Store and Bagg Road intersection","SHORT TERM RECOMMENDATIONS":"- Reduce traffic speeds on Main Road through the Town Center by reducing lane widths, considering installing a 4-way stop at the South Street\/N Road\/Main Road intersection, and continuing the use of speed feedback signs on Route 143.\n- Improve safety and visibility of the pedestrian crossing in front of the Library by repainting crosswalks with a continental stripe pattern and installing a pedestrian-activated Rectangular Rapid Flashing Beacon (RRFB).\n- Add more benches  to Russell Memorial Park to promote community gathering for people of all ages and abilities.\n- Study different options for improving pedestrian access to the Hilltown CDC and Child Care Center.","STREETS, INNTERSECTIONS + AREA COVERED":"Main Rd., Intersection of Main Rd. & South St., & Russel Memorial Park ","THEMES":"Age Friendly, Connectivity, Comfort","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Miranda Briseño","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/11\/Chesterfield-Walk-Audit-FINAL-compressed.pdf","CITY":"CHESTERFIELD","NEIGHBORHOOD":null,"TOWN_ID":60.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"CUMMINGTON","YEAR":2021,"SUMMARY":"The Hilltown CDC, Healthy Hampshire, and WalkMass are collaborating on a 5-year grant project to improve age-friendly walkability in Hilltown Village Centers, including Cummington. The initiative involves walk audits to identify infrastructure improvements and policy changes that make walking safer and more enjoyable for all ages. Cummington's efforts face challenges like fast traffic on Route 9 and incomplete sidewalks, but the community remains committed to enhancing pedestrian safety and accessibility to key local attractions.","LONG TERM RECOMMENDATIONS":"- TIghten the curb radii by reducing width of the intersection by redesigning the street with narrower travel lanes and less asphalt.\n- Evaluate and explore options to improve pedestrian access and safety along and across Route 9 to reach the Fairgrounds, the Creamery, and the Library by engage with MassDOT District 1 traffic engineers to determine options for\nimproving pedestrian safety along Route 9. ","SHORT TERM RECOMMENDATIONS":"- Complete the pedestrian crossing(s) and curb cuts at the Church\/Community House.\n- Tighten the curb radii by painting curb lines that narrow the travel lanes to 10’ wide or painting curb bump outs and a crosswalk. \n- Explore options for making walking safer on Main Street between the intersection of Plainfield Road and Route 9 by Determining the legal right-of-way dimensions along this stretch of road, considering posting additional advisory signage indicating pedestrians are sharing the roadway, considering using paint to alert drivers that people are walking\/rolling along this stretch, and evaluating traffic patterns. ","STREETS, INNTERSECTIONS + AREA COVERED":"Berkshire Trail & Main St. ","THEMES":"Age Friendly , \"Traffic Calming, Speed, Safety \", Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Miranda Briseño","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/12\/Cummington-Walk-Audit-FINAL.pdf?70fb4f&70fb4f","CITY":"CUMMINGTON","NEIGHBORHOOD":null,"TOWN_ID":69.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"FALL RIVER","YEAR":2014,"SUMMARY":"The Niagara Senior Center walk audit, conducted by WalkMass in partnership with Fall River's Mass in Motion program, focused on improving walkability in the Niagara\/Maplewood neighborhood. Around 20 senior residents participated in the event, which included a presentation on walkability followed by an on-street audit of nearby routes. Participants identified areas for improvement, such as safety enhancements and sidewalk repairs, with the goal of making the neighborhood more accessible and pleasant for walking.","LONG TERM RECOMMENDATIONS":"- Construct permanent bulb-outs at the mid block crossing.\n- Investigate the need for a raised crossing (speed table) and\/or pedestrian activated flashing warning lights (HAWK signal)","SHORT TERM RECOMMENDATIONS":"- Add a zebra striped crosswalk.\n- Install curb ramps serving the crosswalk.\n- Paint “bulb-outs” on the pavement, with no parking posted 20’ back from the crossing on either side.\n- Provide an “in-street pedestrian crossing sign on the street center line.","STREETS, INNTERSECTIONS + AREA COVERED":"Tucker St, Canning Blvd, & Stafford Rd","THEMES":"Age Friendly , Accessibility, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAudit-FallRiver.pdf?70fb4f&70fb4f","CITY":"FALL RIVER","NEIGHBORHOOD":null,"TOWN_ID":95.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"FALL RIVER","YEAR":2014,"SUMMARY":"WalkBoston conducted this walk assessment as part of the Massachusetts Department of Transportation Bicycle and Pedestrian Safety Program, in association with the Massachusetts Department of Public Health. The purpose of the walk assessment was to foster an awareness of the infrastructure elements which contribute to the walking environment, evaluate the safety and quality of the walking environment along the route, and recommend infrastructure improvements.","LONG TERM RECOMMENDATIONS":"- Install pedestrian push button signal at intersections to provide protected crossing across Bedford St\n- Consider changing the signal timing at intersections so that pedestrians can cross more quickly and efficiently; evaluate the vehicle volumes to see if concurrent phasing with a leading pedestrian indicator (LPI) is possible\n- Upgrade the pedestrian signal heads to a countdown signal at the Robeson\/13th St intersection\n- Consider traffic calming measures to slow traffic on Robeson St (e.g. raised speed tables, curb bump-outs); paint edge (fog) lines along Robeson to narrow travel lanes\n- Install and replace existing curb ramps with ADA-compliant ramps and detectable warning strips\n- Evaluate location of crosswalks; assuming utility poles and fire hydrants cannot be moved, crosswalks may need to move slightly outside pedestrian desire lines to meet ADA requirements\n- Upgrade crosswalk pavement markings to 'piano keys', ladder, or continental design","SHORT TERM RECOMMENDATIONS":"- Replace the WALK signal lights on Robeson St\n- Evaluate the location of mid-block crosswalks for adequate sight lines on Robeson St Corridor\n- Install pedestrian crosswalk and advanced crosswalk signage at mid-block crossings\n- Replace non-compliant STOP signs with proper STOP signs\n- Replace peeling and damaged detectable warning strips with more permanent solutions\n- Enforce ordinance to keep sidewalks clear and trim vegetation along sidewalks","STREETS, INNTERSECTIONS + AREA COVERED":"Robeson St, Pine St, N Quarry St, Bedford St, 13th St","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Kasia Hart, Brendan Kearney","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1bE5DCDsALC2Gnv-wTZJUG59tvKkHCFvj\/view?usp=sharing","CITY":"FALL RIVER","NEIGHBORHOOD":null,"TOWN_ID":95.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"FALL RIVER","YEAR":2017,"SUMMARY":"On May 10, 2017, WalkBoston conducted a walk assessment in the vicinity of the William S. Greene Elementary School in Fall River, in partnership with the Fall River Mass in Motion program and the Massachusetts Department of Transportation’s (MassDOT) Safe Routes to School (SRTS) program. The goals of the walk assessment were to examine pedestrian safety issues that may preclude children from walking to the Greene School and to recommend improvements to the local built environment that enable safer walking.","LONG TERM RECOMMENDATIONS":"- Install curb extensions\/bumpouts to reduce crossing distance and calm traffic\n- Implement a clearly marked pedestrian refugre island at Brayton Ave to create a safe waiting area in the middle of the street\n- Install a traffic light with WALK signals or a pedestrian-activated HAWK (High-Intensity-Activated crossWalK) beacon to stop traffic at the crosswalk across Brayton Ave\n- Reduce the posted speed limit on Brayton Ave form 30 miles per hour to 25 miles per hour in conjunction with a broader citywide approach to lowering speed limits\n- Extend the school zone and lower the speed limit on Warren St to 20 miles per hour","SHORT TERM RECOMMENDATIONS":"- Paint fog lines at the edge of parking lanes to narrow travel lanes and calm traffic\n- Implement high-visibility signage including in-street pedestrian crossing signs to draw driver attention to the crosswalk\n- Upgrade crosswalks and install traffic calming measures along Warren St","STREETS, INNTERSECTIONS + AREA COVERED":"Warren St, Brayton Ave","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1CTmmQcloT5lMbstsPsJSbPhyIN-cLD8P\/view?usp=sharing","CITY":"FALL RIVER","NEIGHBORHOOD":null,"TOWN_ID":95.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"FALL RIVER","YEAR":2020,"SUMMARY":"WalkMass conducted an Age-Friendly Walking audit in downtown Fall River near the South Main Senior Center through the Massachusetts Department of Public Health's Mass in Motion Program. This initiative responded to a 2019 MassDOT report highlighting Fall River as one of four Massachusetts communities with disproportionately high pedestrian crash rates among older adults, with 141 crashes involving individuals aged 55+ between 2016 and 2020. ","LONG TERM RECOMMENDATIONS":"- Improve the safety of midblock crosswalks with enhancements such as daylighting, adding bump outs to narrow the street and thus slow traffic and shorten crossing distances, or raised crosswalks.\n- Plan to upgrade all pedestrian traffic signals to ensure that they are fully accessible pedestrian signals with a countdown for WALK times.\n- Improve the accessibility of the walking environment by repairing and replacing crumbling curb ramps. \n- Inventory the sidewalks of this corridor and replace sections that are in disrepair to provide smoother, more level walking surfaces. Replace sections of mixed materials with concrete.\n- Consider speed reduction strategies for South Main Street to improve the safety and comfort of the walking environment.","SHORT TERM RECOMMENDATIONS":"- Enhance the visibility of crosswalks on South Main Street with signage and paint. \n- Extend the WALK signal length at key intersections in the downtown corridor to give pedestrians\nmore time to safely cross the street.","STREETS, INNTERSECTIONS + AREA COVERED":"South  Main St from Pocasset St. Intersection to Spring St. Intersection","THEMES":"Age Friendly , \"Traffic Calming, Speed, Safety \"","VIEW":"PDF ","FACILITATOR\/AUTHOR":"Wendy Landman & LeighAnne Taylor","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1IdXgwtpfYkivEYXJopGe41IfLVrtpesX\/view","CITY":"FALL RIVER","NEIGHBORHOOD":null,"TOWN_ID":95.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"FITCHBURG","YEAR":2016,"SUMMARY":"The City of Fitchburg is developing a broader Complete Streets prioritization plan, and the non-profit Montachusett Opportunity Council (MOC), which administers a local Mass in Motion program to promote active transportation options, invited WalkBoston to conduct a walk assessment of the Main Street area to help guide this effort.The assessment took place on October 25, 2016 and was designed to further examine local pedestrian infrastructure conditions to recomment potential improvements.","LONG TERM RECOMMENDATIONS":"- Upgrade crosswalks to include ladder design, high-visibility signage, and accessible curb ramps.\n- Add bumpouts\/curb extensions at key crossings and intersections to reduce crossing distances, slow turning traffic, and enhance visibility between people walking and driving.\n- Provide additional bike lanes beyond the short section of Main St where they have been painted.\n- Explore opportunities to remove on-street parking and reclaim more roadway space for pedestrian\/bike uses and public realm improvements at the Main St commercial core (e.g. parklets).\n- Reduce the number off eastbound travel lanes to calm traffic on Boulder Drive; paint fog lines on the road to narrow travel lanes as a near-term traffic calming measure (before reducing the overall number of travel lanes).\n- Add bike lanes on Boulder Drive as part of roadway reconfiguration.\n- Enhance pedestrian connections between Boulder Drive and Fitchburg Riverfront Park.\n- Consider adding a flashing beacon or traffic signal at the Main\/Cushing\/Blossom St intersection to calm traffic.\n- Upgrade WALK signals to be automatic, concurrent with traffic, provide pedestrian head starts, and allow sufficient time for people to cross the street.","SHORT TERM RECOMMENDATIONS":"- Add wayfinding signage to create a sense of connectivity between key destinations downtown and elsewhere.\n- Provide regular bus or shuttle service between downtown and the Fitchburg State University campus.\n- Retain the single lane layout beyond the one-year pilot at the Main St commercial core and use additional roadway space for bike lanes and\/or parklets (sidewalk extensions that provide more space and ammenities for people using the street.\n- Add plastic flex posts to the yellow-painted median on Main St to prevent wide left turns at high speeds.\n- Add protected pedestrian refuge islands in the crosswalks to the Intermodal Transit Center using paint and plastic flex posts.","STREETS, INNTERSECTIONS + AREA COVERED":"Main St, Boulder Dr, Cushing St, Blossom St, North St","THEMES":"Comfort & Safety, Bike or Bus, Youth, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1rs7wgU4wgzMPvD8tc3Jp0aejUzT3YJdn\/view?usp=sharing","CITY":"FITCHBURG","NEIGHBORHOOD":null,"TOWN_ID":97.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"FITCHBURG","YEAR":2020,"SUMMARY":"The Fitchburg Intermodal Center Virtual Walk Audit is part of a statewide project focused on improving social infrastructure, neighborhood walkability, and transit access in five Gateway Cities in Massachusetts. It incorporates neighborhood data and resident input through virtual discussions and self-led audits. The project aims to achieve safer, more enjoyable streets at the local level and influence state policies and budget priorities for Gateway Cities. Co-hosted by WalkMass and MassINC, it is supported by the Solomon Foundation.","LONG TERM RECOMMENDATIONS":"- Install bike lanes, especially on North St and Main St, to increase safety for bicyclists and help calm traffic, benefitting all users of the street.\n- Consider adding rectangular rapid flash beacons (RRFBs) at crosswalks, conforming to MUTCD guidelines.","SHORT TERM RECOMMENDATIONS":"- Form a bike\/ped committee for Fitchburg to keep advancing this important work. WalkMass can provide guidance on how to create and set priorities for the group through the Mass in Motion technical assistance program, in partnership with Tricia Pistone.\n- Add benches along North St and Main St where space permits.\n- Add trash receptacles along North St, Main St and Lunenburg St and in the parks along these streets.\n- Repaint crosswalks with ladder markings.","STREETS, INNTERSECTIONS + AREA COVERED":"Section 1: North St, Intersection of North St and Pearl St, & Main St\n\n\nSection 2: Main St, Mill St, Commercial St, & Boulder Dr","THEMES":"Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/Fitchburg-Intermodal-Center-Walk-Audit_-Recommendations-Memo.pdf?8621dc&8621dc&70fb4f&70fb4f","CITY":"FITCHBURG","NEIGHBORHOOD":null,"TOWN_ID":97.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"FRAMINGHAM","YEAR":2018,"SUMMARY":"On Thursday, September 13, 2018, WalkBoston conducted a walk audit at Dennison Crossing in Framingham as part of the Executive Office of Public Safety and Security’s (EOPSS) Pedestrian Safety Planning Initiative for High-Fatality Communities. WalkBoston is working in partnership with EOPSS to address walking safety concerns in Massachusetts communities with high pedestrian crash rates, one of which happens to be Framingham, and the goal is to reduce pedestrian fatalities and serious injuries in the Commonwealth. Dennison Crossing was a particular area of concern because it is a vehicle-dominated landscape with high traffic volumes moving at relatively high speeds.","LONG TERM RECOMMENDATIONS":"- Install accessible pedestrian signals (including countdown clocks) at all traffic signal locations.\n- Make comprehensive accessibility improvements to sidewalks in the Dennison Crossing residential districts.\n- Link the multi-use path near the MetroWest Regional Transit Authority (MWRTA) transit center to others to form a network of safe walking and biking connections through downtown Framingham.\n- Consider the multi-use pathway as an opportunity to display public art to improve the aesthetics of the industrial settings and fence-line. A relevant example is the \"May This Never End\" art piece formerly on the Rose Kennedy Greenway and now in Allston, MA.","SHORT TERM RECOMMENDATIONS":"- Complete a comprehensive assessment of actual signal cycle lengths at each intersection in Dennison Crossing to verify the times collected during the walk audit.\n- Reprogram traffic signals to minimize pedestrian wait times (less than 90 seconds). Consider an automatic walk signal if concurrent phasing is employed.\n- Consider typical walker destinations and program signals so that people can cross to their destination in a single WALK cycle.\n- Evaluate the location and safety of crosswalks across Bishop Street at both the Clinton and Howard intersections to better serve the vulnerable populations using this busy corridor.\n- Determine whether there are low cost, quick fixes to improving sidewalk accessibility (e.g., paving details to accommodate mature trees, replacement of individual concrete panels rather than replacing the entire length of sidewalk).\n- Identify funding stream to install accessible sidewalks where they are missing throughout Dennison Crossing.\n- Trim trees along south side of Howard Street.\n- Improve wayfinding signs to better identify the trail as a public, safe, enjoyable alternative to walking along Blandin Avenue and Waverly Street","STREETS, INNTERSECTIONS + AREA COVERED":"Dennison Crossing, Concord St, Clinton St, Bishop St, Blandin Ave, Waverly St, Howard St, Kendall St","THEMES":"Connectivity, Comfort & Safety, Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Brendan Kearney ","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1YGFrGT4kzNvU0JpJ3_iP2xqS7bsrI5l3\/view?usp=sharing","CITY":"FRAMINGHAM","NEIGHBORHOOD":null,"TOWN_ID":100.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"FRANKLIN","YEAR":2011,"SUMMARY":"WalkMass conducted a 1.8-mile walk audit near Davis Thayer Elementary and Oak Street Elementary Schools in Franklin, Massachusetts, to assess walking conditions in the area. Organized by the Hockomock YMCA with funding from the MetroWest Community Health Foundation, the audit aimed to evaluate the walkability of public streets around the schools. Participants included staff from WalkMass, Hockomock YMCA, and faculty members from both schools.","LONG TERM RECOMMENDATIONS":"- Convert all streets to two-way and re-engineer the Emmons and West Central intersection into either a more traditional signalized 4-way intersection or a roundabout.\n- Rebuild a wider sidewalk with solid curbs from Church Street to Maple Street.\n- Replace the damaged pedestrian signal and button, and update the signal timing.\n- Add button-activated pedestrian crossing signals at the Emmons and West Central intersection.\n- Replace the damaged concrete slab and extend the sidewalk to Maple Street with concrete for durability and better walking surfaces.","SHORT TERM RECOMMENDATIONS":"- Repair or replace the broken sections of sidewalk.\n- Add crosswalks on West Central on the eastern and western edges of the intersection and north of the intersection on Emmons.\n- Replace the YIELD sign at Emmons and West Central with a STOP sign.\n- Create curb ramps by building ramps with asphalt to provide access from the street to the sidewalk.\n- Fill in the hole with asphalt and extend the sidewalk using asphalt from its terminus to Maple Street.\n- Update the signal timing on the walk button that currently works.\n- Remove the granite curb at the corners and build ADA-compliant access ramps.","STREETS, INNTERSECTIONS + AREA COVERED":"Davis Thayer Elementary School & Oak Street Elementary School","THEMES":"Accessibility, Schools, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/11\/Franklin-Davis-Thayer-Walking-Audit-Summary.pdf?70fb4f&70fb4f","CITY":"FRANKLIN","NEIGHBORHOOD":null,"TOWN_ID":101.0,"TYPE":"TC","COUNTY":"NORFOLK"},{"CITY\/TOWN":"FRANKLIN","YEAR":2011,"SUMMARY":"WalkMass conducted a walk audit near Helen Keller Elementary and Annie Sullivan Middle Schools in Franklin, Massachusetts, focusing on the pedestrian route between the school and Dacey Field, a remote drop-off location. Organized by the Hockomock YMCA with funding from the MetroWest Community Health Foundation, the audit involved WalkMass staff, YMCA staff, and a school grandparent.","LONG TERM RECOMMENDATIONS":"- Rebuild a wider sidewalk between Dacey Field and the school campus, including a grass buffer to separate the walkway from the roadway.\n- Re-engineer the Winterberry Drive intersection with narrower turning radii.\n- Add a grass buffer and plant trees along Lincoln Street to reduce vehicle speeds, using vertical elements like trees as traffic calming features.","SHORT TERM RECOMMENDATIONS":"- Reduce the effective width of travel lanes on Lincoln Street to 11 feet (or less) by painting a white line at least 1 foot in from the curb.\n- Add a crosswalk and “Children Crossing” signage at the Winterberry Drive intersection, and visually narrow the road by painting white lines a few feet in from each curb.\n- Re-paint white fog lines to slow traffic by narrowing travel lanes.\n- Work with residents to find alternative mailbox mounting techniques to keep sidewalks clear.\n- Expand the sidewalk with asphalt around utility poles to improve pedestrian access.","STREETS, INNTERSECTIONS + AREA COVERED":"Helen Keller Elementary School & Dacey Field","THEMES":"Schools, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/11\/Franklin-Keller-Walking-Audit-Summary.pdf?70fb4f&70fb4f","CITY":"FRANKLIN","NEIGHBORHOOD":null,"TOWN_ID":101.0,"TYPE":"TC","COUNTY":"NORFOLK"},{"CITY\/TOWN":"GARDNER","YEAR":2013,"SUMMARY":"WalkBoston conducted a walk audit workshop in the Montachusett Region in partnership with the Montachusett Public Health Network's Healthy Weight Initiative. The workshop covered the basics of pedestrian infrastructure, included an on-street walk audit in Gardner to evaluate the walking environment, and provided a discussion on findings and the audit process. Participants were encouraged to apply the skills learned to conduct similar workshops in their own communities.","LONG TERM RECOMMENDATIONS":"- Improve sidewalks and streetscape elements on Pleasant Street south of City Hall.\n- Install and\/or repair curbs, reinforce, and resurface sidewalks on Baker Street between Pleasant Street and Nichols Street.\n- Remove parking lane and widen sidewalks on Baker Street beyond Nichols Street.\n- Convert the parking lot at the intersection of Parker Street and City Hall Avenue into a public plaza space.\n- Paint bike lanes on both sides of Waterford Street to provide bike facilities and calm vehicular traffic.\n- Narrow driveway widths and tighten curb radii in the downtown area of Parker Street.\n- Maintain wide street rights-of-way (ROWs) for snow storage while using paint to better delineate vehicular lanes, bike lanes, and parking stalls.","SHORT TERM RECOMMENDATIONS":"- Install pedestrian crossing signs, particularly at mid-block crossings.\n- Paint center lines and fog lines on Baker Street.\n- Widen crosswalks and enhance or eliminate the crosswalk at Harvard Street.\n- Install pedestrian crossing signs at mid-block crossings on Parker Street.\n- Maintain brick crosswalks and pavement markings.","STREETS, INNTERSECTIONS + AREA COVERED":"Pleasant St, Baker St, Waterford St, & Parker St","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAudit-Gardner.pdf?70fb4f&70fb4f","CITY":"GARDNER","NEIGHBORHOOD":null,"TOWN_ID":103.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"GLOUCESTER","YEAR":2014,"SUMMARY":"The “Reimagining Railroad Avenue” study by MAPC and Gloucester focuses on improving pedestrian safety and quality in the area, particularly for senior citizens. Using “Healthy Aging through Community Design” funds, city officials, WalkBoston, and residents collaborated to identify challenges through community meetings and a walk audit. The audit highlighted hazardous conditions seniors face daily when accessing essential destinations like food, pharmacies, and transit.","LONG TERM RECOMMENDATIONS":"- Replace and repair sidewalks to create accessible routes connecting senior housing complexes to the Railroad Avenue area.\n- Implement raised crosswalks and curb extensions to slow down vehicular traffic.\n- Revise zoning ordinances and parking requirements to mitigate the impact of increased parking demand.\n- Conduct a parking management study to explore shared parking districts and strategies to allow for wider sidewalks or bike lanes.\n- Collaborate with stakeholders to develop long-term snow removal programs targeting key pedestrian routes.\n- Use paint to test new traffic patterns at critical intersections.\n- Develop a strategy to remove unnecessary on-street parking, enabling the addition of wider sidewalks, bike lanes, and other active street facilities.- ","SHORT TERM RECOMMENDATIONS":"- Monitor speeds and increase police enforcement if speeding is prevalent.\n- Increase police enforcement and issue tickets to violators.\n- Upgrade all crosswalks to ladder-style markings.\n- Use paint to define pedestrian zones in areas with wide driveways and undefined parking lots.\n- Reevaluate pedestrian-activated traffic beacons to ensure adequate crossing time for seniors.\n- Review the Department of Public Works snow removal procedures.\n- Enforce the City Snow Removal Ordinance and enhance snow removal programs for those unable to clear snow themselves.","STREETS, INNTERSECTIONS + AREA COVERED":"Washington St, Prospect\nSt, School St, Smith St, & Railroad Ave","THEMES":"\"Traffic Calming, Speed, Safety \", Connectivity, Weather Control","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAudit-SafeRoutesForSeniors-Gloucester.pdf?8621dc&8621dc","CITY":"GLOUCESTER","NEIGHBORHOOD":null,"TOWN_ID":107.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"GOSHEN","YEAR":2017,"SUMMARY":"WalkBoston conducted a walk audit with Goshen volunteer staff and residents along Route 9 and East St in response to new senior residences being constructed around the Goshen village center. Hilltown Community Development Corporation (CDC) responded to a Healthy Hampshire Request for Proposals to fund design projects to create more walkable town centers due to these new residences and out of a desire to connect the town's assets with a safe walking route.","LONG TERM RECOMMENDATIONS":"- Adopt a section of Route 9 roadway to give the town decision-making authority to change the speed limit and employ traffic calming measures. \n- Discuss enhanced pavement markings with MassDOT (e.g. ladder crosswalk design).\n- Ensure zoning and planning decisions concenctrate density in village center zone to promote walkability.\n- Design and construct an extension of the sidewalk along Route 9 with MassDOT District office.\n- Install sidewalk along East St leading to Tilton Farm and the Recycling Center.\n- Install wayfinding signage along walking loops between regional open space assets and the Goshen village center.\n- Pass a Complete Streets Policy.\n- Apply for technical assistance funding for a Complete Streets Prioritization Plan.","SHORT TERM RECOMMENDATIONS":"- Discuss traffic calming strategies with MassDOT District 1 staff to implement along Route 9.\n- Reach out to other towns in Hampshire County to learn about their experiences implementing traffic calming measures on state-owned roads.\n- Install an in-street pedestrian crossing sign and place in crosswalk on Route 9.\n- Request advance crosswalk signage along Route 9 on the north side of the crosswalk (currently only implemented on south side).\n- Incorporate benches, trees, and public spaces in the new housing development site design.\n- Rethink or redesign parking lot, tennis court, and existing park space to better serve the active and passive recreation needs of Goshen residents.\n- Determine width of East St right-of-way and evaluate the possibility of delineating pedestrian lane markings (install pedestrian lane if applicable).\n- Post signage indicating that pedestrians may be in the roadway.\n- Identify recreational walking loops that connect open spaces.\n- Produce walking maps to promote recreational walking in Goshen.","STREETS, INNTERSECTIONS + AREA COVERED":"Route 9 & East St","THEMES":"Age Friendly , Rural Communities, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Brendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2019\/02\/WB-Goshen-final-report.pdf?70fb4f&70fb4f","CITY":"GOSHEN","NEIGHBORHOOD":null,"TOWN_ID":108.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"HAVERHILL","YEAR":2014,"SUMMARY":"The City of Haverhill is participating in MassDOT’s program to enhance bicycle and pedestrian safety. As part of this initiative, WalkBoston conducted walk assessments with three primary goals: raising awareness of the infrastructure that impacts the walking environment, evaluating the safety and quality of the walking routes, and recommending infrastructure improvements. The City identified several high-priority intersections that pose safety risks to pedestrians and cyclists. With input from the Merrimack Valley Planning Commission, City officials, and the Haverhill Police Department, a walking route was established that focuses on key intersections in the Downtown and Acre neighborhoods.","LONG TERM RECOMMENDATIONS":"- Install and upgrade ADA-compliant curb ramps where needed.\n- Evaluate northwest intersection turning radii to accommodate truck traffic and prevent sidewalk driving.\n- Consider updating traffic signal design to provide extra gathering space.\n- Change signal timing to reduce pedestrian wait times and explore concurrent phasing with LPI.\n- Study relocating crosswalk to improve compliance and reduce motorist obstruction.\n- Install curb extensions (bump-outs) to improve visibility and shorten crossing distance.\n- Explore redesigning median as pedestrian refuge with protection on both sides of the crosswalk.\n- Consider installing a pedestrian refuge island median on Washington Street to prevent illegal U-turns and improve safety.\n- Evaluate curb extensions to shorten crossing and enhance pedestrian visibility.","SHORT TERM RECOMMENDATIONS":"- Relocate No RTOR signs next to traffic signal heads.\n- Repaint stop line on southbound White Street.\n- Upgrade pedestrian signal heads to countdown signals.\n- Review crosswalks on Winter Street near Locust Street; consider curb extensions or raised intersection.\n- Remove parking within 20’ of crosswalk on Winter Street and add signage for pedestrian visibility.\n- Paint edge lines\/parking stalls to define lanes and slow traffic.\n- Repair sidewalks on Locust Street between Winter and Walnut Streets.","STREETS, INNTERSECTIONS + AREA COVERED":"Winter St. & Washington Square","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Kasia Hart, & Brendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAssessment-Haverhill.pdf?70fb4f&70fb4f","CITY":"HAVERHILL","NEIGHBORHOOD":null,"TOWN_ID":128.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"HAVERHILL","YEAR":2021,"SUMMARY":"The Downtown Haverhill Virtual Walk Audit, part of a statewide project by WalkMass and MassINC, explored connections between walkability, transit access, and social infrastructure in Gateway Cities. Haverhill residents participated in online workshops, self-led or guided walk audits, and focus groups, documenting observations to identify areas for improvement. The findings were synthesized into recommendations to enhance walkability and guide local and state investments in safer, more enjoyable streets.","LONG TERM RECOMMENDATIONS":"- As new developments are proposed downtown, require publicly accessible green space where possible.\n- Improve crosswalk safety with enhanced visibility features and consider adding RRFBs or bump outs at midblock crossings.\n- Add lampposts and other lighting at regular intervals along main streets as well as side streets to create a continuously well lit walking path. Ensure that lighting is well maintained and that lightbulbs are replaced when needed.\n- Complete the boardwalk as planned.\n-For crosswalks where pedestrian visibility is low, add bumpouts, which reduce crossing lengths and make it easier for pedestrians and drivers to see each other coming.","SHORT TERM RECOMMENDATIONS":"- Work with local arts groups to host downtown events and partner with the Boys and Girls Club to engage youth in creating nearby youth-friendly spaces.\n- Maintain upkeep of landscaping in existing green spaces and add recreational equipment and dog-friendly areas where space permits.\n-  Focus on cleaning and maintaining ladder streets while enhancing streetscapes to create safer, more inviting walking routes downtown\n- Add more trash receptacles, increase collection frequency, and conduct regular cleanups.\n- Improve crosswalk visibility with in-street signage, reevaluate and extend crossing times, and reduce crossing distances with curb extensions.\n- Conduct a sidewalk inventory to identify and prioritize repairs and ensure ongoing maintenance.\n- Enhance downtown with murals, art installations, placemaking in vacant storefronts, and add seating, landscaping, and shade to create inviting spaces for pedestrians.\n- Add trees, seating, trash bins, and wayfinding signage to enhance comfort and orientation along the route.\n- Maintain trash, trim vegetation, and ensure clear sidewalks with more bins and regular upkeep.\n- Narrow driving lanes, adjust curb radii to slow speeds, and improve pedestrian visibility, with long-term plans to make these changes permanent.","STREETS, INNTERSECTIONS + AREA COVERED":"Section 1: Intersection of Washington Ave and Washington St, West St, & Bailey St\n\nSection 2: Intersection of Bailey Blvd and Emerson St, Winter St, Essex St, & Moulton Way","THEMES":"Youth, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/Downtown-Haverhill-Walk-Audit_-Recommendations-Memo.pdf?8621dc&8621dc&70fb4f&70fb4f","CITY":"HAVERHILL","NEIGHBORHOOD":null,"TOWN_ID":128.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"HUNTINGTON","YEAR":2017,"SUMMARY":"Volunteers and staff members in the Town of Huntington responded to a Healthy Hampshire\nRequest for Proposal for walkability project funding. The focus of Huntington’s proposal was the planning\nand construction of a “River Walk” along the Westfield River to better connect residents and visitors with\nthe natural assets in the region. Healthy Hampshire reached out to WalkBoston to lead a walk audit with the town staff and residents.","LONG TERM RECOMMENDATIONS":"- Discuss tightening of curb radii on the southeast corner and narrowing travel lanes at the intersection of Routes 112 and Route 20 just west of the bridge with MassDOT District Office.\n- Consider adopting a section of Route 20 and possibly Route 112 to give the town decision-making authority to implement traffic calming measures.\n- Acquire funding for crosswalk installations on town-owned and MassDOT roads.\n- Install missing sidewalks along Basket St,, Old Chester Rd, and E Main St between Mill St loop road \n- Build missing trail links on the town-owned land walking loop \n- Develop wayfinding signage programs for both walking loops; use trailblazers to list walking times to destinations \n- Include the trolley line easement into regional trail planning initiatives \n- Pass a Complete Streets Policy \n- Apply for technical assistance funding for a Complete Streets Prioritization Plan ","SHORT TERM RECOMMENDATIONS":"- Continue to discuss traffic calming strategies permissible on MassDOT roads with MassDOT District 1 staff; potential for additional in-street pedestrian signs in the crosswalks on Route 112.\n- Request MUTCD-approved signs pedestrian awareness signs be placed along Route 20 as drivers approach the town center.\n- Reach out to other towns in Hampshire County, such as Williamsburg, Lee and Northampton, to learn more about their experiences implementing traffic calming measures on state-owned roads.\n- Consider installing accessible crosswalks with curb ramps; begin conversations with MassDOT to understand feasibility, schedule, and potential funding streams.\n- Adopt a town-wide crosswalk standard (ladder or continental); MassDOT may be more likely to upgrade crosswalk designs on state-owned roads if the community has a crosswalk standard.\n- Evaluate feasibility of walking loop on town-owned land south of E Main St.\n- Publicize walking loops on town website and other platforms to promote their use.\n- Begin conversations with MassDOT and the town on prioritizing sidewalk improvements along Route 112, Basket St, and Old Chester Rd.","STREETS, INNTERSECTIONS + AREA COVERED":"E Main St, Basket St, Route 20, Route 112, Blandford Hill Rd","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacy Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1a7DJrRMvMcB07ePOPcIM730glrAwaL5j\/view?usp=sharing","CITY":"HUNTINGTON","NEIGHBORHOOD":null,"TOWN_ID":143.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"HYANNIS","YEAR":2018,"SUMMARY":"WalkMass conducted a walk audit along Route 132 in Hyannis as part of the EOPSS Pedestrian Safety Planning Initiative, addressing high pedestrian crash rates in Barnstable, which saw 3 fatalities and 122 injuries from 2012-2017. The audit focused on Route 132 between Independence Drive and Nightingale Lane, a high-crash corridor near the Cape Cod Mall and Capetown Plaza. The Town of Barnstable aims to improve pedestrian safety through design changes and is exploring a more walkable, mixed-use redevelopment of Capetown Plaza to enhance accessibility and reduce crashes.","LONG TERM RECOMMENDATIONS":"- Redesign Route 132 using a complete streets approach with narrower lanes, planted medians, and wide sidewalks or multi-use paths to serve all modes of transportation.\n- Study and implement additional signalized pedestrian crossings across Route 132 to improve accessibility to services on both sides of the road.\n- Develop connected service roads to enhance internal vehicular and pedestrian circulation along Route 132.","SHORT TERM RECOMMENDATIONS":"- Upgrade sidewalks and curb ramps on the southern side of Route 132 between Independence Drive and Hinckley Road, and evaluate the feasibility of adding sidewalks to the northern side.\n- Improve pedestrian crossings at the Cape Cod Mall\/Capetown Plaza intersection by enhancing visibility, ensuring ADA compliance, recalibrating signal timing for adequate WALK time, and adding fully functional pedestrian signals.\n- Restrict right turns on red at the Cape Cod Mall\/Capetown Plaza entry roads to enhance pedestrian safety.\n- Install wayfinding signage and designated walking areas to promote pedestrian circulation between adjacent properties.","STREETS, INNTERSECTIONS + AREA COVERED":"Route 132 (Iyannough Road)","THEMES":"Connectivity, \"Traffic Calming, Speed, Safety \", Economic Development","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Brendan Kearney","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/09\/WalkBoston-WalkAudit-Route132-Final.pdf?8621dc&8621dc","CITY":"HYANNIS","NEIGHBORHOOD":null,"TOWN_ID":null,"TYPE":null,"COUNTY":null},{"CITY\/TOWN":"LENOX","YEAR":2016,"SUMMARY":"WalkBoston conducted a walkability workshop on July 28, 2016, funded by the Massachusetts Department of Public Health Mass in Motion program. The workshop discussed the principles of walkable communities and summarized pedestrian infrastructure improvements that increase safety and improve the quality of the wlaking environment. Afterwards, a walk assessment was conducted with the goal of evaluating walking conditions in the Lenox town center, identifying a walking route that connects senior housing to the town center, and considering opportunities for wayfinding signs that highlight walking times to local destinations","LONG TERM RECOMMENDATIONS":"- Tighten curb radii at intersections; install curb ramps, crosswalks, and roadside crosswalk signs to make crossing more visible where needed.\n- Rethink location of angled parking in front of the Curtis House; redesign to accommodate marked crosswalk between Adams Community Bank and the Curtis House; could include curb bump-out or complete curb realignment to mirror curve and convert to parallel parking, or remove parking entirely to maximize pedestrian visibility.\n- Install curb bump-outs at locations where painted lines do not deter parking.\n- Consider establishing a safety zone throughout the designated historic district in the town center.\n- Establish town-wide guidance on the use of flush curbs to provide developers, designers, and transportation engineers with information on where flush curbs are appropriate.\n- Redesign and replace flush curbs with straight curbs in conflict locations.\n- Explore other options for slowing fast-moving traffic on Route 7A including narrow lanes.\n- Establish sidewalk prioritization plan and annual sidewalk replacement\/repair budget to systematically replace aging sidewalks leading to town center.\n- Identify locations where sidewalks do not currently exist where there is demand or desire for sidewalks to be built; a town-wide pedestrian plan could identify corridors leading from the town center to trail heads, schools, parks, and other local destinations.\n- Study the possibility of reconstructing the intersection of Housatonic St, Ore Bed Rd, and Old Center St with the goal of improving safety.\n- Develop an ADA compliance plan for the Town of Lenox that prioritizes areas with the highests volumes of pedestrians.\n- Secure funding for ADA compliance projects in the Town of Lenox (e.g. MassDOT Complete Streets funding program and Safe Routes to School Infrastructure program).","SHORT TERM RECOMMENDATIONS":"- Implement crosswalks and install accessible ramps and sidewalk connections between the municipal parking lots on the east side of Old Stockbridge connecting to the sidewalk on the west side just south of the residential driveway.\n- Relocate and\/or close the municipal and private residence driveways on Old Stockbridge just south of the West St intersection to make room for a marked crosswalk and accessible ramp.\n- Install roadside crosswalk signs to make the crossing more visible.\n- Review location of stop sign and stop line where Old Stockbridge meets West St.\n- Move existing crosswalk sign at the Walker\/West\/Main\/Old Stockbridge intersection closer to the edge of the road and consider installing advance crosswalk signs.\n- Remove parking space striping from the two mid-block crosswalks on Walker St between Church St and Main St intersection and the three mid-block crosswalks on Main St between West St and Cliffwood St.\n- Install no parking signs near crosswalks and at intersections.\n- Paint diagonal white lines in no parking zones adjacent to crosswalks and intersections.\n- Work with the Lenox Police Department to enforce no parking ordinances.\n- Establish town crosswalk design standards that include guidelines for raised crossings, raised intersections, mid-block crossings, and crossings at intersections.\n- Install temporary curbing along eastern edge of Church St flush curb to differentiate sidewalk from travel way in fron tof children's clothing and toy store.\n- Consider temporary curbing at the Franklin St\/Main St intersection to delineate sidewalk.\n- Paint a ladder crosswalk across Main St at the Main\/Franklin intersection.\n- Identify priority sidewalks leading to the town center in need of repair\/replacement.\n- Coordinate with the Department of Public Works resurfacing\/reconstruction programs.\n- Evaluate feasibility and safety implications of installing a crosswalk between Ore Bed Park and Old Center St.\n- Consider installing a sidewalk, pedestrian warning signs, and\/or pavement markings to bring awareness that people may be walking.\n- Advise the dental office to move their sign so that it does not encroach upon the sidewalk.\n- Determine if high priority locations are already on the Department of Public Works schedule for road reconstruction\/repaving and ensure that ADA improvements are included in the projects.\n- Consider looking for resources to conduct a pilot wayfinding program; identify destinations to include in the program","STREETS, INNTERSECTIONS + AREA COVERED":"Walker St, Route 183, Route 7A, Old Stockbridge Rd, West St, Sunset Ave, Franklin st, Church St, Housatonic St","THEMES":"Age Friendly , Connectivity, Rural Communities, Accessibility, Schools, Policy","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Brendan Kearney","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1HOwb-p8fB_XQIxsuDbhf-oaN6ou7CfBx\/view?usp=sharing","CITY":"LENOX","NEIGHBORHOOD":null,"TOWN_ID":152.0,"TYPE":"T","COUNTY":"BERKSHIRE"},{"CITY\/TOWN":"LENOX","YEAR":2017,"SUMMARY":"The Town of Lenox reached out to WalkBoston to conduct a walk audit in Lenox Dale to assess the safety and quality of the pedestrian environment in the village as well as to identify opportunities to connect the regional open space and historical assests in the Lenox area with walking paths or routes. Lenox is participating in the Massachusetts Department of Transportation (MassDOT) Complete Streets Funding Program to secure funds for bicycle and pedestrian infrastructure projects in town. Lenox has completed the first two steps to receive funding by passing a Complete Streets policy and submitting a Complete Streets Prioritization Plan. WalkBoston completed a walk audit in Lenox Center in the summer of 2016. Many of the infrastructure recommendations made in that audit were included in the Prioritization Plan. The Town of Lenox staff wanted to give Lenox Dale residents the same opportunity to participate in a walk audit to identify needed  infrastructure improvements in the Dale.","LONG TERM RECOMMENDATIONS":"- Prioritize residential roadways in the Dale in need of additional pedestrian infrastructure such as sidewalks or pavement markings.\n- Replace Elm St sidewalk to meet accessibility standards considering width, curb ramps, and detectable warning panels.\n- Add accessible curb ramps along Crystal St at all intersections and marked crosswalks.\n- Upgrade existing crosswalks to meet current accessibility standards with curb ramps and detectable warning strips.\n- Initiate formal feasibility study of a walking route\/multi-use path to connect open space and historic assets along the Housatonic River with other neighboring communities.","SHORT TERM RECOMMENDATIONS":"- Consider adding sidewalks or pedestrian lane pavement markings on residential streets with high volumes of pedestrians and relatively high volumes of vehicles driving quickly (e.g., Patterson Rd to Montessori School, Catherine St, Golden Hill Rd north of Lasher Lane).\n- Deliberately design roadways that will remain shared with no pavement markings delineating space for user groups (e.g., Lawton St, Henry Ave, School St, Old Town Way).\n- Consider narrowing travel lanes (no wider than 11') by repainting fog lines on Crystal St.\n- Work with Lenox police department to evaluate reported speeding issues on Crystal St; initiate speed enforcement patrols periodically if driver behavior warrants them.\n- Include sidewalk extension along Golden Hill Rd to Henry Ave as part of the Walker St reconstruction project.\n- Evaluate whether sidewalks are needed or feasible along or at the Catherine St\/Golden Hill Rd intersection.\n- Evaluate whether any of the residential streets need sidewalks based on dangerous walking conditions or high pedestrian and vehicular traffic volumes.\n- Include construction of accessible curb ramps and a crosswalk on Crystal St at the bus stop in the current Crystal St resurfacing project.\n- Install advance crosswalk signs and pedestrian crossing signs at existing crosswalks.\n- Consider additional crosswalks on Crystal St north of the Post Office, if needed near other entrance roads along the east side of Crystal St.\n- Study need for additional crosswalks at the Walker St\/Mill St\/Crystal St intersection. One may be needed if a walking route is established along Crystal St reaching into town-owned land along an easement on the west side of the Housatonic River beyond the intersection with Walker St.","STREETS, INNTERSECTIONS + AREA COVERED":"Elm St, Crystal St, Mill St, Walker St, Golden Hill Rd, Catherine St","THEMES":"Accessibility, Comfort & Safety, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Julia Wu","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1kTZwI52sBq8JMGOCCTxvIcUdZQdLPh3r\/view?usp=sharing","CITY":"LENOX","NEIGHBORHOOD":null,"TOWN_ID":152.0,"TYPE":"T","COUNTY":"BERKSHIRE"},{"CITY\/TOWN":"LOWELL","YEAR":2017,"SUMMARY":"On Tuesday, September 19, 2017, WalkBoston conducted a walk audit on High Street with support from the Massachusetts Executive Office of Public Safety and Security (EOPSS) Pedestrian Safety Planning Initiative for High-Fatality Communities. The goal of the walk assessment was to recommend improvements to the local built environment that improve pedestrian safety.","LONG TERM RECOMMENDATIONS":"- Install traffic signals equipped with accessible pedestrian countdown signals\n- Replace all sidewalk panels in need with concrete sidewalks\n- Ensure that all ramps are compliant with ADA standards and add detectable warnings and level landings\n- Raise curbs to provide 6\" reveal between the roadway and sidewalk\n- Reduce the extensive curb cuts leading to businesses and surface parking along the west side of High St\n- Paint the \"Ls and Ts\" to delineate parking spaces and bus stops on the roadway\n- Install curb bump outs at the mid-block crossing in front of the Norton Family Manor\n- Consider installing a Rectangular Rapid Flashing Beacon (RRFB) in front of the Norton Family Manor","SHORT TERM RECOMMENDATIONS":"- Install highly visible STOP signs on all approaches; move or replace STOP sign on northbound High Street approach\n- Paint STOP lines to indicate the location where drivers are required to stop\n- Install school zone flasing beacons along E Merrimack St and High St\n- Repair\/replace sidewalk panels in dire need of repair, such as near mature trees\n- Enforce parking regulations; issue tickets to those in violation\n- Paint diagonal lines and install flex posts indicating no parking zones at intersections and near mid-block crossing\n- Install No Parking signs\n- Install curb ramps to access mid-block crossing in front of the Norton Family Manor\n- Extend the pedestrian phase so pedestrians can cross the High\/Andover intersection diagonally\n- Consider adding additional time to the all RED phase to allow cars to clear the intersection\n- Place a back plate on the traffic signals to make them more visible\n- Consider instituting No Right Turn on Red at the intersection to reduce crash rates and protect pedestrians in the crosswalk from right turning vehicles","STREETS, INNTERSECTIONS + AREA COVERED":"Andover St, High St, E Merrimack St, Chestnut St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1HBGJf6vbrOLi18vZ5t9gWmbOpLmdgWHe\/view?usp=sharing","CITY":"LOWELL","NEIGHBORHOOD":null,"TOWN_ID":160.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"LOWELL & CHELMSFORD","YEAR":2019,"SUMMARY":"The Drum Hill Road\/Westford Street Walk Audit, conducted by WalkMass through the Mass in Motion program, assessed walkability and pedestrian safety along a key corridor connecting Chelmsford and Lowell, MA. Participants documented challenges such as high traffic speeds, inadequate crosswalks, and poor pedestrian visibility, which limit safe access to nearby residences, businesses, and retail spaces. The findings aim to guide improvements in walkability and pedestrian infrastructure for a safer, more accessible environment.","LONG TERM RECOMMENDATIONS":"- Narrow travel lanes on Technology Dr to 10 feet during repaving to reduce vehicle speeds.\n- Add curb extensions and tighten radii to slow turns, enhance pedestrian visibility, and shorten crossings.\n- Ensure development projects require property owners to build and maintain sidewalks and connections to neighboring properties.\n- Redesign the intersection to improve pedestrian safety by realigning Parkhurst Road to meet Drum Hill Road at a 90-degree angle, removing signalization at the Gulf Station driveway, tightening curb radii, and adding pedestrian signals and crosswalks.","SHORT TERM RECOMMENDATIONS":"- Add a raised crosswalk and MUTCD-compliant pedestrian signage at 55 Technology Dr.\n- Repaint crosswalks, assess adding a traffic signal with pedestrian features, improve visibility by adjusting the stone wall, and repair sidewalks for better accessibility on Technology Dr.\n- Repair the pedestrian signal at the crosswalk infront of Walmart, update signage to MUTCD standards, and install continuous 5’ sidewalks with tree-lined buffers along Westford Street\/Drum Hill Road.\n- Add a crosswalk to improve pedestrian visibility at the Gulf Gas Station driveway and trim vegetation .","STREETS, INNTERSECTIONS + AREA COVERED":"Technology Dr, Drum Hill Rd, Westford St, & Intersection of Drum Hill Rd & Westford\nSt","THEMES":"\"Traffic Calming, Speed, Safety \", Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, LeighAnne Taylor, & Ayesha Mehrotra","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2019\/08\/WalkBoston-DrumHillWalkAuditReport-Lowell.pdf?70fb4f&70fb4f","CITY":"LOWELL & CHELMSFORD","NEIGHBORHOOD":null,"TOWN_ID":null,"TYPE":null,"COUNTY":null},{"CITY\/TOWN":"LYNN","YEAR":2014,"SUMMARY":"WalkBoston conducted a walk audit along a route incorporating a section of downtown Lynn in response to the city's growing concerns about bicycle and pedestrian safety. Key observations from participants include outdated equipment and signage, a lack of ADA compliancy, and an overall difficulty for pedestrians and road users alike to navigate crossings and intersections.","LONG TERM RECOMMENDATIONS":"- Evaluate traffic directional patterns on Central Ave and throughout the city to maximize pedestrian safety while maintaining reasonable traffic flows and limiting vehicular back-ups\n- Evaluate traffic patterns in and around City Hall Square for ways to improve pedestrian safety\n- Consider a concurrent phase pedestrian traffic signal with a leading pedestrian indicator; one-way traffic patterns should make concurrent phase possible\n- Evaluate the safety implications of marking a crosswalk across Central Ave at Sutton St; paint a crosswalk across Sutton St at Central Ave\n- Install ADA-compliant curb ramps and detectable warning strips\n- Reduce curb radius on northeast corner of Central\/Liberty St intersection to shorten crossing distance\n- Add pedestrian push button-activated pedestrian phase to flashing traffic signal at Oxford\/Central to provide a protected crossing phase\n- Do a comprehensive review of pedestrian crossings and desire lines\n- Evaluate location of existing crosswalks based on pedestrian desire lines and legal vehicular traffic movements in Linnehan Square\n- Review street network and traffic flows (one-way vs two-way) to determine if vehicular cut-through behavior can be modified\n- Repair or replace curb ramps and detectable warning strips where needed\n- Evaluate the safety of painting a mid-block crosswalk across Central Ave between Linnehan Square and Central Square\n- Evaluate light conditions under overpass at night and install lighting to improve visibility for drivers and pedestrians\n- Study Freeman Square traffic patterns and redesign square with appropriate pedestrian refuge islands and traffic medians that clarify traffic movements, protect pedestrians at street crossings, and improve functionality of vehicular traffic flow","SHORT TERM RECOMMENDATIONS":"- Use pavement markings and paint to narrow travel lanes and slow traffic; paint parking lanes or edge lines.\n- Repair pedestrian traffic signal so that it faces the pedestrians using it in City Hall Square.\n- Paint or repaint crosswalks with ladder or continental designs and stop lines.\n- Work with business owner on southwest corner to delineate walking zone from parking zone at Central and Sutton.\n- Remove parking at southwest corner of Sutton\/Central to increase pedestrian visibility.\n- Paint crosswalk between curb ramps on Central Ave and limit parking within 20' of crosswalk.\n- Remove diagonal crosswalk at Central\/Washington in Olympia Square and relocate along Central Ave before intersection with Andrew St.\n- Paint stop bar with a STOP legend on the pavement and add stop sign to the left sign to increase compliance with stop sign.\n- Repair or replace pedestrian traffic signal at Oxford and Central Ave.\n- Evaluate location of senior crossing sign and either remove it or add crosswalk.\n- Upgrade traffic island in Linnehan Square and\/or install bump-outs to shorten crossing distances and make pedestrians more visible and movements more predictable in the square; ADA-compliant curb ramps and detectable warning strips may be needed.\n- Use in-street pedestrian signs to help alert drivers to presence of crosswalks.\n- Install additional \"yield to pedestrian\" signs, roadside pedestrian crossing signs, and\/or in-street pedestrian signs to help alert drivers to presence of crosswalks.\n- Remove on-street parking along Union St nearest to the curve to improve motorists' visibility of pedestrians; consider using an in-street pedestrian sign.","STREETS, INNTERSECTIONS + AREA COVERED":"Central Avenue, Essex St, North and South Common St, Market St, Sutton St, Liberty St, Washington St, Oxford St, Andrew St, Willow St, Blake St, Munroe St, Union St, Buffumm St, Baldwin St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity, Bike or Bus, Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Brendan Kearney, Laura O'Rourke","VIEW_link":"https:\/\/drive.google.com\/file\/d\/13VB06bjsLlGYS3lTDIToZSK4tNRrwU0v\/view?usp=drive_link","CITY":"LYNN","NEIGHBORHOOD":null,"TOWN_ID":163.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"MANCHESTER-BY-THE-SEA","YEAR":2015,"SUMMARY":"School Street connects Route 128 to Route 127, Manchester’s “Main Street,” and because it is one of the town’s connecting streets it carries fairly heavy traffic traveling at speeds that make walking uncomfortable. Because School Street provides walking access to the community's elementary, middle, and high schools, there is great interest in increasing pedestrian safety along the street","LONG TERM RECOMMENDATIONS":"- Install stop signs at Pleasant, Lincoln, Vine, and Brook St to slow traffic, improve yielding behavior by drivers, and discourage the use of School St by large trucks\n- Fix curb ramps at each street crossing, tighten turning radius at each intersection, and add bump outs at locations with crosswalks\n- Add raised crosswalks if needed once previous improvements are in place\n- Install pedestrian scale lighting along School St which will add a visual cue to drivers that they are in a zone where walkers are expected\n- Reconfigure the School\/127 intersection to as tight an angle as possible to significantly reduce the crossing distance for both School St and Route 127\n- Seek approval to use mid-block crossing sign on Route 127 at School St\n- Complete the sidewalk where it is missing on the east side of School St near Sawmill Brook","SHORT TERM RECOMMENDATIONS":"- Install in-street \"Yield to Pedestrian\" signs in the crosswalks at Pleasant, Lincoln, Vine, and Brook St to slow traffic and improve yielding behaviors by drivers\n- At each crosswalk on School St, do no allow parking within 20' of the crosswalk on either side of the crosswalk by painting pavement markings; daylighting the crossing area will make pedestrians more visible to drivers and give pedestrians better sight lines to see approaching traffic\n- Enforce no parking on sidewalk regulations along School St\n- Re-stripe School St by shifting the double yellow line to allow one 10' southbound lane, one 10' northbound lane, and a 7' striped parking lane on the west side of the street\n- Reduce the width of the curb cut on School St near Route 127 to make the sidewalk safer, and move the mailboxes to a new location while adding a stop sign and in-street yield to pedestrian signs to make the crossing there safer","STREETS, INNTERSECTIONS + AREA COVERED":"School St, Route 128, Route 127","THEMES":"Age Friendly , \"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Mass in Motion","VIEW_link":"https:\/\/drive.google.com\/file\/d\/17lT2_m_8hed2nmxYhKsmy9xSrdhh1KfX\/view?usp=sharing","CITY":"MANCHESTER-BY-THE-SEA","NEIGHBORHOOD":null,"TOWN_ID":166.0,"TYPE":"T","COUNTY":"ESSEX"},{"CITY\/TOWN":"MANCHESTER-BY-THE-SEA","YEAR":2019,"SUMMARY":"In partnership with the Mass in Motion program, a walk audit in Manchester-by-the-Sea focused on the area between Manchester Memorial Elementary School and the village center. Key issues identified include narrow sidewalks, low-visibility crosswalks, and insufficient signage, impacting access to schools, the commuter rail, and local businesses. With 20.6% of residents being children and upcoming school renovations requiring new routes, the project aims to improve pedestrian safety and accessibility for all.\n","LONG TERM RECOMMENDATIONS":"- Improve pedestrian visibility at the Union Street - Beach Street intersection.\n- Ensure that hedges and other plantings along sidewalks remain clear of the sidewalk and that no other materials infringe on pedestrian space.\n- Implement plans from the Complete Streets proposal for this intersection.","SHORT TERM RECOMMENDATIONS":"- Implement strategies to reduce traffic speeds on School Street. Enforce maximum lane widths of\n10 feet on School Street.\n-Install clearly marked crosswalks in front of schools with visible signage.\n- Organize a student walk audit to better understand what challenges children encounter on their walks to school.\n- Implement projects to paint streets along popular routes to school with a playful, colorful pattern that notify vehicles that children may be walking in the street.\n- Notify households surrounding the school that they should keep their sidewalks clear of plantings and other items.\n- Undertake a tactical urbanism project to expand the median and extend the curbs, informally and impermanently narrowing the driving lanes.","STREETS, INNTERSECTIONS + AREA COVERED":"Vine St, Norwood Ave, Union St, School St, Lincoln St, & Intersection between Norwood Ave, Washington St, and Union St","THEMES":"Schools, Youth, Comfort & Safety, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Ayesha Mehrotra","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2019\/07\/WalkBoston-MBTSVillageWalkAudit.pdf?70fb4f&70fb4f","CITY":"MANCHESTER-BY-THE-SEA","NEIGHBORHOOD":null,"TOWN_ID":166.0,"TYPE":"T","COUNTY":"ESSEX"},{"CITY\/TOWN":"MEDFORD","YEAR":2018,"SUMMARY":"Participants met near the corner of Salem and Vine St before walking along Salem St to observe existing pedestrian conditions and discuss some of the opportunities to improve the safety and attractiveness of the street for people walking. This audit, along with city residents, was conducted with members of MassDOT Safe Routes to School, Walk Medford, and Mass in Motion.","LONG TERM RECOMMENDATIONS":"- Fix uneven and broken sidewalks to create a level walking path\n- Clear or provide smooth, graded asphalt path over tree roots\n- Add bump-arounds to add accessible sidewalks where there are large trees blocking the sidewalk\n- Re-grade driveways to make a level sidewalk\n- Re-build intersections and crosswalks to enhance walking:\n- Add bumpouts to reduce crossing distances and enhance visibility\n- Tighten curb radii at all corners to shorten crossing distances and slow turning vehicles\n- Wherever possible, construct curb ramps at right angles into crosswalks, not angled on corners (apex ramps)\n- Work with business owners to narrow curb cuts into parking or service areas and thus slow turning vehicles and reduce pedestrian exposure to turning vehicles.\n- Create site plan regulations requiring minimal and narrow curb cuts across thesidewalk.\n- Install pedestrian friendly street lighting.\n- Set most traffic signals with concurrent WALK lights (with pedestrians walking while traffic moves in the same direction) that include Leading Pedestrian Indicators (LPIs) which give walkers a head start across the intersection. Intersections where this may not be appropriate include locations with heavy turning movements (250+\/hour) or near schools or senior housing.\n- Work with Target to provide a safe and attractive walking route across the parking lot to the front door of the store. We observed many pedestrians crossing the lot without a clear path or any protections from traffic.","SHORT TERM RECOMMENDATIONS":"- Add in-street vertical “Yield to Pedestrian” signs; consider asking local businesses or residents to sponsor or adopt the signs – to set them up if they are knocked over, bring them inside if it snows, and let the City know if the sign needs to be replaced.\n- Repaint cross walks with reflective paint to add visibility.\n- Add shark’s teeth markings at mid-block crossings (if any are added in the future).\n- Provide signage and pavement marking to pull parking back at least 20 feet from all crosswalks (from the approaching direction\nof vehicles) to increase visibility of pedestrians who are crossing the street – important for walkers to see vehicles and for drivers to see people crossing. Because this will result in the loss of some parking spaces, it will require a community outreach and engagement process. Consider beginning with the school community and Walk Medford to enlist local supporters.\n- Add ‘fog lines” or parking space lines to perceptually narrow the travel lanes and thus slow traffic.\n- Use paint and flex posts to tighten curb radii to shorten crossing distances and slow vehicles as they are turning.\n- Where construction projects are underway (e.g. Everett Street) work immediately with City staff and developers to tighten curb radii as part of the development process.\n- Straighten angled crosswalks where possible to reduce crossing distances.\n- Mill the edges of slightly uneven sidewalk pavers to reduce tripping hazards (this cannot provide adequate repairs where the pavers are significantly uneven or broken, but can deal with smaller uneven spots).\n- Add speed feedback signs in locations where vehicle speeds are the highest\/problematic. Research suggests that these signs provide the most significant benefits shortly after they are installed and that they should be used on a temporary basis.\n- Plant new trees where possible without narrowing the sidewalk – consider working with adjacent property owners to plant trees on private property adjacent to the sidewalk.\n- Maintain and install benches, and consider working with adjacent property owners to place benches on private property adjacent to the sidewalk. Install benches with armrests to ensure that they serve people of all ages and physical abilities.\n- Consider implementing a pilot intersection improvement at Hadley Place\/Salem Street to demonstrate many of the short term improvements such as temporary bulb outs, signage and pavement markings, and use of flex posts to create tight turning radii.\n- To ensure that busy pedestrian routes remain accessible after snow storms – for examples on walk-to-school routes or along bus corridors – the City might take responsibility for ensuring that curb ramps and bus stops are well cleared. This can be implemented along the same streets and sidewalks where property owners remain responsible for sidewalk snow shoveling.","STREETS, INNTERSECTIONS + AREA COVERED":"Salem St, Haines Square, Everett St","THEMES":"Connectivity, Schools, \"Traffic Calming, Speed, Safety \", Age Friendly , Accessibility, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Wendy Landman","VIEW_link":"https:\/\/drive.google.com\/file\/d\/13vq4e7lV2QR9Rb6M8NL7Wbxrc1o8iFEX\/view?usp=sharing","CITY":"MEDFORD","NEIGHBORHOOD":null,"TOWN_ID":176.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"MELROSE","YEAR":2012,"SUMMARY":"WalkMass conducted a walkability assessment in Melrose, Massachusetts, near Lincoln Elementary School. The assessment focused on pedestrian safety and routes students use to walk to and from school. After an initial discussion of safety concerns and the assessment process, the group performed an on-the-street audit of the area's pedestrian facilities.","LONG TERM RECOMMENDATIONS":"- Raise crosswalks near Lincoln Elementary (speed tables) and add advance signage to alert drivers.\n- Relocate the crosswalk east of the school driveway to the west to avoid crossing over the driveway.\n- Tighten corners at Pleasant and West Wyoming to reduce turning speeds.\n- Install curb ramps, signage, and a crosswalk connecting the Lincoln School fields and the apartment walkway on Pleasant Street.","SHORT TERM RECOMMENDATIONS":"- Place pedestrian crossing signage in the center of the roadway year-round to increase driver awareness of pedestrians.\n- Install ADA-compliant curb ramps at crosswalks near Lincoln Elementary.\n- Add \"STOP\" signs and paint stop bars near Everett Street to slow drivers before crosswalks.\n- Install signage and pavement markings indicating a school zone and pedestrian presence.\n- Re-direct or contain the downspout with a rain barrel to prevent walkway drainage issues.","STREETS, INNTERSECTIONS + AREA COVERED":"Lincoln Elementary School","THEMES":"Youth, Schools, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/01\/WalkBoston-LincolnElementarySchoolWalkabilityAssessment1-Melrose.pdf?8621dc&8621dc","CITY":"MELROSE","NEIGHBORHOOD":null,"TOWN_ID":178.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"MELROSE","YEAR":2017,"SUMMARY":"The goal of the project was to identify potential infrastructure projects, bicycle- and pedestrian-\nfriendly policies, and education and encouragement programs that will encourage more students (and staff) to ride bicycles or walk to school. WalkBoston and WatsonActive observed Middle School\/High School arrival on April 25 and 27, 2017. The City Engineer requested a preliminary report recommending a project for  possible inclusion in the City’s Complete Streets Prioritization Plan. WalkBoston and WatsonActive delivered a report of infrastructure recommendations for Melrose Street on April 28, 2017.","LONG TERM RECOMMENDATIONS":"- Consider limiting left turns out of The Knoll at dismissal time\n- Continue to educate students on the importance of using crosswalks to walk across the Parkway \n- Consider the feasibility of constructing a bike path between the sidewalk and staff parking lot\n- Install a new crosswalk, required curb ramps, and detectable warning panels across Melrose St on the north side of the staff parking lot entrance; place an in-street pedestrian\n- Close\/block off the drop-off loop located on the school-side of Melrose St between Ashland St and Albion St; place an in-street pedestrian crossing sign in the crosswalk during school arrival and dismissal\n- Establish formal drop off zones using signage and potentially pavement markings along the school side of Melrose St\n- Prohibit on-street parking at all times on both sides of Melrose St between Lynn Fells Parkway and Tremont St; replace signage accordingly\n- Consider installation of standard striped bicycle lanes on both sides of the roadway adjacent to the curb\n- Use green pavement coloration and signage where bicycle facilities coincide with designated drop-off zones\n- Consider installing curb bump-outs on Lynn Fells Parkway on the west side of the Melrose St intersection\n- Consider adding more bike racks and especially more covered bike parking\n- Explore feasibility of providing afternoon shuttle service for middle and high school students to common destinations","SHORT TERM RECOMMENDATIONS":"- Paint a crosswalk across The Knoll entrance drive\n- Consider moving the crosswalk and curb ramps from the north side of Albion St to the south side of Albion St if drop-off loop remains; place an in-street pedestrian crossing sign\n- Enhance the crosswalk across Melrose St at Ashland St with upgraded pavement markings\n- Consider installation of advisory (dashed) bicycle lanes\n- Consider applying neighborhood slow streets\/traffic calming measures to emphasize shared use and low speed such as signage, road markings, and intersection traffic diverters","STREETS, INNTERSECTIONS + AREA COVERED":"Melrose St, Tremont St, Ashland St, Albion St, Main St, Lynn Fells Parkway","THEMES":"Accessibility, Schools, \"Traffic Calming, Speed, Safety \", Bike or Bus, Connectivity, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1s09hVmntaJOlOwbAlt8__M06UGS2f-XI\/view?usp=sharing","CITY":"MELROSE","NEIGHBORHOOD":null,"TOWN_ID":178.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"NEW BEDFORD","YEAR":2014,"SUMMARY":"The City of New Bedford, participating in the Massachusetts Department of Transportation’s Highway Safety Improvement Program, identified high-priority intersections that pose significant risks to pedestrians. WalkBoston conducted a walk assessment in the city's central commercial district, focusing on four particularly dangerous intersections, to explore potential remedies for improving pedestrian safety. This assessment aims to scope out necessary changes and provide actionable recommendations for enhancing safety at these high-risk intersections.","LONG TERM RECOMMENDATIONS":"- Add crosswalk and curb ramps on the north side of the intersection.\n- Replace curb and tighten the curb radius at the northeast corner to discourage fast turns.\n- Add regulatory signage (one-way, do-not-enter) on Pleasant and Elm Streets.\n- Upgrade curb ramps to ADA standards with detectable warning strips.\n- Add bump-outs at the south side crosswalks on Elm Street to reduce crossing distance.\n- Add edge (fog) lines on the south side of Elm Street to slow traffic or create a bike lane.\n- Add a crosswalk over Elm Street at Eighth Street.\n- Install mid-block crosswalks and curb ramps on County Street.\n- Extend pedestrian signal timing and consider leading pedestrian indicators.\n- Add a mid-block crossing of Union Street at Seventh and Eighth Streets with curb ramps.\n- Consider traffic calming measures at Market and Pleasant Streets (e.g., curb bump-outs, raised crossings).","SHORT TERM RECOMMENDATIONS":"- Repair and repaint red bituminous crosswalks for visibility.\n- Install pedestrian countdown signals and push buttons on all approaches.\n- Paint parking space lines on County Street to narrow travel lanes.\n- Upgrade signal equipment with new pedestrian heads and push buttons.\n- Add edge (fog) lines on Pleasant Street to slow traffic.\n- Add mid-street warning signs at the Market Street intersection.\n- Repaint parking spaces for police vehicles away from crosswalks.","STREETS, INNTERSECTIONS + AREA COVERED":"County St, Elm St, Pleasant St, & Union St","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF ","FACILITATOR\/AUTHOR":"Stacey Beuttell & Bob Sloane","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAssesment-NewBedford.pdf?70fb4f&70fb4f","CITY":"NEW BEDFORD","NEIGHBORHOOD":null,"TOWN_ID":201.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"NEW BEDFORD","YEAR":2016,"SUMMARY":"South End Engaged, an initiative coordinated by the United Way of Greater New Bedford, hosted a walk\nassessment to further the group’s vision for the South End: \"All residents of the South End of New Bedford are\nsafe, healthy, and have the knowledge and skills to thrive.\" The main goals of the assessment included economic revitalization, family and school engagement, health and safety, and resident organization. WalkBoston conducted the assessment on October 19. 2016, funded by the Massachusetts Department of Public Health Mass in Motion program. ","LONG TERM RECOMMENDATIONS":"- Participate in the planning and design of the South End road reconstruction projects to ensure adequate sidewalk width and connectivity\n- Install ADA-compliant curb ramps and detectable warning panels on all approaches to all intersections and mid-block crossings\n- Identify partnership and funding opportunities to implement new gateway concept at Grinnell\/South 2nd St intersection\n- Install pedestrian traffic signals at the Rivet\/County St intersection\n- Redesign streets within the study area to reduce traffic speeds and provide a safe environment for people walking in the neighborhood\n- Consider establishing a slow zone throughout the South End neighborhood; slow zones limit traffic speeds to 20 mph much like a school zone","SHORT TERM RECOMMENDATIONS":"- Replace sidewalk panels disrupted due to tree roots (New Bedford Department of Public Infrastructure (DPI) has a short-term fix that preserves the tree and provides a smoother sidewalk)\n- Replace asphalt sidewalk between Rivet St and Potomska St with a concrete sidewalk\n- Motivate residents and property owners to trim vegetation and pick up litter\/trash on the sidewalks near their property; neighborhood organizations, faith-based institutions, schools, or social service organizations can be good partners in these efforts\n- Activate sidewalks with activity along high-volume pedestrian corridors (e.g. temporary installations, pop-up parks, parklets (temporary seating areas placed in parking spaces in front of businesses to provide outdoor gathering spaces))\n- Develop a crosswalk painting plan that prioritizes highly utilized pedestrian corridors and walk-to-school routes\n- Paint new high visibility crosswalks at high priority locations; continue with lower priority locations as funding and time allows\n- Repaint existing crosswalks with high-visibility crosswalks\n- Install school zone beacons and signage along South 2nd St near the Gomes and Renaissance Schools\n- Hold community design charrettte\/workshop to rethink the connection between the neighborhood and the Gomes\/Renaissance Schools at Grinnell St\n- Install No Right Turn on Red signs on all approaches at the Rivet\/County St intersection to provide some protection for pedestrians crossing without a pedestrian signal\n- Engage the city in a conversation regarding the use of concurrent and exclusive signal timing; concurrent signal timing has been shown to increase pedestrian compliance and shorten overall cycle times for all users (recommended except when signals are located within school zones or in areas with high numbers of seniors)\n- Work with New Bedford police to monitor and enforce speed limits along Sout 2nd St and County St","STREETS, INNTERSECTIONS + AREA COVERED":"Grinnell St, South 2nd St, South 1st St, Delano St, County St","THEMES":"Age Friendly , Accessibility, Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1buLcSldfP8mPeyzgiD9rzx_LBbn8UaqQ\/view?usp=sharing","CITY":"NEW BEDFORD","NEIGHBORHOOD":null,"TOWN_ID":201.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"NEW BEDFORD","YEAR":2016,"SUMMARY":"The Acushnet Avenue neighborhood walk assessment supplements the great efforts of the Love the Ave\ninitiative, facilitated by the Massachusetts Smart Growth Alliance, and the recent City of New Bedford’s\nroad safety improvements in the neighborhood. WalkBoston connected with the Love the Ave initiative\nafter a MassDOT Bicycle and Pedestrian Safety Enforcement and Awareness Program follow-up meeting.","LONG TERM RECOMMENDATIONS":"- Consider curb bump-outs at intersections with marked crosswalks to shorten crossing distances and improve pedestrian visibility\n- Add benches, trees, and trash receptacles along sidewalks\n- Add\/improve lighting along Acushnet Ave with new light poles or improved fixtures and bulbs\n- Upgrade pedestrian signals to countdown signals\n- Upgrade crosswalks with pavers, transverse lines, and detectable warning panels","SHORT TERM RECOMMENDATIONS":"- Paint fog lines to delineate the outside edge of travel lanes\n- Enhance crossings with high visibility ladder crosswalks\n- Work with the New Bedford Police Department to locate a speed trailer on Belleville Ave to reduce traffic speeds while capturing speed data\n- Paint diagonal lines at intersections and near crosswalks to discourage parking within 20'\n- Place in-street pedestrian signs in crosswalks to increase awareness of crossing zones\n- Install a bus shelter near the Sawyer St\/Acushnet Ave intersection\n- Study light levels along Acushnet Ave to determine if additional light poles or changes in light fixtures or bulbs would improve conditions\n- Evaluate the walk time at both intersections to ensure that there is adequate time to walk across the street before the pedestrian signals change to solid red","STREETS, INNTERSECTIONS + AREA COVERED":"Acushnet Ave, Sawyer St, Belleville Ave, Bullard St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Brendan Kearney","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1BHM0KnM4JwBDeG-ulgir7FzIULlaaOH0\/view?usp=sharing","CITY":"NEW BEDFORD","NEIGHBORHOOD":null,"TOWN_ID":201.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"NEW BEDFORD","YEAR":2017,"SUMMARY":"The City of New Bedford was awarded a Safe Routes to Parks (SRTP) technical assistance grant from the National Parks and Recreation Association. The goal of the SRTP program is to increase safe access to parks and improve health outcomes in underserved areas. Using Ashley Park in New Bedford’s South End Neighborhood as a pilot park, WalkMass worked with New Bedford City staff to develop a process of assessing the walking routes to the park. Lessons learned from this walk audit and pilot project will inform future park evaluations in New Bedford.","LONG TERM RECOMMENDATIONS":"- Include park entrance redesign, reuse of the softball field, and alternative fencing solutions in the Ashley Park redevelopment scope.\n- Redesign the Bolton Street\/Rivet Street intersection with curb bump-outs or traffic-calming devices to improve pedestrian safety.\n- Install new sidewalks and curbing along Katherine Street near the parking lot and along Bonney Street near the playground, while addressing non-compliant curb ramps.\n- Upgrade streetlights to improve illumination across the neighborhood, as identified in evaluations.\n- Review zoning codes for potential long-term land-use changes and integrate tree planting strategies within future development plans.","SHORT TERM RECOMMENDATIONS":"- Increase visibility of park entrances by trimming vegetation and installing temporary signage, pavement markings, and seasonal plantings to highlight access points.\n- Add missing crosswalks at key crossings and repaint stop lines to improve visibility.\n- Repair crumbling sidewalks around Ashley Park and identify areas with missing or non-compliant curb ramps for immediate attention.\n- Replace bulbs in existing fixtures on the Community Center and add a light fixture to the softball pole to brighten the northeast corner of the park.\n- Enforce parking restrictions and determine feasibility of street tree planting along Bolton Street.","STREETS, INNTERSECTIONS + AREA COVERED":"Ashley Park","THEMES":"Age Friendly , Comfort & Safety, Schools, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Dorothea Hass","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-AshleyParkWalkAudit-NewBedford.pdf?70fb4f&70fb4f","CITY":"NEW BEDFORD","NEIGHBORHOOD":null,"TOWN_ID":201.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"NEWTON","YEAR":2015,"SUMMARY":"WalkBoston working with Toole Design Group (TDG) led a walk assessment in Newton, Massachusetts on Monday, November 24, 2014. The assessment is part of the Massachusetts Department of Transportation’s (MassDOT) Bicycle and Pedestrian Safety Awareness and Enforcement Program, funded by the Federal Highway Safety Improvement Program (HSIP), in association with the Massachusetts Department of Public Health.","LONG TERM RECOMMENDATIONS":"- Replace the existing sidewalks with new, concrete sidewalks\n- Provide trees or shrubbery to provide a visual and sound barrier between pedestrians on the south sidewalk and the Mass Pike\n- Install pedestrian countdown indications and accessible pedestrian pushbuttons at all signalized intersections\n- Locate APS pushbuttons adjacent to the curb ramps and clear of other street furniture wherever possible\n- Reivew the feasibility of a road diet to remove a travel lane, reducing the cross-section to a single travel lane in each direction with a center turning lane\n- Revise crosswalk standards to include parallel lines\n- Install pedestrian scale lighting\n- Install a high-visibility crosswalk across Walker St with enhanced features such as a rapid flashing beacon and curb extensions\n- Coordinate with MBTA to relocate or consolidate bus stops\n- Consider installing a multi-space parking meter on the south side of Washington St to encourage Post Office visitors to cross at the crosswalk","SHORT TERM RECOMMENDATIONS":"- Provide ADA-compliant curb ramps including detectable warning panels at all crosswalks\n- Maintain minimum ADA clearance on all sidewalks through widening or removal of obstacles\n- Conduct a parking utilization study\n- Connect the sidewalk gaps on Walker St\n- Stripe crosswalks across Walker St\n- Upgrade drainage to reduce ponding in curb ramps\n- Install NO TURN ON RED signage for the southbound approach at the Washington\/Walnut intersection\n- Install confirmation light and accessible push buttons at intersections\n- Remove parking to extend the bus stop at the Washington St\/Harvard Ave intersection","STREETS, INNTERSECTIONS + AREA COVERED":"Washington St, Walker St, Lowell Ave, Walnut St, Harvard Ave","THEMES":"Accessibility, Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Bob Sloane","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1Usyd7B7YBDuSLE4MuMb43eAWv2BSZ2PF\/view?usp=sharing","CITY":"NEWTON","NEIGHBORHOOD":null,"TOWN_ID":207.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"NEWTON","YEAR":2018,"SUMMARY":"WalkMass conducted a walk audit on Washington Street in Newton during the City’s Public Design Week to assess pedestrian infrastructure and recommend improvements for safety, accessibility, and comfort. Participants included local residents, city staff, and planning consultants. The audit aimed to generate ideas for shaping the future of the Washington Street corridor.","LONG TERM RECOMMENDATIONS":"- Explore strategies for traffic calming on Washington Street, including potential road diets.\n- Improve walking accessibility and comfort with better sidewalk maintenance, shade trees, benches, and ADA-compliant curb ramps with tactile warning panels.\n- Explore strategies for pedestrian safety at Washington Street and Lowell Street.","SHORT TERM RECOMMENDATIONS":"- Improve crossing safety and bus stop access along Washington Street.\n- Improve safety at side street crossings along Washington Street.","STREETS, INNTERSECTIONS + AREA COVERED":"Washington St.","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1af78zsT6q4llLuHcRbTfPkdsbwx3DH-T\/view?usp=drive_link","CITY":"NEWTON","NEIGHBORHOOD":null,"TOWN_ID":207.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"NORTH ANDOVER","YEAR":2024,"SUMMARY":"Participants gathered in the Waverly Road neighborhood north of Massachusetts Avenue to walk a two-mile loop down streets that had been identified as high-risk for crashes or had a history of crashes with injury outcomes. Residents who joined the walk shared observations and advised potential countermeasures. In addition to the residents, Merrimack Valley Planning Commission Staff, NA Planning Board member and MVPC Commissioner Eitan Goldman, and Merrimack Valley Consultant BETA attended the walk.","LONG TERM RECOMMENDATIONS":"- Improve visibility for pedestrians with RRFPs and high-visibility crosswalks on Waverly\n- Study for Stop sign implementation on Marblehead Street\n- Add curb extensions on SW and SE corners of Waverly Road and Middlesex Street\n- Convert parallel parking to angle parking on Middlesex across from Market\n- Add raised median on Waverly \n- Improve\/repave sidewalks along Waverly","SHORT TERM RECOMMENDATIONS":"- Daylight all crosswalks\n- Repaint double yellow centerline and fog lines to narrow lanes on Marblehead and Middlesex Streets\n- Improve wayfinding for pedestrians to navigate neighborhood\n- Raise Stop signs to 7' from bottom of sign on Waverly and Middlesex Roads","STREETS, INNTERSECTIONS + AREA COVERED":"Middlesex Street and Marblehead Street; Waverly Road and Middlesex Street; Waverly Road segment north of Middlesex Street; Waverly Road and Maple Ave; Waverly and Main Street.","THEMES":"Bike or Bus, Comfort & Safety, Accessibility, Connectivity, Equity, Schools, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Elizabeth Maldari with the Merrimack Valley Planning Commission","VIEW_link":null,"CITY":"NORTH ANDOVER","NEIGHBORHOOD":null,"TOWN_ID":210.0,"TYPE":"T","COUNTY":"ESSEX"},{"CITY\/TOWN":"PLAINFIELD","YEAR":2022,"SUMMARY":"The Hilltown CDC, in partnership with Healthy Hampshire and WalkMass, is leading a 5-year project to promote Age-Friendly Walkability in Hilltown Village Centers, including Plainfield. The project involves conducting walk audits to identify infrastructure improvements and policy changes to make walking safer and more enjoyable for people of all ages. Plainfield faces challenges such as fast-moving traffic, a lack of sidewalks, and unsafe crossing areas, but upcoming projects, including a pedestrian-only zone and traffic calming measures, are set to enhance pedestrian safety and walkability in the town.","LONG TERM RECOMMENDATIONS":"-Tighten the curb radii and provide safe crossingsby reducing width of the intersection by redesigning the street with narrower travel lanes and less asphalt, and RRFB.\n- Install a sidewalk with raised crosswalks to slow traffic and maintain a consistent elevation for pedestrians.\n- Explore options for placemaking and increased pedestrian safety around the new village green project.\n- Evaluate and explore options to improve pedestrian access and safety along and across Route 116 to reach the Congregational Church, Post Office, and parking areas.","SHORT TERM RECOMMENDATIONS":"-Tighten the curb radii and provide safe crossings by painting curb bump outs that narrow travel lanes and crosswalks to promote slower travel speeds and provide people walking with marked crossings.\n- Determine the right-of-way dimensions along this stretch of road to clarify ownership, and post advisory signage for pedestrians and use paint to narrow lanes, encouraging slower driving.\n- Update existing speed feedback signs to provide positive feedback.","STREETS, INNTERSECTIONS + AREA COVERED":"Intersection of Central\/Main St, Main St, Union St, & Intersection of Union\/Main St","THEMES":"Age Friendly , \"Traffic Calming, Speed, Safety \", Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Keili Tucker & Miranda Briseño","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2022\/08\/FINAL-Plainfield-Walk-Audit.pdf?8621dc&8621dc","CITY":"PLAINFIELD","NEIGHBORHOOD":null,"TOWN_ID":237.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"QUINCY","YEAR":2014,"SUMMARY":"WalkBoston conducted this walk assessment as part of the Massachusetts Department of Transportation Bicycle and Pedestrian Safety Program, in partnership with the Massachusetts Department of Public Health. WalkBoston, a pedestrian advocacy organization, aims to make walking safer and more accessible in Massachusetts to promote better health, a cleaner environment, and vibrant communities. The walk assessment's goal is to increase knowledge and awareness of the pedestrian environment at both the state and municipal levels.","LONG TERM RECOMMENDATIONS":"- Redesign parking lot with sidewalk to Beale Street and Wollaston Center.\n- Install new lighting as part of parking lot redesign.\n- Redesign Greenwood\/Woodbine intersection to narrow lanes and prioritize pedestrian crossings.\n- Align T station entrance with Brook Street for better pedestrian space.\n- Move curb and drainage to narrow Newport Avenue lanes, add curb extensions.\n- Improve streetscape with trees, planters, and benches on Newport Avenue.\n- Reconstruct sidewalks on Newport Avenue with curb ramps and detectable warning strips.\n- Extend medians and install pedestrian refuge islands on Newport Avenue.\n- Install pedestrian countdown signals with LPI.\n- Redesign intersection with curb bump-outs to improve pedestrian visibility.\n- Tighten turning radii at Beale Street\/Old Colony Avenue.\n- Install curb bump-outs on Beale Street to improve crossings and sidewalks.\n- Move Hancock Street bus stop for better pedestrian safety.\n- Add shelters and benches at bus stops.","SHORT TERM RECOMMENDATIONS":"- Restripe parking lot, delineate pedestrian zones with temporary barriers.\n- Assess and supplement lighting if needed.\n- Narrow travel lanes and reduce curb radii at Greenwood\/Woodbine intersection using paint\/temporary barriers.\n- Repaint crosswalks to reflect walking patterns.\n- Paint zebra crosswalks at Greenwood\/Woodbine intersection.\n- Narrow road width and discourage drop-offs at T Station entrance with edge lines on Newport Avenue.\n- Clear obstructions from Newport Avenue sidewalks.\n- Reprogram pedestrian signals for adequate crossing time.\n- Repaint crosswalks and stop lines with durable materials.\n- Prioritize snow clearance for sidewalks.\n- Stripe crosswalk across Beale Street and place in-street pedestrian signs.\n- Narrow Beale Street travel lanes with pavement markings.\n- Fix pedestrian countdown signal on Greenwood Ave\/Beale Street corner.\n- Reduce travel lane widths on Beale Street.\n- Consider LPI for traffic signal phasing.\n- Paint bus stop pavement markings and improve signage.","STREETS, INNTERSECTIONS + AREA COVERED":"Woodbine St, Greenwood Ave, Beale St, Newport Ave, & Intersections of Newport Ave and Brook St, Newport Ave and Beale St, Old Colony Ave and Beale St, Greenwood Ave and Beale St, & Hancock St and Beale St","THEMES":"Accessibility, Economic Development , \"Traffic Calming, Speed, Safety \", Bike or Bus, Connectivity, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Wendy Landman","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WollastonWalkAssessment-Quincy.pdf?8621dc&8621dc","CITY":"QUINCY","NEIGHBORHOOD":null,"TOWN_ID":243.0,"TYPE":"C","COUNTY":"NORFOLK"},{"CITY\/TOWN":"REVERE","YEAR":2017,"SUMMARY":"A walk audit was conducted with the Beachmont Improvement Committee on 8\/2\/17. Areas that were looked at by the group were signalization, length of crossings, and traffic patterns. Special attention was given to the signalization at Winthrop Avenue and Bennington Street.","LONG TERM RECOMMENDATIONS":"- Square the turning radii at the corner of the Bennington St\/Winthrop Ave intersection  or place a pedestrian bump out as a traffic calming measure (this will restrict the driver's ability to turn right at an angle\n- Reconstruct pedestrian islands with wider safety areas and place walk activation lights directly adjacent to the pedestrian island","SHORT TERM RECOMMENDATIONS":"- Install pedestrian crossing signage before the crosswalk at Luigi's Pizza\n- Cut the curb at the crosswalk at Luigi's Pizza\n- Restripe the travel lane heading east to outline the two lanes; paint RIGHT TURN ONLY and arrow for traffic turning right onto Bennington St\n- Work with traffic commission to restrict the right turn on red at the Winthrop Ave\/Bennington St intersection\n- Restrict bus parking and active drop off at the train stop\n- Repaint traffic lines to delineate the two lane roadway and travel directions\n- Stripe with yellow paint a no travel lane on the right side of Bennington St to prohibit motorists pulling onto the crosswalk\n- Add \"Don't Block the Box\" markings at Crescent Ave and extend the median island outside the Dunkin Donuts parking lot ","STREETS, INNTERSECTIONS + AREA COVERED":"State Rd, Bennington St, Winthrop Ave","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1SelwSohq-dnnIIDyHCtQ-3rDMnDaGYjf\/view?usp=sharing","CITY":"REVERE","NEIGHBORHOOD":null,"TOWN_ID":248.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"REVERE","YEAR":2019,"SUMMARY":"The Beachmont Improvement Committee (BIC) and City of Revere Staff identified the Endicott Avenue\/Atlantic Avenue intersection as a project in need of pedestrian safety improvements. The City would like to include this intersection as a priority project on their Complete Streets Prioritization Plan.","LONG TERM RECOMMENDATIONS":"- Build curb extensions at the northeast corner of the intersection to shorten the crossing distance and narrow the Atlantic\/Endicott intersection\n- Install code-compliant curb ramps and detectable warning panels on all corners of the Atlantic\/Endicott intersection\n- Extend curbs on both sides of Jones Road to narrow the roadway, improve sightlines, and decrease crossing distances for pedestrians","SHORT TERM RECOMMENDATIONS":"- Enhance crosswalk markings to either continental or ladder designs; paint stop bars\n- Replace stop signs on utility posts with pole-mounted signs; consider adding a stop sign on the eastbound Endicott Ave approach\n- Paint curb extension at the northeast corner of the Atlantic\/Endicott intersection\n- Consider using a stop sign to control traffic on Jones Road approaching Atlantic Ave\n- Install code-compliant curb ramps with detectable warning panels and paint crosswalks across Jones Road and Atlantic Ave to provide marked crossings for pedestrians walking in this area","STREETS, INNTERSECTIONS + AREA COVERED":"Atlantic Ave, Endicott Ave, Jones Road","THEMES":"Accessibility, Connectivity, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1NjDIFzvU7FwMAairWKBmqd_nlRHYszl7\/view?usp=sharing","CITY":"REVERE","NEIGHBORHOOD":null,"TOWN_ID":248.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"REVERE","YEAR":2019,"SUMMARY":"The Beachmont Improvement Committee (BIC) and City of Revere Staff identified Cummings\nSquare as an area in need of improved walking infrastructure given the number of pedestrians\nmoving through the square, its proximity to Beachmont Veterans Memorial School, and the\nfast-moving traffic experienced by neighborhood residents. Walk audit participants were particularly concerned with the lack of crosswalks, pavement markings, and ADA compliancy.","LONG TERM RECOMMENDATIONS":"- Install curb ramps and\/or replace non-compliant curb ramps at any remaining Crescent Ave and Winthrop Ave corners that are not repaired as part of current road repair project. Install detectable warning panels\n- Consider re-routing traffic around Cummings Square in a one-way loop. This strategy could remove some of the confusion drivers now experience when driving in this area. It could also provide opportunities to reclaim some of the pavement with expanded curb bump-outs that would shorten crossing distances for people walking and reduce traffic speeds. It would require the reallocation of some parking spaces\n- Conduct parking utilization study to determine need and desired location of parking around Cummings Square\n- If needed, conduct a study of light levels around Cummings Square to inform a pedestrian scale lighting strategy\n- Install sidewalk within the traffic island at the Crescent Ave\/Orchard St intersection and add crosswalks and functional curb ramps","SHORT TERM RECOMMENDATIONS":"- Paint parking lanes or “Ts and Ls” along Winthrop Avenue to narrow travel lane and\ndelineate parking zones\n- Paint high visibility crosswalks (continental or ladder) across Crescent Avenue at Belle Isle Avenue on the west side of the intersection, and a crosswalk at the stop sign at the intersection of Crescent Avenue and Winthrop Avenue. Vehicular traffic must stop at this location already and are more likely to see pedestrians crossing here than at a mid-block, uncontrolled crossing across Winthrop at the east side of Cummings Square.\n- Repaint all crosswalks in the area with high visibility crosswalks (continental or ladder).\n- Where possible given current street projects, install curb ramps and\/or replace non-\ncompliant curb ramps Crescent Avenue and Winthrop Avenue corners. Install detectable warning panels.\n- Paint stop lines where they are missing and refresh existing stop lines.\n- Use Ts and Ls to delineate parking spaces around Cummings Square. Ensure spaces are marked a sufficient distance away from crosswalks (approx. 20’-25’).\n- Investigate the history of the highway scale safety barrier. Its presence conveys danger.\n- Observe quality of street light levels at night around Cummings Square and at major\ncrossing points.","STREETS, INNTERSECTIONS + AREA COVERED":"Cummings Square, Crescent Ave, Winthrop Ave, Orchard St","THEMES":"Accessibility, Schools, Comfort & Safety, Connectivity, Youth, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Adi Nochur, Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1in07ksa8sXRRULP196pWKdx-oSXT3Svs\/view?usp=sharing","CITY":"REVERE","NEIGHBORHOOD":null,"TOWN_ID":248.0,"TYPE":"C","COUNTY":"SUFFOLK"},{"CITY\/TOWN":"SALEM","YEAR":2014,"SUMMARY":"WalkMass conducted this walk assessment as part of the Massachusetts Department of Transportation Bicycle and Pedestrian Safety Program, in collaboration with the Massachusetts Department of Public Health. As a pedestrian advocacy organization, WalkMass aims to make walking safer and easier in Massachusetts to promote health, environmental sustainability, and community vitality. The assessment focused on building awareness and understanding of the pedestrian environment at both state and local levels.","LONG TERM RECOMMENDATIONS":"- Move curb lines to permanently narrow travel lanes and redesign intersections with tighter curb radii and curb extensions.\n- Rebuild sidewalks with wider walkways, grass buffers, and pedestrian-friendly designs.\n- Install Rectangular Rapid Flashing Beacons (RRFBs), HAWK signals, or push-button pedestrian signals where necessary.\n- Redesign medians to function as pedestrian refuge islands.\n- Improve the \"Kiss and Ride\" zone with curb extensions and a formalized drop-off area.\n- Upgrade crosswalks to stamped or brick-like treatments consistent with the historic district.\n- Reconfigure slip lanes, consider prohibiting Right Turn on Red (RTOR), and improve signage for driver compliance.\n- Evaluate and redesign traffic signal operations and medians for improved pedestrian safety and traffic flow.","SHORT TERM RECOMMENDATIONS":"- Paint edge lines or fog lines to narrow travel lanes on Washington and Bridge Streets.\n- Add crosswalks, repaint existing crosswalks with ladder or continental designs, and improve pavement markings.\n- Install \"Children Crossing,\" \"Yield to Pedestrian,\" and other pedestrian warning signs where needed.\n- Repair or relocate signs, trim vegetation, and address visibility issues at intersections and medians.\n- Remove parking spaces within 20 feet of crosswalks to improve pedestrian visibility.\n- Improve sidewalk conditions, repair curb ramps, and ensure ADA compliance with detectable warning strips.\n- Adjust pedestrian signal timing to ensure adequate crossing time and evaluate concurrent phases where possible.\n- Add lighting under the Bridge Street overpass for pedestrian and driver visibility.\n- Provide wayfinding signage and clarify \"Don't Block the Box\" pavement markings.\n","STREETS, INNTERSECTIONS + AREA COVERED":"Intersections of Washington Street\/Bridge Street, North Street\/Federal Street, Summer Street\/Chestnut Street\/ Norman Street, and Washington Street\/New Derby Street","THEMES":"Age Friendly , Comfort & Safety, \"Traffic Calming, Speed, Safety \", Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Kasia Hart, & Dorothea Hass","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-DowntownWalkAssessment-Salem.pdf?70fb4f&70fb4f","CITY":"SALEM","NEIGHBORHOOD":null,"TOWN_ID":258.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"SALEM","YEAR":2015,"SUMMARY":"On May 6, 2015, WalkBoston participated in a walk audit on the Salem State University (SSU) campus around the O’Keefe Center and the edges of North Campus. John Pelletier, Mass in Motion Coordinator for the City of Salem, led the audit and the participants included SSU staff, neighborhood advocates, city staff and city council members. The goal of the audit was to discuss the safety and quality of the pedestrian environment along the walk route and recommend improvements that would enhance the pedestrian experience.","LONG TERM RECOMMENDATIONS":"- Prioritize the replacement of sidewalks on Atlantic St, Linden St, Broadway, and Loring Ave; install ADA-compliant curb ramps and detectable warning panels at all intersections\n- Work with business owners and residences to reduce driveway widths and curb radii where possible\n- Work with Salem police to discourage parking on sidewalks and within pedestrian pathways along Broadway\n- Hire a traffic engineer to study possible reconfigurations of the Broadway\/Canal St intersection\n- Minimize number and width of curb cuts along Loring Ave and reduce curb radii on driveways where possible\n- Determine if a pedestrian traffic signal is needed at the Rainbow Terrace\/Loring Ave intersection; if needed, replace the antiquated pedestrian traffic signal","SHORT TERM RECOMMENDATIONS":"- Consider installing slow zone signs to reduce traffic speeds at the Loring Ave\/Linden St crossing\n- Evaluate the Atlantic\/Linden\/Day intersection to determine if other approaches, in addition to the eastbound Atlantic approach, need traffic control signs\n- Reduce or reconfigure parking along the streets in the O'Keefe Center to North Campus corridor to improve visibility at intersections\n- Paint crosswalks and add ADA-compliant curb ramps across Charles St and Wisteria at their intersections with Linden Ave\n- Improve the visibility of the crosswalks across Loring St and Linden St at the Linden St intersection; improve pavement markings to a ladder or continental style crosswalk, upgrade the in-street pedestrian sign in the crosswalk, and improve street lighting\n- Prohibit parking within 20' of the crosswalk across Loring to improve visibility\n- Assess the volume of users of the crosswalk near the Raymond Rd\/Loring Ave intersection; if low, remove crosswalk to limit the number of crosswalks along this corridor","STREETS, INNTERSECTIONS + AREA COVERED":"Atlantic St, Loring Ave, Rainbow Terrace, Broadway, Canal St, Linden St","THEMES":"Connectivity, Comfort & Safety, \"Traffic Calming, Speed, Safety \", Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1KUD482idEu2ZNMtzjVBEUkpc58CWAkpk\/view?usp=sharing","CITY":"SALEM","NEIGHBORHOOD":null,"TOWN_ID":258.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"SALEM","YEAR":2018,"SUMMARY":"The audit, supported by Mass in Motion, aimed to promote active transportation and recommend improvements to enhance walkability and safety. Participants included WalkMass, Salem departments, community organizations, and residents. The Point, a diverse neighborhood with many D.R and Caribbean immigrants, is home to the Punto Urban Art Museum. With more visitors and planned development, improving walkability is crucial for health and safety.","LONG TERM RECOMMENDATIONS":"- Improve conditions of sidewalks and curb ramps for accessibility and ADA compliance.\n- Use daylighting and bumpouts\/curb extensions at crosswalks to enhance visibility, reduce crossing distances, and calm traffic.\n- Improve pedestrian access and connectivity to parks and public spaces throughout the neighborhood.","SHORT TERM RECOMMENDATIONS":"- Add and upgrade crosswalks with fresh paint, highly visible ladder designs, and signage.\n- Provide more trash receptacles for neighborhood cleanliness and beautification.","STREETS, INNTERSECTIONS + AREA COVERED":"Lafayette St, Peabody St, Ward St,  Congress St, & Lynch St","THEMES":"Connectivity, Comfort & Safety, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/07\/WalkBoston-The-Point-walk-audit-report-FINAL.pdf?70fb4f&70fb4f","CITY":"SALEM","NEIGHBORHOOD":null,"TOWN_ID":258.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"SALEM","YEAR":2019,"SUMMARY":"A walk audit in North Salem, conducted through the Mass in Motion program, assessed walking conditions along North Street, Buffum Street, Franklin Street, and key neighborhood paths. The area, which saw 11 pedestrian crashes between 2009-2019, including one fatality, highlights safety concerns for those accessing businesses, schools, and the MBTA commuter rail. Residents seek improvements to make their neighborhood safer and more pedestrian-friendly.","LONG TERM RECOMMENDATIONS":"- Implement infrastructure improvements like narrowing approaches at intersections with curb bump-outs or refuge islands, redesigning North Street for safer crossings and slower traffic, developing a sidewalk network along Franklin and Appleton Streets, and enhancing the North Street bridge underpass for better pedestrian access.\n- Enact policy changes and urban design updates to minimize driveway curb cuts, prioritize pedestrian zones, and explore shared-use street concepts for Randall Street.\n- Manage traffic more effectively by studying the impact of closing Randall Street to through traffic, implementing traffic calming measures like speed tables on Buffum Street, and ensuring any one-way conversion includes safety adjustments.\n- Enhance connectivity by planning development of the parking lot at Franklin Street to improve MBTA access and implementing wayfinding signage for the MBTA and other destinations.","SHORT TERM RECOMMENDATIONS":"- Improve crosswalks by moving obstructed signage at Osborne Street, adding enhancements like curb bump-outs and RRFBs, and installing new crosswalks at Randall Street and Appleton Street with visibility improvements.\n- Enhance sidewalks by trimming overgrown vegetation on Randall and Buffum Streets and reducing sidewalk clutter like signage and receptacles.\n- Address immediate safety concerns by evaluating traffic signal timing at key intersections, enforcing parking regulations to improve visibility, improving lighting along paths near the MBTA Commuter Rail Station, and clearing debris and overgrowth from the riverside walking path.","STREETS, INNTERSECTIONS + AREA COVERED":"North St, Mason St, Buffum St,  Randall St, & Intersection of North St and Orne St\/\nSchool St","THEMES":"Connectivity, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF ","FACILITATOR\/AUTHOR":"Stacey Beuttell & LeighAnne Taylor","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2020\/01\/WB-NorthSalemWalkAuditReportFINAL.pdf?70fb4f&70fb4f","CITY":"SALEM","NEIGHBORHOOD":null,"TOWN_ID":258.0,"TYPE":"C","COUNTY":"ESSEX"},{"CITY\/TOWN":"SOMERVILLE","YEAR":2014,"SUMMARY":"WalkMass conducted this assessment as part of the Massachusetts Department of Transportation Bicycle and Pedestrian Safety Program, in partnership with the Massachusetts Department of Public Health. WalkMass, a pedestrian advocacy organization, aims to make walking safer and easier to promote better health, cleaner environments, and vibrant communities. The assessment's purpose was to build knowledge and awareness of pedestrian conditions at both state and local levels.","LONG TERM RECOMMENDATIONS":"- Conduct a comprehensive study of pedestrian traffic patterns around the school\n- Install zebra or ladder crosswalk markings to raise awareness and improve pedestrian safety\n- Implement traffic calming strategies on Medford Street\n- Evaluate bus stop locations and move to far side if appropriate\n- Evaluate and upgrade all curb ramps for ADA compliance\n- Consider installing pedestrian refuge islands and redesign intersections for safer crossings\n- Conduct an ongoing review of school zone signage and pavement markings","SHORT TERM RECOMMENDATIONS":"- Repair curb ramps and install detectable warning strips for ADA compliance\n- Repaint faded crosswalks and evaluate crosswalk locations for improvement\n- Install accessible curb ramps at all corners\n- Relocate bus stop if possible to improve right-of-way\n- Install pedestrian countdown signals\n- Install curb bump-outs on Pearl and Walnut Street to slow traffic and improve visibility\n- Evaluate signal phasing for concurrent phase or Leading Pedestrian Interval (LPI)\n- Repaint pavement markings (crosswalks, centerlines, stop lines\n","STREETS, INNTERSECTIONS + AREA COVERED":"Pearl St","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Bike or Bus, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Kasia Hart, &\nBrendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-PearlStreetWalkAssessment-Somerville.pdf?70fb4f&70fb4","CITY":"SOMERVILLE","NEIGHBORHOOD":null,"TOWN_ID":274.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2013,"SUMMARY":"On March 26, 2013, WalkBoston conducted a walk audit at the German Gerena Community School, an elementary school in Springfield, MA. The audit focused on three major areas: Birnie Avenue, crossing Main Street to the tunnel entrance on the east side of the school, and crossing Plainfield Street to the tunnel entrance on the west side of the school.","LONG TERM RECOMMENDATIONS":"- Install speed tables and perhaps a sandwich board near the Huntington\/Birnie and Arch\/Birnie Ave crossings\n- Either eliminate turn lanes and\/or put in medians to protect walkers across Plainfield; the street is unnecessarily wide at the intersection near the school with additional width for turning lanes","SHORT TERM RECOMMENDATIONS":"- Paint a stripe on the roadway a couple of feet in front of the Birnie curb in the western travel lane to reduce its width\n- Paint SCHOOL ZONE in large letters on the pavement near walking access points to school\n- Create curb extensions on either side of the crosswalk at the Main St crossing so cars cannot part next to the crosswalk and students can be more visible to cars\n- Paint ladder crosswalks across Plainfield St\n- Provide an additional crosswalk and traffic signal on the north side of the drivveway to Chestnut School","STREETS, INNTERSECTIONS + AREA COVERED":"Birnie Ave, Huntington St, Arch St, Main St, Plainfield St","THEMES":"Schools, Accessibility, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/19CMDNrSrqfoI-fQ48QcmLv3Emn8s-dZ3\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2013,"SUMMARY":"The walk audit was conducted near the Elias Brookings School in Springfield at the request of the Mass in Motion coordinator. The area has challenging walking conditions, with narrow sidewalks, free right-turn lanes, and limited pedestrian safety features. Recommendations include addressing pedestrian issues in upcoming infrastructure projects and improving sidewalks and intersections near the school.","LONG TERM RECOMMENDATIONS":"- Reduce traffic speed along the walking route, particularly on Walnut Street.\n- Redesign intersections to ensure safe crossing points, limit vehicular lanes, and eliminate free-right turning lanes.\n- Incorporate roadside verges during streetscape updates to provide space for snow storage and increase separation between pedestrians and vehicles.","SHORT TERM RECOMMENDATIONS":"- Add ladder-style crosswalks to increase pedestrian visibility and driver awareness.\n- Paint solid white lines (fog lines) parallel to the curb on Walnut and Hancock Streets to narrow perceived lane width and slow traffic.\n- Use traffic calming measures like bulb-outs, traffic tables, or flashing pedestrian crossing signs at major Walnut Street crossings to slow cars and enhance pedestrian safety.\n","STREETS, INNTERSECTIONS + AREA COVERED":"Marshall St, Eastern Ave, Hickory St, Hancock St, Walnut St, Intersection of Hickory\/\nWalnut\/Allen Street, Intersection of Hickory\/Hancock\/Central St, Intersection of Hancock\/Walnut\/\nAshley\/Alden, Intersection of Melrose St\/Eastern Avenue","THEMES":"Schools, Youth, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass & Stacey Beuttell ","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-EliasBrookingsElementarySchoolWalkAudit-Springfield.pdf","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2013,"SUMMARY":"WalkBoston conducted a walk audit on September 10, 2013, at the request of the Boland Elementary School Principal Lisa Bakowsi and Springfield Mass in Motion Coordinator, Nicole Bourdon. Several teachers and parents were interested in initiating a Walking School Bus for students along Stafford Road. The school walk audit was seen as a complimentary exercise to evaluate and suggest recommendations for the proposed route and for improvements on other roadways and intersections around the school. The Walking School Bus was successfully launched on International Walk to School Day, on October 9, 2013.","LONG TERM RECOMMENDATIONS":"- Redesign Carew\/Prospect intersection with tightened  curb radii, a more generous traffic island, and marked street crossings\n- Prioritize the Carew\/Prospect intersection for an engineering study to improve pedestrian safety\n- Install a raised crosswalk when the school drive road is resurfaced\n- Consider reconfiguring car spacing in the parking area behind the school when the parking lots are resurfaced to provide safer pedestrian corridors on medians or along fence lines ","SHORT TERM RECOMMENDATIONS":"- Increase the number of crosswalks across Stafford St and Nursery St and implement them with a ladder design and pedestrian crossing signs; additional crosswalks should be painted at the entry and exit drives to Mercy Medical Center and across Leslie, Wolcott, and Goodrich St\n- Install additional signs (i.e. pedestrian crossing, speed limit, school zone) on Stafford St and Armory St\n- Stripe Carew St with bike lanes\n- Paint fog lines along the edges of Armory St to help reduce traffic speeds and discourage pull offs and temporary parking\n- Replace the pedestrian crossing signal at the Armory\/Carew intersection with countdown signals\n- Paint a crosswalk in the school parking lot along the pedestrian route leading form the school to the fields\n- Paint lines to indicate a driving lane at a recommended width of 10-10.5' to narrow the driver's perception of the road width and help reduce speeds at the one-way vehicular loop beginning and ending at the Stafford St entrance; implement temporary measures to pinch the road width a tthe crosswalk on the exit drive such as tirees, orange barrels with pedestrian crossing signs, or other means to further slow speeds\n- Delineate pedestrian crossing points in the parking lots behind the schools with improvements like pavement markings and pedestrian crossing signage","STREETS, INNTERSECTIONS + AREA COVERED":"Armory St, Carew St, Stafford St, Liberty St, Cleveland St, Prospect St","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus, Youth, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1qowLb7r6H6x_Oe3C08Ps8QnLM9eGn-gX\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2014,"SUMMARY":"WalkBoston conducted a walk audit on February 10, 2014 in the Pine Point neighborhood of Springfield, MA in reponse to safety concerns regarding Hiram L. Dorman Elementary School students crossing unprotected streets to reach school.","LONG TERM RECOMMENDATIONS":"- Install curb ramps and detectable warning strips at all marked crossings\n- Study feasibility of adding bike lane or sharrow markings on Berkshire\n- Explore the possibility of installing speed tables at the intersections of Marsden and Berkshire and\/or Jasper and Berkshire\n- Install sidewalks and curbs along the one side of Hood St\n- Install sidewalks on the east (school side) of Nathaniel St\n- Install continuous sidewalks on the west side of Fisher St from Hood St to Pelham St\n- Meet with city officials (Department of Public Works, Parks Department, Planning Department, Police Department, School Department, Health Department) to discuss infrastructure needs and advocate for funding to be set aside to address pedestrian safety issues around Dorman School\n- Investigate the road resurfacing and reconstruction projects planned for the Dorman School area and ensure that pedestrian infrastructre is part of the new designs\n- Address the high impact, low cost solutions first (e.g. painting crosswalks and lane lines)","SHORT TERM RECOMMENDATIONS":"- Paint fog lines on Bay St and Berkshire Ave to define lines and narrow perception of lane width\n- Upgrade all marked crossings from the standard crosswalk design to a ladder crosswalk design\n- Install pedestrian WALK signals to the existing traffic signal heads on both Bay St and Berkshire Ave; study the implications of a protected and push-button-operated pedestrian-only phase on traffic flow and pedestrian safety\n- Install pedestrian crossing signs along Bay St and Berkshire Ave to better highlight crossings\n- Study the feasibility of installing a pedestrian hybrid beacon at the Bay\/Haskin intersection","STREETS, INNTERSECTIONS + AREA COVERED":"Berkshire Ave, Bay St, Fisher St, Nathaniel St, Eastland St,  Haskin St","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass, Stacey Beuttell, Sam Sklar","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1Vns6tkHhT0tbRdZJrXFW8GAO1DJcLhPi\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2014,"SUMMARY":"WalkBoston conducted a walk audit along a proposed walking school bus route along Union St on July 21, 2014 to see if the proposed route would act as a tool to combat low attendance and frequent absences at the Milton Bradley Elementary School. ","LONG TERM RECOMMENDATIONS":"- Enforce ordinances which require vegetation to be trimmed along sidewalks.\n- Discuss cleaning up vacant lot on Union St with property owner.\n- Consider building a sidewalk to the north of the school's Union St parking lot to provide safe access directly into the school building.\n- Bring curb ramps to ADA compliance and install detectable warning strips.\n- Investigate the possibility of moving the street lamp from the ceneter of the sidewalk on the eastern corner of the Union St\/School St intersection.\n- Study the timing of pedestrian traffic signals at Union\/School and Union\/Maple; investigate the possibility of offering a WALK signal on a concurrent basis to discourage people from walking against the traffic signal (i.e. when there is a DON'T WALK sign and a gap in traffic).\n- Consider installing flashing SCHOOL ZONE beacons on Maple St.","SHORT TERM RECOMMENDATIONS":"- Review parking rules on Union St and potentially limit parking to one side of the street between School St and Mulberry St.\n- Increase enforcement of illegal parking on the sidewalks.\n- Paint crosswalks across Mulberry St, Ridgewood Terrace, and Ridgewood Place.\n- Repaint the crosswalks with a ladder design at the intersection of School St and Union St.\n- Monitor traffic speeds along Maple St to validate the need for traffic calming near Milton Bradley.\n- Consider installing rumble strips near the curve to alert drivers to the presence of the school zone and traffic signal.\n- Post school zone signs in accordance with the school zone standards outlined in the Manual of Uniform Traffic Control Devices (MUTCD).\n- Repaint crosswalks at the Maple St\/Union St intersection using a ladder or zebra design.\n- Replace existing pedestrian signals with countdown signals as funding allows.\n- Paint SCHOOL on Maple St and Union St.","STREETS, INNTERSECTIONS + AREA COVERED":"Union St, School St, Maple St, Mulberry St","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \", Youth, Schools","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Kasia Hart","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1zaIE6QM7dJjh8et5juD7CNyisoL0wRZI\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2015,"SUMMARY":"On November 9, 2015, WalkBoston conducted a walk assessment of Chestnut and Dwight Streets\nin the vicinity of the Lincoln Elementary School in Springfield, in partnership with school and municipal\nstaff and representatives from the Parent Teacher Organization, State Police, Baystate Medical Center\nand Pioneer Valley Planning Commission.","LONG TERM RECOMMENDATIONS":"- Add in-pavement \"SCHOOL\" markings and flashing beacons indicating 20 mph speed limit in school vicinity at the corner of Chestnut St and Harriet St.\n- Study feasibility of adding bike facilities on Chestnut St, consistent with \"Very High\" Level of Bicycle Compatability designated in Springfield's Complete Streets plan.","SHORT TERM RECOMMENDATIONS":"- Paint fog lines on Chestnut St to narrow the width of the travel lanes to 11' as per Massachusetts Highway Department design guidelines.\n- Upgrade crosswalks across Chestnut St at Harriet and Cumberland St from standard to ladder design; add in-street pedestrian crossing sign at Harriet St crosswlak and consider raising both crosswalks to enhance pedestrian visibility and slow traffic.\n- Add more prominent signage on Chestnut St between Harriet and Cumberland St to further highlight presence of school and pedestrians.\n- Add new crosswalks with curb ramps and sidewalk extensions, detectable warning strips, ladder design, and in-street pedestrian crossing signs across Chestnut St at Waverly, Alexander, and Calhoun St.\n- Narrow turning radii for traffic turning from Chestnut St onto Jefferson Ave using paint and plastic flexposts.\n- Add stop signs with reflective poles on Chestnut St to create a four-way stop at the intersection of Chestnut St with Jefferson Ave and Montmorenci St.\n- Upgrade Dwight St intersections at Bancroft and Alexander St by adding new crosswalks with ladder design, curb ramps, detectable warning strips, stop signs, and stop lines.\n- Narrow turning radii to slow traffic at the intersection of Dwight St and Jefferson Ave using paint and flexposts.\n- Install pedestrian signals at the intersection of Dwight Street and Jefferson Avenue, with push-button activation and leading pedestrian intervals.\n- Add new crosswalks with ladder design across Osgood and Brookline Streets at intersections with Dwight Street.","STREETS, INNTERSECTIONS + AREA COVERED":"Cumberland St, Chestnut St, Allendale St, Dwight St, Harriet St, Waverly St, Alexander St, Calhoun St, Jefferson Ave, Barcroft St, Brookline Ave","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Betsy Johnson, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1K_l8S-qUbbfiV3lYY5bl-xmZo1YnL_Ac\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2015,"SUMMARY":"The Brightwood community faces significant challenges with pedestrian safety and access, as 34% of residents lack cars and rely on walking or limited PVTA bus service to reach essential destinations. On November 18, 2015, WalkMass conducted a walk assessment in Brightwood with Springfield municipal staff, MassDOT engineers, and community advocates to evaluate current conditions. The assessment aimed to identify improvements for safer and more accessible pedestrian connections within and beyond the neighborhood.","LONG TERM RECOMMENDATIONS":"- Construct new, safe pedestrian pathways to connect Brightwood residents to destinations outside the neighborhood, including bus stops and essential services.\n- Develop urban pathways across barriers like railroad tracks to improve accessibility.\n- Reengineer major streets, such as Plainfield and Birnie Avenue, to include wider sidewalks, grass buffers, and traffic-calming features for enhanced pedestrian safety.\n- Collaborate with PVTA to enhance bus service frequency and reliability for Brightwood residents.","SHORT TERM RECOMMENDATIONS":"- Improve pedestrian connections to local bus stops with clear signage and pathways.\n- Repair existing sidewalks to address immediate safety concerns and poor walking conditions within the neighborhood.\n- Install crosswalks and basic pedestrian safety measures on key routes to West and Main Streets.\n- Add “Pedestrian Crossing” signage in high-traffic areas to alert motorists.","STREETS, INNTERSECTIONS + AREA COVERED":"Plainfield St, Birnie Ave, &  West St","THEMES":"Bike or Bus, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Adi Nochur","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-BrightwoodNeighborhoodWalkAssessment-Springfield.pdf?70fb4f&70fb4f","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2015,"SUMMARY":"WalkBoston conducted a walk assessment in the Metro Center neighborhood of Springfield to identify ways to improve the walking connections between downtown businesses on Main Street and the historic neighborhoods and cultural institutions located around the Quadrangle.","LONG TERM RECOMMENDATIONS":"- Develop a pedestrian scale wayfinding system linking the neighborhoods, museums, and downtown districts\n- Revitalize downtown parks and open space, both physically and programmatically, to serve as pedestrian gathering spaces; Pynchon Plaza in particular is a critical link between the museums and downtown\n- Continue to study and promote the idea of converting Dwight St and Chestnut St to two-way traffic; their conversion would contribute to traffic calming efforts and promote downtown economic revitalization","SHORT TERM RECOMMENDATIONS":"- Consider pedestrian safety improvments on Dwight St and Chestnut St such as painting fog lines, adding curb bump-outs at intersections, and repainting crosswalks with the same red and white color scheme as the downtown district\n- Focus on pedestrian infrastructure improvements in the area bounded by Dwight St and Chestnut St to promote connectivity","STREETS, INNTERSECTIONS + AREA COVERED":"Dwight St, Chestnut St, Main St, State St, Falcons Way, Bridge St, Matoon St, Edwards St","THEMES":"Connectivity, Comfort & Safety, \"Traffic Calming, Speed, Safety \", Economic Development","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1NUSYksDOzNLkxjBnFok6r9WMnf0LxUxp\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2016,"SUMMARY":"Springfield’s South End neighborhood residents, business owners and other stakeholders have been\nworking to improve safety and to increase investment in the South End for many years. WalkBoston conducted a walk audit on November 16, 2016 to help guide efforts toward neighborhood revitalization and Counter Criminal Continuum (C3) policing strategies.","LONG TERM RECOMMENDATIONS":"- Consider hiring a lighting consultant to study current lighting conditions along Main Street and propose strategies to improve lighting with a goal of crime prevention and pedestrian safety\n- Reconsider adding curb extensions to shorten crossing distances\n- Install a Rectangular Rapid Flashing Beacon (RRFB) at the mid-block crosswalk near the Acushnet Ave\/Main St intersection\n- Consider amending zoning codes and\/or site plan design review guidelines to limit the number of driveways and modify parking ratios for businesses along the Main St corridor\n- Apply for facade improvement grants or other programs that provide small business owners with funding to reinvest in their property\n- Complete the sidewalk on the east side of Main St\n- Raise the crosswalk across Locust St to calm traffic and enhance pedestrian visibility\n- Study traffic volumes on Main St and mill St to determine if the intersection can be reduced in size, including the removal of the right-turn slip lanes\n- Reconstruct the Mill\/Locust intersection to include a round-about complete with bicycle and pedestrian facilities","SHORT TERM RECOMMENDATIONS":"- Use reflective paint on roadways to increase visibility of pavement markings in low light conditions\n- Survey the location of light poles and crosswalks; determine if light fixtures can be adjusted\n- Discuss lighting strategies and\/or incentives for businesses and building owners to keep their lights on at night\n- Post advance crosswalk signage\n- Consider areas that may need more crosswalks\n- Daylight intersections and corners to improve visibility by painting no parking areas within 20' of crosswalks\n- Develop concept plan for neighborhood park on vacant land at Main and Adams St\n- Work with the city of Springfield to determine responsibility for maintaining streetscape\n- Paint fog lines to narrow vehicular travel lanes and calm traffic\n- Add high visibility, ladder crosswalks, and ADA compliant curb ramps with detectable warning strips across intersections","STREETS, INNTERSECTIONS + AREA COVERED":"Main St, Locust St, Mill St","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1Z0mqx29sB_4AHXoDeGG-CQcjqAIdCLFf\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2017,"SUMMARY":"On September 26, 2017, WalkBoston conducted a walk assessment in the Liberty Heights neighborhood of Springfield, with support from the Massachusetts Executive Office of Public Safety and Security (EOPSS) Pedestrian Safety Planning Initiative for High-Fatality Communities. The goal of the walk assessment was to recommend improvements to the local built environment that improve pedestrian safety.\t","LONG TERM RECOMMENDATIONS":"- Upgrade pedestrian signals to include countdown clocks and accessibility accommodations\n- Consider moving crosswalks back from intersections to shorten crossing distances; requires construction of new curb ramps, repainting crosswalks, stop lines, and right-turn lane arrows\n- Install curb bump-outs to shorten crossing distance and prevent cars from parking too close to the crosswalk\n- Install Rectangular Rapid Flashing Beacons (RRFBs) at mid-block on Carew St","SHORT TERM RECOMMENDATIONS":"- Adjust signal phasing, possibly by shortening signal cycle to 90 seconds, to prioritize the pedestrian phase to limit wait times for pedestrians; concurrent signals are not recommended in areas of high volumes of fast-moving traffic like on Liberty and Carew St\n- Repaint crosswalks with new City standard continental design with next scheduled maintenance\n- Install advance crossing signage and curbside crosswalk signage with arrows at crosswalk locations\n- Consider placement of in-street pedestrian crossing signs in crosswalks\n- Install no parking signs\n- Paint diagonal lines or install flex posts within 25' of crosswalks to discourage parking \n- Install curb ramps at missing locations\n- Trim vegetation along Carew St","STREETS, INNTERSECTIONS + AREA COVERED":"Carew St, Liberty St","THEMES":"Accessibility, Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1aiC5heBNWlEtk1xlOTvgAIT9hhHx_zuR\/view?usp=drive_link","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2017,"SUMMARY":"WalkBoston conducted a walk assessment in the Old Hill neighborhood at the request of Way Finders staff\n(formerly HAP Housing) and Springfield’s Department of Health and Human Services (HHS). WalkBoston\nis assisting HHS in its implementation of walkability principles throughout Springfield under a CDC grant\nknown as 1422. The assessment aimed to identify deficient or missing pedestrian infrastructure and make recommendations for improvements while also engaging the community and city staff around issues of a safe walking environment.","LONG TERM RECOMMENDATIONS":"- Install new crosswalks and ADA-compliant curb ramps at intersections identified in neighborhood-wide crosswalk study; upgrade all crossings to include ADA-compliant curb ramps.\n- Install accessible pedestrian signals with countdown clocks at each of the signalized intersections along the walking route.\n- Consider raised crossings across local streets where they intersect with urban collectors such as Hancock St, Eastern Ave, King St, Alden St, and Union St; drainage patterns need to be evaluated to determine feasibility.\n- Work with city staff members to understand sidewalk improvement priorities and schedules for road redesign and maintenance.\n- Work with Eversource and city staff and request a lighting study of Old Hill neighborhood to improve light levels at night; the study may yield a recommendation for better light in different locations rather than more lights; the lighting designer's focus should be on the pedestrian experience.\n- Monitor clean-up activities and see if positive social pressures to maintain homes, yards, and sidewalks increases.\n- Identify locations for new street trees to make urban connectors such as Hancock St and Eastern Ave feel safer and more comfortable for walkers.","SHORT TERM RECOMMENDATIONS":"- Repaint existing crosswalks with enhanced pavement markings such as a continental crosswalk design (Springfield has established continental design as the city crosswalk standard).\n- Establish at least one more marked crossing on Hancock St and Eastern Ave.\n-Identify locations for new crosswalks neighborhood-wide based on pedestrian use patterns, crash data, and vulnerable populations.\n- Install new sidewalks along Orleans St between Union St and Pendleton Ave.\n- Complete sidewalk on the west side of Eastern Ave between Greene St and Alden St.\n- Shorten the long curb cuts and delineate vehicular entrances to service station along the eastern side of Hancock St and the northern side of Alden St at the Hancock\/Alden St intersection.\n- Organize a campaign to repair the lights in Barrows Park (contact Eversource).\n- Consider a community-based porch light strategy such as regularly leaving porch lights on at night to improve neighborhood light levels.\n- Work with the city to better understand maintenance services, street sweeping schedule, and trash receptacle options.\n- Maintain existing trees; work with the City Forestry Division to determine maintenance responsibilities and consider a neighborhood Adopt a Tree program if city ordinances allow it.\n- Determine if ReGreen Springfield can help fund and plant street trees in Old Hill.\n- Identify sidewalks damaged by tree roots, such as on the north side of Alden St near the Alden\/Hancock St intersection; use repair strategies that preserve the tree where possible.","STREETS, INNTERSECTIONS + AREA COVERED":"Union St, Eastern Ave, Alden St, Hancock St, Pendleton Ave, Tyler St, Orleans St","THEMES":"Accessibility, Comfort & Safety, Connectivity, Policy","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Dorothea Hass","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1xyHhZ1ZYWJyPAT1xfd74qDGXA-Y58Lkr\/view?usp=sharing","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2020,"SUMMARY":"The Springfield Union Station Virtual Walk Audit, a pilot for a statewide project led by WalkMass and MassINC with support from the Solomon Foundation, explores connections between social infrastructure and neighborhood resiliency in five Massachusetts Gateway Cities. It aims to promote safer, more enjoyable streets locally and influence state policy for increased investment in these communities. The pilot was conducted through the Massachusetts Department of Public Health’s Mass in Motion Program, which supports community-led healthy living initiatives.","LONG TERM RECOMMENDATIONS":"- Repurpose underutilized surface parking lots to active uses that are desired by the community (active parks, play equipment, performance space, outdoor street vending).\n- Activate open space: Consider strategies for converting some existing passive park space into active-use open spaces. \n- As a part of the tree inventory: In the long term, consider larger, co-befitting projects near the street (e.g. bioswales) or off-street on public property.","SHORT TERM RECOMMENDATIONS":"- Add wayfinding signage: supplement existing downtown maps with large print wayfinding signage for easy navigation between key Metro Center destinations.\n- Remove and manage litter.       \n- Inventory surface parking lots and assess feasibility of repurposing underutilized lots.\n- Review street tree inventory and fill tree pits.\n- Assess bike share locations.\n- Plan for cultural programming consider partnering with Springfield Culture Partnership to plan events with resident input.","STREETS, INNTERSECTIONS + AREA COVERED":"Section 1: \nDwight St, Bridge St, & Main St\n\nSection 2: \nTaylor St, Chesnut St, & Liberty St","THEMES":"Connectivity, Bike or Bus, \"Traffic Calming, Speed, Safety \", Economic Development","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/Springfield-Union-Station-Walk-Audit_-Recommendations-Memo.pdf?8621dc&8621dc&70fb4f&70fb4f","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2021,"SUMMARY":"WalkMass and Way Finders conducted a walk assessment with\nSpringfield community members as part of the Mass in Motion grant program in the\nUpper Hill neighborhood. The goal of the walk audit was to identify areas of\nimprovement in the built environment, with special focus on ADA compliance issues.\nResidents voiced concerns about making Upper Hill a safer, more welcoming\nneighborhood for all people, especially for the elderly, children, and people with\nmobility issues.","LONG TERM RECOMMENDATIONS":"- Upgrade Wilbraham\/Suffolk signals with countdown pedestrian signals.\n- Install bus shelters and enhance park amenities (playground, basketball court, seating).\n- Redesign the Roosevelt Ave intersection for safer crossings and remove the right-turn slip lane.\n- Add curb extensions and plant more shade trees.\n- Implement a lighting strategy for better nighttime pedestrian safety.","SHORT TERM RECOMMENDATIONS":"- Narrow travel lanes on Wilbraham Road with painted parking zones to slow traffic.\n- Install a mid-block crosswalk with an RRFB at Norfolk Street for park access.\n- Add benches and resting areas; repair damaged sidewalks.\n- Post speed limit signs (30mph, 20mph in school zones).\n- Remove park bollards and tree stumps; repair park sidewalks.\n- Replace pedestrian signage, add advanced stop bars, and repaint crosswalks at Roosevelt Ave.\n- Trim vegetation, restrict parking near intersections, and repair sidewalks.\n- Plan tree planting and assess nighttime lighting conditions.","STREETS, INNTERSECTIONS + AREA COVERED":"Suffolk St, Wilbraham Rd, Carlisle St, Marlborough St, & Intersection of Wilbraham Rd\/Roosevelt Ave","THEMES":"Comfort & Safety, \"Traffic Calming, Speed, Safety \", Age Friendly","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Perri Sheinbaum","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2021\/08\/WalkBoston-Upper-Hill-Springfield-Walk-Audit.pdf?70fb4f&70fb4f","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"SPRINGFIELD","YEAR":2023,"SUMMARY":"The Springfield Roosevelt Ave. Walk Audit, led by WalkMassachusetts in collaboration with WalkBike Springfield, Way Finders, Mass in Motion Springfield, and local residents, assessed pedestrian safety and walkability along a key arterial corridor serving several neighborhoods and schools in Springfield. This project aimed to identify infrastructure needs and advance strategies for safer, more welcoming streets, supporting both immediate local improvements and long-term investment in active transportation. The audit was conducted as part of the Massachusetts Mass in Motion Program, highlighting the importance of community-led healthy living initiatives and advocating for systemic changes to benefit the city’s neighborhoods and schools.","LONG TERM RECOMMENDATIONS":"- Redesign Roosevelt Ave. & Wilbraham Rd. intersection with safe crossings, accessible pedestrian signals, tighter corners, curb extensions, and remove right-turn slip lane.\n- Remove Byron St. slip lane entirely.\n- Establish School Zone on Gaucher St. and Roosevelt Ave. for high school, following MassDOT updates.\n- Add secure bicycle racks on both sides of school grounds.\n- Extend sidewalk on even side of Gaucher St. to intersection at Roosevelt Ave.\n- Add signage at 50 Gaucher St. for crossing at 73 Gaucher St. & Roosevelt Ave.\n- Extend sidewalk on Roosevelt Ave. to complete network and improve access to PVTA bus stops.\n- Expand sidewalk to 12–14 ft shared-use path where space allows.\n- Implement road diets and traffic calming on Roosevelt Ave.—consider reducing to one lane each direction.\n- Redesign Roosevelt Ave. & Gaucher St. intersection (signal or roundabout) to improve school access and safety.\n- Extend sidewalk from Wilbraham Rd. & Roosevelt Ave. intersection to high school entrance on Gaucher St.\n- Install bus shelters at PVTA stops for riders with mobility needs.","SHORT TERM RECOMMENDATIONS":"- Update pedestrian signage at key crossings (Roosevelt Ave\/Wilbraham Rd, Byron St\/Wilbraham Rd)\n- Add advanced stop bars 8 ft from crosswalks at intersections\n- Install high-visibility (continental) crosswalks\n- Realign and repair curb ramps and detectable warning panels\n- Investigate narrowing Byron St slip lane to Wilbraham Rd\n- Paint crosswalk and install ADA curb ramps at school driveway (Gaucher St)\n- Add secure bike racks on both sides of school\n- Clarify lane markings on Roosevelt Ave near State St and Wilbraham Rd\n- Add speed limit signs along Roosevelt Ave\n- Trim sidewalk vegetation and keep clear of debris\n- Install radar speed detection signs on Roosevelt Ave\n- Add continental crosswalk near PVTA bus stop (before Byron St slip lane)\n- Add route timetables and information to both directions at bus stops\n- Add benches and covered shelters at PVTA stops\n- Extend sidewalk from Wilbraham Rd\/Roosevelt Ave to northbound PVTA bus stop","STREETS, INNTERSECTIONS + AREA COVERED":"Roosevelt Avenue, Gaucher Street, Wilbraham Road","THEMES":"Climate - Heat , Climate - Shade\/ Tree, Accessibility, Transit, Comfort & Safety, Schools","VIEW":"Springfield Roosevelt Ave. Walk Audit - July 20, 2023","FACILITATOR\/AUTHOR":"Brendan Kearney, Iolando Spinola, Jonathan Gomez-Pereira\n","VIEW_link":"https:\/\/docs.google.com\/document\/d\/1v9qn9L3va0CP38iG2gwzwwlXLMiLMdLc0qaeFgB9qhQ\/edit?tab=t.0","CITY":"SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":281.0,"TYPE":"C","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"TAUNTON","YEAR":2015,"SUMMARY":"Taunton, a proud city of 56,000 residents and the county seat of Bristol County, has made significant improvements to streets and sidewalks around the historic Taunton Green. The area is vibrant, with restaurants and stores contributing to the community atmosphere. In 2008, the historic Bristol County Courthouse complex underwent an $86 million renovation. While Taunton is car-oriented, the city is promoting walking for healthier lifestyles. The walk audit focused on the area around Morton Hospital, St. Mary’s School, and the intersection of Broadway and Washington Streets, about a quarter mile north of the Taunton Green.","LONG TERM RECOMMENDATIONS":"- Make the intersection a four-way stop for safety.\n- Repaint crosswalks and add signage for pedestrian visibility.\n- Add a bump-out on Washington Street to reduce curb radius and speed.\n- Add fog lines on N. Pleasant Street to narrow the road and slow traffic.\n- Use signs, cones, and tape to delineate pedestrian space during hospital construction.\n- Add more signage to alert drivers of pedestrians.\n- Narrow the curb radius on the southeast corner with a curb extension.\n- Enforce city ordinance for trimming vegetation over sidewalks.\n- Add crosswalks at Adams and Church streets.\n- Fix uneven sidewalks and add blacktop around standpipe covers.\n- Paint ladder design crosswalk at St. Mary’s School.\n- Include pedestrian safety measures in Broadway construction.\n- Add a signalized crossing at Randall and Broadway.\n- Add a curb extension at Randall and Broadway for pedestrian safety.\n- Repaint the hospital entrance crosswalk.\n- Paint fog lines to reduce street width and speed.","SHORT TERM RECOMMENDATIONS":"- Use temporary signs and cones for pedestrian safety during construction.\n- Add crosswalks and signage at Adams and Church streets.\n- Repair cracked sidewalks for better walkability.\n- Paint temporary crosswalks for visibility.\n- Trim vegetation over sidewalks.\n- Implement temporary curb extensions at key intersections.","STREETS, INNTERSECTIONS + AREA COVERED":"Adams St, Broadway, Pleasant St,  & Washington St","THEMES":"\"Traffic Calming, Speed, Safety \", Schools, Public Health","VIEW":"PDF","FACILITATOR\/AUTHOR":"Kasia Hart & Dorothea Hass","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAssessement-Taunton.pdf?8621dc&8621dc","CITY":"TAUNTON","NEIGHBORHOOD":null,"TOWN_ID":293.0,"TYPE":"C","COUNTY":"BRISTOL"},{"CITY\/TOWN":"WAKEFIELD","YEAR":2012,"SUMMARY":"WalkMass conducted a walkability assessment near Galvin Middle School in Wakefield, Massachusetts, focusing on pedestrian safety issues and student routes to and from the school, downtown Wakefield, and popular pick-up\/drop-off spots. The group conducted an on-the-street audit after discussing key safety concerns and how the assessment would be carried out. The goal was to evaluate pedestrian facilities and identify areas for improvement in walkability and safety.","LONG TERM RECOMMENDATIONS":"- Rebuild a wider sidewalk between Dacey Field and the campus, with a grass buffer to separate the walk zone from the roadway.\n- Re-engineer the intersection with narrower turning radii to improve pedestrian safety.\n- Install electronic radar speed limit signs to calm traffic.\n- Add a grass buffer and plant trees to help lower vehicle speeds.","SHORT TERM RECOMMENDATIONS":"- Reduce the effective width of travel lanes by painting a white line 1 foot in from the curb.\n- Add a crosswalk and \"Children Crossing\" signage at the intersection to alert drivers.\n- Narrow the width of Winterberry Drive by painting white lines a few feet in from each curb.\n- Repaint white fog lines to narrow travel lanes and slow traffic.\n- Work with residents to devise alternative mailbox mounting techniques that keep the sidewalk clear.\n- Expand the sidewalk with asphalt around utility poles.","STREETS, INNTERSECTIONS + AREA COVERED":"Galvin Middle School","THEMES":"\"Traffic Calming, Speed, Safety \", Schools, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2012\/06\/WalkBoston-GalvinMiddleSchoolWalkabilityAssessment-Wakefield.pdf?8621dc&8621dc","CITY":"WAKEFIELD","NEIGHBORHOOD":null,"TOWN_ID":305.0,"TYPE":"T","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WAKEFIELD","YEAR":2013,"SUMMARY":"The assessment aimed to support the Town Administrator's efforts to improve the area’s economic viability and enhance safety for the Walk-to-School program. Participants included representatives from Mass-in-Motion, Safe Routes to School, the Wakefield Chamber of Commerce, and WalkMass staff.","LONG TERM RECOMMENDATIONS":"- Add mid-block crossings and curb bump-outs for safety and visibility.\n- Relocate crosswalks and reduce curb radii at key areas.\n- Create outdoor seating areas or parklets along Main Street.\n- Install a traffic island as a pedestrian refuge.\n- Extend curbs to improve sight lines and discourage unsafe turns.\n- Add bike parking at the Greenwood MBTA stop.\n- Enhance lighting, signals, and benches along Main Street.","SHORT TERM RECOMMENDATIONS":"- Paint fog lines or parking stalls to narrow the roadway.\n- Post and enforce speed limits.\n- Paint and resurface crosswalks at key locations.\n- Install in-street pedestrian crossing signs near crosswalks.\n- Verify and fix school zone signs and flashing signals.\n- Add pedestrian signals and push buttons at key intersections.\n- Use planters to separate parking lots from the street","STREETS, INNTERSECTIONS + AREA COVERED":"Greenwood Square & Greenwood School Area","THEMES":"Schools, Economic Development , Comfort & Safety, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Dorothea Hass","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2018\/01\/WalkBoston-Greenwood-SquareGreenwood-SchoolAreaAssessment-Wakefield.pdf?8621dc&8621dc","CITY":"WAKEFIELD","NEIGHBORHOOD":null,"TOWN_ID":305.0,"TYPE":"T","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WARE","YEAR":2019,"SUMMARY":"WalkMass conducted a walk audit in Ware, MA, focusing on the walkability of a residential neighborhood north of the town center and its connectivity to key areas like senior housing and local services. This audit, part of WalkMass’s Age-Friendly Walking initiative, aims to support the town's Bike and Pedestrian and Complete Streets Prioritization plans. MassDOT data highlights 10 pedestrian-involved crashes in the study area since 2009, including one fatality.","LONG TERM RECOMMENDATIONS":"- Upgrade pedestrian signals at Main Street intersections to include Accessible Pedestrian Signals (APS) with tactile and audible warnings and countdown WALK signals. Ensure signal phasing allows adequate crossing time for vulnerable users.\n- Redesign midblock crossings with bump-outs to shorten crossing distances and improve pedestrian visibility.\n- Reconfigure the Main Street and SR-32 intersection to tighten the left-turn radius, slowing vehicle speeds and improving safety for east-west crosswalk users.\n- Consider broader alignment changes to improve vehicle turning patterns and prioritize pedestrian safety.","SHORT TERM RECOMMENDATIONS":"- Enhance sidewalk verges by planting street trees in areas with gaps to improve separation from vehicles.\n- Replace exposed tree pits with level treatments to prevent tripping hazards for older pedestrians.\n- Improve midblock crosswalk visibility by adding in-crosswalk signage or RRFBs and enforcing no-parking zones within 20 feet of crosswalks.\n -Install benches along Main Street to support older adult walking and add wayfinding signage showing walking times to destinations.\n- Increase pedestrian-scale lighting on Main Street for nighttime safety.","STREETS, INNTERSECTIONS + AREA COVERED":"North St, Pleasant St, Church St, & SR-32","THEMES":"Comfort & Safety, \"Traffic Calming, Speed, Safety \", Age Friendly","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Liz Rickley, & LeighAnne Taylor","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2019\/12\/WalkBoston-WARE-walk-audit-report-FINAL.pdf?70fb4f&70fb4f","CITY":"WARE","NEIGHBORHOOD":null,"TOWN_ID":309.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"WATERTOWN","YEAR":2015,"SUMMARY":"WalkBoston, in collaboration with Toole Design Group (TDG), conducted a walk assessment in Watertown, Massachusetts, on November 21, 2014. This assessment was part of the Massachusetts Department of Transportation’s (MassDOT) Bicycle and Pedestrian Safety Awareness and Enforcement Program, which is funded by the Federal Highway Safety Improvement Program (HSIP). The program involves collaboration among federal, state, regional, and local agencies, along with advocacy groups like MassBike and WalkBoston, aiming to improve pedestrian and cyclist safety in high-crash areas.","LONG TERM RECOMMENDATIONS":"- Define sidewalk edges with curbing.\n- Use different materials or joints to define the sidewalk edge adjacent to parking lots.\n- Keep pedestrian access routes clear of street furniture (e.g., hydrants, utility poles), especially the hydrant on Irving Street near Irving Park.\n- Provide accessible pedestrian signals and detectors at signalized intersections, including countdown indications, audible tones (e.g., speech messages), vibrotactile walk indicators, pushbutton locator tones, tactile arrows, and vibrating buttons.\n- Consider using unique audible tones for each intersection and adjusting tones based on ambient sound levels.\n- Position pushbuttons at signalized intersections near curb ramps, away from street furniture.\n- Improve access management by reducing the width of and clearly defining large curb cuts.","SHORT TERM RECOMMENDATIONS":"- Install detectable warning panels at all curb ramps.\n- Provide ADA-compliant curb ramps in a straight path for all crosswalks, minimizing apex ramps.\n- Trim vegetation to maintain clear pedestrian access.\n-  Repair raised sidewalk panels or patch segments to eliminate tripping hazards.\n- Ensure hazard-free pedestrian routes, including detectable warning panels, especially in snow.\n- Maintain pedestrian accommodations in work zones.\n- Ensure audible pedestrian tones are functioning where available.\n- Consider leading pedestrian phases at signalized intersections with concurrent pedestrian phases.\n- Repair driveway aprons with potholes in pedestrian paths.\n- Install vertical separation between parking areas and sidewalks where missing.","STREETS, INNTERSECTIONS + AREA COVERED":"Riverside Street, Irving Street, Mount Auburn Street, & Intersections of North Beacon Street\/Irving Street, Arsenal Street\/Irving Street, Mount Auburn Street\/Irving Street\/Palfrey Street, & Mount Auburn Street\/Common Street\/Parker Street.","THEMES":"Comfort & Safety, Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Brendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAssessmentFinal-Watertown.pdf?70fb4f&70fb4f","CITY":"WATERTOWN","NEIGHBORHOOD":null,"TOWN_ID":314.0,"TYPE":"TC","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WEST SPRINGFIELD","YEAR":2016,"SUMMARY":"After two pedestrian crashes on Elm St occurred on the same day in 2014, one involving the death of a crossing guard, the West Springfield MiM Wellnes Leadership Team (WLT) highlighted safe routes to school at the Coburn School as a priority in the community's Year 1 MiM work plan. In 2016, the Mass in Motion (MiM) Coordinator reached out to Coburn Elementary Principal Shelly St. George to schedule a walk audit in response to concerns about the safety of the walking environment around the school. ","LONG TERM RECOMMENDATIONS":"- Consider installing Rectangular Rapid Flashing Beacons at the Elm\/Garden crossing similar to those found at the US Post Office crossing.\n- Work with the police department and engineering department to monitor driving speeds and volumes at the Elm\/Garden crossing.\n- Study the possibility of re-routing pedestrian traffic away from the rotary at the Main St\/Park Ave intersection; changes include removal of RRFB, crosswalk, and sidewalk network leading to the rotary and any improvements should be coordinated with modifications to the Main St\/Park St intersection as well.","SHORT TERM RECOMMENDATIONS":"- Install curb bump-outs at crosswalk locations to reduce the crossing distances for pedestrians and further discourage drivers from parking near the crosswalks.\n- Institute \"No Right Turn on Red\" for drivers turning right from Westfield St onto Elm St; limiting these turns would allow walkers to feel more comfortable walking across Westfield when traffic is stopped at a red signal.\n- Update traffic signal equipment to include pedestrian countdown signals.\n- Install crosswalk signs and advance crosswalk signs on Park St and Park Ave to warn drivers of the presence of pedestrians in the crosswalks.\n- Study the feasibility and safety of consolidating the un-signalized crosswalks on Park St; consider the path network in the park as it sets up desire lines for people to cross the street.\n- Monitor traffic speeds on Park St and Park Ave to ensure drivers are not driving at excessive speeds.\n- Consider narrowing or eliminating travel lanes to tighten curb radii, construct curb bump-outs, and slow traffic at both the Elm\/Park and Elm St\/Park Ave\/Union St intersections.","STREETS, INNTERSECTIONS + AREA COVERED":"Elm St, Main St, Garden St, Westfield St, Park St, Park Ave, Union St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1tZ9sto-veV1UZgDUvKlguZkzBySYtpyV\/view?usp=sharing","CITY":"WEST SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":325.0,"TYPE":"TC","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"WEST SPRINGFIELD","YEAR":2017,"SUMMARY":"WalkBoston conducted a walk audit at Memorial Elementary School and in the surrounding neighborhood to assess the safety and quality of the walking environment for children walking to school. Westfield State University and the Pioneer Valley Planning Commission (PVPC) also completed a walk audit and a Safe Routes to School analysis in the Spring of 2017. The purpose of the WalkBoston audit was to bring town staff together with the school administration to experience the walking conditions in the neighborhood and discuss opportunities to work together to improve pedestrian safety.","LONG TERM RECOMMENDATIONS":"- Install sidewalk along the southern side of Norman St to facilitate student arrival\/dismissal zone.\n- Study the impacts of converting Norman St to a one-way street with traffic flowing from Cold Spring Ave to River St during student arrival and dismissal.\n- Complete sidewalks on Cold Spring Ave and Allston Ave.\n- Define walkway\/build sidewalk in front of apartment complex across from Memorial Elementary on Baldwin St.\n- Repair\/replace\/install curb ramps that meet standards including detectable warning strips.\n- Inventory existing street trees and propose strategy to plant trees along the neighborhood streets near Memorial School.\n- Consider adopting the MA SRTS second grade pedestrian safety curriculum.\n- Ask police to conduct regular enforcement activities to help discourage fast driving and enforce school arrival and dismissal policies to protect students.\n- Designate priority walking routes near all schools and prioritize these walkways as primary on the snow plow priority map.","SHORT TERM RECOMMENDATIONS":"- Fill in missing sidewalk links at major intersections near Memorial Elementary School that, if improved, could help to encourage mroe students to walk to school.\n- Install a stop sign at the Norman St\/Cold Spring Ave intersection.\n- Paint crosswalks to connect newly installed sidewalks across Cold Spring Rd.","STREETS, INNTERSECTIONS + AREA COVERED":"Cold Spring Ave, Baldwin St, Norman St, Heywood Ave, Bosworth St, Windsor St","THEMES":"Schools, Comfort & Safety, Weather Control","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1eFRKHWl8Q-2qpFADL4vV0lXDlDPSKcvj\/view?usp=sharing","CITY":"WEST SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":325.0,"TYPE":"TC","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"WEST SPRINGFIELD","YEAR":2021,"SUMMARY":"WalkMass conducted a walk audit in collaboration with the Pioneer Valley Planning Commission and the Mass in Motion program to assess pedestrian needs around Main and Union Streets in West Springfield, a densely populated, diverse residential area. The audit aimed to build on findings from a 2019 Park Access Project that highlighted limited park land in the Merrick neighborhood and inform upcoming infrastructure projects. Recommendations from the audit will guide the Town's planned improvements on Main Street in 2022 and future Union Street upgrades, focusing on enhancing pedestrian and bicycle connections to Memorial Ave and Park Drive.\n","LONG TERM RECOMMENDATIONS":"- Implement permanent traffic calming features such as paved curb bump-outs and speed feedback signs to enhance safety.\n- Install permanent curb bump-outs and additional pedestrian crossings with safety features like RRFBs and daylighting at key intersections.\n- Undertake the necessary studies and planning to permanently establish a protected bike lane on Union Street with an adequate buffer.\n- Establish a wayfinding signage program, incorporating community input, to encourage walking to local destinations and enhance pedestrian mobility.\n","SHORT TERM RECOMMENDATIONS":"- Pilot traffic calming on Main and Union Streets using temporary street furniture such as flex posts and bollards to narrow travel lanes.\n- Install pedestrian-activated RRFBs at all existing crosswalks on Main Street to improve pedestrian safety.\n- Pilot a protected bike lane on Union Street using quick-build materials like cones and flex posts to assess feasibility.\n- Conduct outreach to gather input from residents about local destinations and transportation preferences to inform placemaking efforts.","STREETS, INNTERSECTIONS + AREA COVERED":"Main St & Union St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Miranda Briseño & Stacey Beuttell","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2022\/01\/West-Springfield-Walk-Audit-Report-FINAL-compressed.pdf?70fb4f&70fb4f","CITY":"WEST SPRINGFIELD","NEIGHBORHOOD":null,"TOWN_ID":325.0,"TYPE":"TC","COUNTY":"HAMPDEN"},{"CITY\/TOWN":"WESTHAMPTON","YEAR":2022,"SUMMARY":"The Hilltown CDC, in collaboration with Healthy Hampshire and WalkMass, is spearheading a five-year grant project to promote Age-Friendly Walkability in the Hilltown Village Centers. This initiative involves conducting walk audits in partnering Hilltown villages, including Westhampton, to identify infrastructure improvements and policy changes aimed at making village-center walking safer and more enjoyable for all ages. The goal is to enhance pedestrian safety and accessibility, particularly around key community spaces like the Westhampton Public Library, Hampshire Regional High School, and the Westhampton Congregational Church of Christ.","LONG TERM RECOMMENDATIONS":"- Evaluate and explore improvements to Stage Rd for pedestrians and students and teachers traveling between the school and library.\n- Consider installing a crosswalk to connect pedestrians traveling from the Library to the Church and Town Offices and pedestrians walking on South Road.","SHORT TERM RECOMMENDATIONS":"- Increase awareness of pedestrian presence through the use of white shoulder lines on main roads.\n- Utilize funding streams through MassDOT and other state agencies to purchase mobile speed feedback signs and place them strategically on the main roads in town. \n- Utilize signage to alert drivers to the presence of a town center and pedestrians.\n-Addition of more benches throughout town.","STREETS, INNTERSECTIONS + AREA COVERED":"North and South Rd, Intersection of North Rd and Easthampton\/King’s Highway, & Intersection of South Rd and Main Rd","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Youth, Comfort & Safety, Connectivity, Policy","VIEW":"PDF ","FACILITATOR\/AUTHOR":"Zac Churchill, Miranda Briseño, & Stacey Beuttell","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2022\/08\/FINAL-Westhampton-Walk-Audit-Report.pdf","CITY":"WESTHAMPTON","NEIGHBORHOOD":null,"TOWN_ID":331.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"WEYMOUTH","YEAR":2014,"SUMMARY":"WalkMass worked with Weymouth municipal staff, local residents, and businesspeople under a Healthy Aging grant to conduct walk audits in four commercial districts identified as problematic for senior pedestrian safety: Broad\/Washington Streets, Columbian Square, Jackson Square, and Bridge\/Green Streets. The audits aimed to identify issues such as discontinuous sidewalks, unsafe crossings, high-speed traffic, and ADA accessibility concerns. The findings led to short- and long-term recommendations for infrastructure improvements to enhance walking safety, emphasizing lower-cost solutions while also suggesting larger investments for sustainable improvements.","LONG TERM RECOMMENDATIONS":"- Shift curb lines to widen sidewalks, especially on streets with high pedestrian traffic, as part of a larger street reconstruction effort.\n- Add flashing \"HAWK\" signals or pedestrian-activated signals at critical intersections to enhance pedestrian safety.\n- Implement a sustained sidewalk upgrading program to address uneven, missing, and poorly maintained sidewalks.\n- Ensure ADA-compliant curb ramps are installed and maintained, with necessary sidewalk widening and re-grading.\n- Provide crosswalks at all bus stops, ensuring safe pedestrian routes to and from public transportation.\n- Review and adjust signal timing at intersections to optimize pedestrian safety, ensuring appropriate WALK signals and adequate crossing time.","SHORT TERM RECOMMENDATIONS":"- Implement low-cost improvements at Columbian Square, such as place-making strategies to create a pedestrian-friendly environment, with the support of landscape designers and planners.\n- Add better-marked and regulated pedestrian crossings in several locations at Broad\/Washington Streets to address safety issues, particularly for seniors.\n- Narrow lane widths on wide streets by painting fog lines, adding bike lanes, and incorporating on-street parking to slow down traffic.\n- Tighten turning radii at intersections using paint, temporary bollards, or asphalt curbs to improve pedestrian safety.\n- Re-paint crosswalks with reflective ladder or zebra striping and adjust signal timing to provide more WALK time for pedestrians.\n- Add in-street pedestrian crossing signs, curb extensions, and prohibit parking within 20-30 feet of crosswalks for improved visibility.","STREETS, INNTERSECTIONS + AREA COVERED":"Bridge St, Sea St, North St, Jackson Sq,  Broad St, & Washington St","THEMES":"Comfort & Safety, \"Traffic Calming, Speed, Safety \", Bike or Bus","VIEW":"PDF ","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/01\/WalkBoston-WalkAudit-Weymouth.pdf?70fb4f&70fb4f","CITY":"WEYMOUTH","NEIGHBORHOOD":null,"TOWN_ID":336.0,"TYPE":"TC","COUNTY":"NORFOLK"},{"CITY\/TOWN":"WILLIAMSBURG","YEAR":2016,"SUMMARY":"WalkBoston conducted a walkability workshop on April 15, 2016, funded by the Massachusetts\nDepartment of Public Health Mass in Motion program. The workshop discussed the principles of\nwalkable communities and summarized pedestrian infrastructure improvements that increase safety and\nimprove the quality of the walking environment. This walk audit was part of the town's effort to address healthy aging through healthy community design.","LONG TERM RECOMMENDATIONS":"- Work with the police on periodic enforcement of village speed limits using both speed trailers and officer patrols.\n- Install Rectangular Rapid Flash Beacons (RRFBs) on Route 9.\n- Review the Town of Williamsburg curb cut permitting rules and revise to minimize the frequency and the width of curb cuts; work with property owners along the Route 9 study area to reduce the width of curb cuts.\n- Identify areas where plantings, trees, and benches could be added along the corridor to replicate the street treatment on the south side of Route 9 in front of historic properties and general stores.\n- Conduct a parking study to determine the existing supply and pent up demand in the Burgy village center.\n- Work with the business owners to better understand the parking issues they wrestle with and consider adopting a shared parking strategy for the village center.\n- Direct sidewalk maintenance and reconstruction funds to making improvements on priority routes\n- Study the traffic pattern at the N Main St\/North St\/E Main St intersection to determine if a 4-way stop would improve safety.\n- Continue the planning of a proposed walking trail along the Mill River behind Florence Bank and Williamsburg Market.\n- Increase programming in the public open spaces to increase use and attachment to the village green spaces and center.\n- Consider further study of access and circulation to public green spaces.\n- Establish a municipally recognized bicycle\/pedestrian committee or task force. \n- Draft and adopt a complete streets policy to qualify for the MassDOT Complete Streets Funding program.","SHORT TERM RECOMMENDATIONS":"- Introduce clues that vehicles are entering the village center such as village center signage, sculptures, or other public art.\n- Investigate the possibility of narrowing travel lanes by changing location of fog lines along Route 9.\n- Enhance pedestrian road crossings with advance crosswalk signage and more robust crosswalk painting (ladder or continental design).\n- Reprogram or repair school zone flashing beacon to operate when school is in session and at peak arrival and dismissal times; investigate the possibility of installing a second school zone pavement marking before the crosswalk.\n- Place an in-street pedestrian sign in crossings permanently.\n- Consider shortening the curb radii at corners and intersections to reduce crossing distance and calm turning traffic.\n- Consider formalizing the parking space layout in and around Florence Bank, Williamsburg Market, and Cichy's Garage; delineate a pedestrian zone where drivers can expect people walking across the parking lot driveways.\n- Identify priority walking routes; priority walking routes may include connections to schools, senior housing, residential neighborhoods, parks, trailheads, or walking loops.\n- Paint crosswalks across N Main St; study the safety implications of painting a crosswalk across North St on the south side off the intersection where no stop sign exists currently.\n- Highlight public green spaces on walking loop maps; maps could be made available in the library, post office, and local retail establishments.\n- Consider signage program to direct residents and visitors to local landmarks and parks.","STREETS, INNTERSECTIONS + AREA COVERED":"Route 9, North St, Petticoat Hill Rd, South St, N Main St, E Main St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Bike or Bus, Connectivity, Policy","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell, Adi Nochur","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1Z-UdaL1D6vbwI0wCtcdVyQnFAGesbpQO\/view?usp=sharing","CITY":"WILLIAMSBURG","NEIGHBORHOOD":null,"TOWN_ID":340.0,"TYPE":"T","COUNTY":"HAMPSHIRE"},{"CITY\/TOWN":"WILLIAMSTOWN","YEAR":2019,"SUMMARY":"WalkMass conducted a walk audit in Williamstown, MA, as part of its Age-Friendly Walking initiative aimed at improving walking conditions in rural and gateway communities of Massachusetts. The audit focused on the walkability of SR-2, both on the Williams College campus and near the town’s main shopping plaza, highlighting areas with pedestrian-involved crashes. MassDOT's data shows 11 pedestrian crashes in the area since 2014, with two involving pedestrians over 75, though none were fatal.","LONG TERM RECOMMENDATIONS":"- Consider relocating midblock crosswalks at Southworth Street and First Congregational Church for better visibility and safety.\n- Implement automated pedestrian detection devices for RRFBs in high-use areas, potentially replacing push-button activation.\n- Work with Williams College to standardize bench types and locations, ensuring proper accessibility and comfort for all pedestrians.\n- Explore the addition of pedestrian refuge islands at the SR-2 and Water Street intersection for better safety and a shorter crossing distance.\n- Evaluate the feasibility of extending pedestrian-scale lighting to all critical crosswalk locations for improved visibility in low light conditions.\n- Implement a full reconstruction of sidewalks with proper grading and verge additions to improve overall walkability and safety.","SHORT TERM RECOMMENDATIONS":"- Evaluate and improve sight lines for midblock crosswalks at Southworth Street and near First Congregational Church.\n- Install in-crosswalk signage or RRFB at the Southworth Street crosswalk.\n- Add benches in wide verge areas along SR-2 to increase comfort for pedestrians.\n- Update pavement markings at the SR-2 and Cole Avenue intersection to continental striping for better visibility.\n- Repair sidewalk cracks and improve grading to address steep cross-slopes and provide better pedestrian conditions.\n- Improve pedestrian-scale lighting along SR-2, focusing on high-traffic areas, and around campus.","STREETS, INNTERSECTIONS + AREA COVERED":"Park St, SR-2, & Intersection of Park St\/Cole Ave","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Comfort & Safety, Age Friendly","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & LeighAnne Taylor","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1rCPiq9TFW6N4hvpfBsOClNCU-a2jfkZW\/view?usp=drive_link","CITY":"WILLIAMSTOWN","NEIGHBORHOOD":null,"TOWN_ID":341.0,"TYPE":"T","COUNTY":"BERKSHIRE"},{"CITY\/TOWN":"WOBURN","YEAR":2012,"SUMMARY":"In the summer of 2012, WalkMass conducted five walkability assessments around Woburn’s public schools. These assessments are used to identify issues with pedestrian infrastructure, such as discontinuous sidewalks, unsafe crossings, damaged paths, unreliable pedestrian signals, and maintenance concerns like faded crosswalks or overgrown vegetation. The goal of these assessments is to improve safety for students walking or biking to school, ensuring there are safe routes for increased walking and biking activity.","LONG TERM RECOMMENDATIONS":"- Extend the sidewalk from Montvale Avenue to where the sidewalk ends on Boline Street for continuous pedestrian access.\n- Install a radar speed limit sign (driver feedback sign) near Woburn High to reduce speeds, particularly during school hours.\n- Upgrade crosswalks at intersections with curb ramps, using ladder-style crosswalks to improve visibility and safety, especially in school zones.\n- Extend the curb on Beach Street to improve visibility for pedestrians crossing from east to west, using paint and flexible delineators.\n- Limit curb cuts at the gas station to two smaller access points or define the pedestrian right of way more clearly with bold white parallel lines.\n- Re-establish the sidewalk and maintain a clear walking path along Salem Street.\n- Mark a crosswalk that connects the two ramps at a specific driveway to remind drivers of pedestrian presence.\n- Install an accessible curb ramp at the east side of the school driveway to ensure smooth access to the school entrance.","SHORT TERM RECOMMENDATIONS":"- Trim back vegetation that blocks sidewalks and add asphalt where possible to ensure a clear walking path.\n- Improve the crosswalk at Salem Street, Hilltop Terrace, and Sedgwick to ensure pedestrian safety when crossing.\n- Re-align the crosswalk at the driveway to connect two curb ramps rather than a curb ramp and a driveway.\n- Determine if the driveway should be one-way or two-way and install the appropriate signage and pavement markings.","STREETS, INNTERSECTIONS + AREA COVERED":"White Elementary School & Woburn High School","THEMES":"Accessibility, \"Traffic Calming, Speed, Safety \", Connectivity, Youth, Schools","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/10\/WalkBoston-SchoolWalkabilityAssessment-Woburn-Summer-2012.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2012,"SUMMARY":"In the summer of 2012, WalkMass conducted five walkability assessments around Woburn’s public schools. These assessments are used to identify issues with pedestrian infrastructure, such as discontinuous sidewalks, unsafe crossings, damaged paths, unreliable pedestrian signals, and maintenance concerns like faded crosswalks or overgrown vegetation. The goal of these assessments is to improve safety for students walking or biking to school, ensuring there are safe routes for increased walking and biking activity.","LONG TERM RECOMMENDATIONS":"- Install curb ramps at key pedestrian crossings to ensure accessibility.\n- Remove signal posts from sidewalks and consider suspending traffic signals over the center of the intersection to free up sidewalk space.\n- Where possible, widen sidewalks by adding asphalt on the inside edge to meet the 36-inch minimum width for wheelchair access.\n- Install traffic signal suspension systems over intersections, particularly where widening sidewalks is difficult, to avoid blocking pedestrian pathways.\n- Clear and improve the informal path through the wooded area between Overlook Terrace and Kennedy Middle School, adding lighting if needed to make it a safer, shorter route for walking or biking to school.","SHORT TERM RECOMMENDATIONS":"- Trim back brush and tree branches along Middle Street to ensure sidewalks are passable and signage is visible.\n- Stripe a white fog line 4 feet in from the curb to narrow travel lanes to 10.5 feet and create a wide shoulder for bicycling.\n- Add marked crosswalks with accessible curb ramps at all legs of the intersection, especially where the sidewalk ends on Clinton Street.\n- Stripe parallel white lines at missing crosswalks in T-intersections to improve consistency and pedestrian visibility.\n- Level and reconstruct sloped sections of the sidewalk to ensure smoother surfaces and improve safety.\n- Raise signs to comply with MUTCD standards for better visibility and compliance.","STREETS, INNTERSECTIONS + AREA COVERED":"Kennedy Middle School","THEMES":"Comfort & Safety, Connectivity, Accessibility, Schools, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/10\/WalkBoston-SchoolWalkabilityAssessment-Woburn-Summer-2012.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2012,"SUMMARY":"In the summer of 2012, WalkMass conducted five walkability assessments around Woburn’s public schools. These assessments are used to identify issues with pedestrian infrastructure, such as discontinuous sidewalks, unsafe crossings, damaged paths, unreliable pedestrian signals, and maintenance concerns like faded crosswalks or overgrown vegetation. The goal of these assessments is to improve safety for students walking or biking to school, ensuring there are safe routes for increased walking and biking activity.","LONG TERM RECOMMENDATIONS":"- Move the pedestrian sign further east on Green Street, ahead of the crosswalk.\n- Upgrade the current parallel line crosswalk to a ladder crosswalk for better visibility, especially in low light conditions.\n- Add an accessible crosswalk, with curb ramps and pedestrian crossing signage, east of the school entrance to avoid pedestrians crossing the school driveway.\n- Remove the curb cut and improve the sidewalk to provide a continuous, level walking surface with a full curb along the street.\n- Extend the path about 15 feet to connect with the paved path from the school’s rear driveway to the front of the school.\n- Cut back vegetation along the path edges to clear the narrow opening in the fence for easier passage.","SHORT TERM RECOMMENDATIONS":"- Build an accessible curb ramp at the necessary locations for immediate accessibility.\n- Perform routine maintenance to keep vegetation clear from the path edges to ensure safe pedestrian movement.","STREETS, INNTERSECTIONS + AREA COVERED":"Shamrock Elementary School","THEMES":"Age Friendly , Accessibility, Youth, Schools","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/10\/WalkBoston-SchoolWalkabilityAssessment-Woburn-Summer-2012.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2012,"SUMMARY":"In the summer of 2012, WalkMass conducted five walkability assessments around Woburn’s public schools. These assessments are used to identify issues with pedestrian infrastructure, such as discontinuous sidewalks, unsafe crossings, damaged paths, unreliable pedestrian signals, and maintenance concerns like faded crosswalks or overgrown vegetation. The goal of these assessments is to improve safety for students walking or biking to school, ensuring there are safe routes for increased walking and biking activity.","LONG TERM RECOMMENDATIONS":"- Rebuild the sidewalk with a curb separating the pedestrian zone from the vehicular travel lane, including at least one accessible ramp for vehicular access.\n- Install a push-button activated rapid-flash beacon with bright green pedestrian crossing signage to alert drivers of pedestrians, especially on Mishawum Road.\n- If speeding remains an issue, install a radar speed limit sign to help slow traffic on Mishawum Road.\n- Consider installing curb extensions on Mishawum Road or altering the intersection’s geometry to slow vehicle turns.\n- Build a concrete curb extension on Main Street to allow pedestrians to safely step out and view oncoming traffic around the curve and parked vehicles.","SHORT TERM RECOMMENDATIONS":"- Paint a white line to define the boundary between the roadway and sidewalk, creating a clearer pedestrian path.\n- Trim back weeds and tree branches to ensure the sidewalk remains passable.\n- Paint a high-visibility crosswalk and install pedestrian crossing signage from Newbury Street to the walkway leading to the school’s rear door.\n- Paint a “curb extension” marking on Main Street to prevent vehicles from parking in the area where pedestrians need to step out to look for traffic.","STREETS, INNTERSECTIONS + AREA COVERED":"Wyman Elementary School","THEMES":"Schools, Accessibility, \"Traffic Calming, Speed, Safety \", Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/10\/WalkBoston-SchoolWalkabilityAssessment-Woburn-Summer-2012.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2012,"SUMMARY":"In the summer of 2012, WalkMass conducted five walkability assessments around Woburn’s public schools. These assessments are used to identify issues with pedestrian infrastructure, such as discontinuous sidewalks, unsafe crossings, damaged paths, unreliable pedestrian signals, and maintenance concerns like faded crosswalks or overgrown vegetation. The goal of these assessments is to improve safety for students walking or biking to school, ensuring there are safe routes for increased walking and biking activity.","LONG TERM RECOMMENDATIONS":"- Remove the existing crosswalk and place a new crosswalk to the east where visibility and direct connection to the school grounds are improved. This crosswalk should be ladder-style, with accessible ramps and brightly-colored pedestrian crossing signage. A driver feedback sign should also be considered to slow drivers.\n- Narrow traffic lanes around corners by painting curb extensions and installing flexible delineators to shorten crossing distances and slow vehicle speeds.\n- Build a sidewalk around the building that connects the path to the front entrance of the school, providing a safer walking route.\n- Install a marked crosswalk, accessible ramps, and pedestrian crossing signage on Winn Street northwest of Sheridan Street.\n- Add a marked crosswalk, accessible ramps, and a pedestrian signal at the intersection of Winn Street, Bedford Road, and Wright Street.\n- Paint a crosswalk and install a School Zone\/Pedestrian Crossing sign at the intersection of Rag Rock and Bedford to remind drivers to expect pedestrians.","SHORT TERM RECOMMENDATIONS":"- Improve the walking surface of the path and install signage at both ends of the path for better pedestrian guidance.\n- Designate a pedestrian area around the building using paint to separate it from the parking lot, and use flexible delineators or large planters for clear separation.","STREETS, INNTERSECTIONS + AREA COVERED":"Hurld Elementary School","THEMES":"\"Traffic Calming, Speed, Safety \", Youth, Schools, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/10\/WalkBoston-SchoolWalkabilityAssessment-Woburn-Summer-2012.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2013,"SUMMARY":"WalkMass and the City of Woburn's planning department conducted walkability assessments at five of Woburn's public schools in the summer of 2013. The goal of these assessments was to identify areas where improvements could be made to enhance pedestrian safety and encourage more students and community members to walk. A safe and enjoyable walking environment is essential to fostering active transportation, reducing traffic congestion, and promoting a healthier, more sustainable community. These assessments helped pinpoint key issues such as unsafe crossings, damaged sidewalks, and areas with insufficient pedestrian infrastructure, allowing for targeted recommendations for improvement.","LONG TERM RECOMMENDATIONS":"- Consider curb extensions at Lexington Street\/ Reeves School drive.\n- Limit driveway lengths and tighten curb radii on Lexington Street.\n- Remove or stop free-right turn lane at Lexington\/Cambridge Road.\n- Repair crumbling sidewalk and clear access around fire hydrants.\n- Clarify one-way traffic signage on Crescent Park Drive.\n- Install sidewalk on Parker Street if needed.","SHORT TERM RECOMMENDATIONS":"- Install curb ramps and detectable warning strips on Lexington Street crosswalks.\n- Trim vegetation and remove obstructions on Lexington Street sidewalks.\n- Repaint ladder-design crosswalks and install pedestrian signs.\n- Repair flashing beacon school zone sign and relocate if needed.\n- Extend sidewalk to New Village Drive and trim debris.\n- Install pedestrian signalization at traffic signals.\n- Adjust crosswalk at Parker and Lexington for better safety.\n- Ensure speed limit sign functions correctly and consider relocation.\n- Enforce speed limits on Lexington Street.\n","STREETS, INNTERSECTIONS + AREA COVERED":"Reeves Elementary School","THEMES":"Accessibility, Schools, \"Traffic Calming, Speed, Safety \", Connectivity, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2013\/09\/WalkBoston-SchoolWalkabilityAssessments-Woburn-Summer2013.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2013,"SUMMARY":"WalkMass and the City of Woburn's planning department conducted walkability assessments at five of Woburn's public schools in the summer of 2013. The goal of these assessments was to identify areas where improvements could be made to enhance pedestrian safety and encourage more students and community members to walk. A safe and enjoyable walking environment is essential to fostering active transportation, reducing traffic congestion, and promoting a healthier, more sustainable community. These assessments helped pinpoint key issues such as unsafe crossings, damaged sidewalks, and areas with insufficient pedestrian infrastructure, allowing for targeted recommendations for improvement.","LONG TERM RECOMMENDATIONS":"- Formalize pedestrian crossings with painted street crossings, zones, and\/or sidewalks.\n- Repair curb ramps and install detectable warning strips at key intersections.\n- Narrow travel lanes and reduce curb radii at the corners of Central Street.\n- Install curbing to define the driveway and curb ramp at key intersections.\n- Relocate street signs or utility poles that obstruct wheelchair access.\n- Improve signage along Pine Street and increase awareness of pedestrian activity.","SHORT TERM RECOMMENDATIONS":"- Change pedestrian signal phasing at Washington Street to reduce wait times and install countdown signals.\n- Work with businesses to reduce driveway widths along walking routes.\n- Repaint crosswalks at Washington Street and Central Street intersections.\n- Install or relocate school zone signs, consider flashing beacons or radar speed readers.\n- Paint fog lines on Washington and Pine Streets to define lanes and narrow the street.\n- Repaint crosswalks with ladder pattern.\n- Repair sidewalks, fix drainage issues, and trim vegetation near the proposed Tri-Community Bikeway.\n- Install pedestrian crossing signs where needed.\n- Regularize and improve parking near the fields.\n- Trim vegetation at critical intersections to improve visibility and pedestrian flow.","STREETS, INNTERSECTIONS + AREA COVERED":"Goodyear Elementary School","THEMES":"Schools, Youth, \"Traffic Calming, Speed, Safety \"","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2013\/09\/WalkBoston-SchoolWalkabilityAssessments-Woburn-Summer2013.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2013,"SUMMARY":"WalkMass and the City of Woburn's planning department conducted walkability assessments at five of Woburn's public schools in the summer of 2013. The goal of these assessments was to identify areas where improvements could be made to enhance pedestrian safety and encourage more students and community members to walk. A safe and enjoyable walking environment is essential to fostering active transportation, reducing traffic congestion, and promoting a healthier, more sustainable community. These assessments helped pinpoint key issues such as unsafe crossings, damaged sidewalks, and areas with insufficient pedestrian infrastructure, allowing for targeted recommendations for improvement.\n","LONG TERM RECOMMENDATIONS":"- Install sidewalks on at least one side of the street.\n- Regulate parking near Ashburton and Main with curbs and sidewalks.\n- Standardize parking zones near Main Street intersection.\n- Clarify traffic island and curb cuts near apartment complex.\n- Remove parking spaces near the entrance drive for better pedestrian flow.\n- Redesign entrance drive with a neck-down or plaza for pedestrians.\n- Improve bike parking with more racks.\n- Add lighting to the pathway for increased night safety.","SHORT TERM RECOMMENDATIONS":"- Use paint and barriers (curbs, islands) to define areas for cars and pedestrians.\n- Install accessible curb ramps at key locations.\n- Add curb extensions to shorten crossing distance.\n- Use pavement markings to guide pedestrian paths and separate from vehicles.\n- Install new bollards or boulders to prevent vehicle access to walkways.\n- Repaint and resurface crosswalks, adding ramps and warning strips.\n- Trim tree limbs blocking school zone signs.\n- Install additional school zone and pedestrian crossing signs.\n- Repaint entrance signs and road markings in the drop-off zone.\n- Resolve parking signage issues and remove illegal signs.\n- Repair drainage issues on the entrance drive","STREETS, INNTERSECTIONS + AREA COVERED":"Altavesta Elementary School","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Bike or Bus, Youth, Accessibility","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2013\/09\/WalkBoston-SchoolWalkabilityAssessments-Woburn-Summer2013.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2013,"SUMMARY":"WalkMass and the City of Woburn's planning department conducted walkability assessments at five of Woburn's public schools in the summer of 2013. The goal of these assessments was to identify areas where improvements could be made to enhance pedestrian safety and encourage more students and community members to walk. A safe and enjoyable walking environment is essential to fostering active transportation, reducing traffic congestion, and promoting a healthier, more sustainable community. These assessments helped pinpoint key issues such as unsafe crossings, damaged sidewalks, and areas with insufficient pedestrian infrastructure, allowing for targeted recommendations for improvement.","LONG TERM RECOMMENDATIONS":"- Investigate opportunities to improve accessibility from Elm Street to the school.\n- Manage vehicular traffic to reduce movements behind the school when students are present.\n- Resolve conflicting speed limit signs and improve signage along Merrimac and Nichols Streets.\n- Consider installing a stop sign on Merrimac Street for traffic approaching School Street.\n- Consider moving crosswalk at Elm Street intersection due to its current location and length.\n- Install additional school zone and pedestrian crossing signs at Minot and Main intersections.\n- Add more paint and widen crosswalks where needed.\n- Consider adding a railing along the retaining wall on Traverse between Elm Street and Ward Street.\n- Relocate or reposition school zone signs to encourage cars to reduce speed sooner.","SHORT TERM RECOMMENDATIONS":"- Repaint and align crosswalk across Elm Street with curb ramps.\n- Paint lines or install signage to prohibit parking within 20 feet of the crosswalk on Elm Street.\n- Indicate specific pedestrian crossing zones between playground and drop-off areas.\n- Install additional pedestrian crossing signs to raise awareness.\n- Repair sidewalks, fix cross slopes, install curbs, and resurface where necessary.\n- Repaint or paint crosswalks at Minot and Main, and Minot and Nichols.\n- Install curb ramps and detectable warning strips at key intersections.\n- Repaint crosswalks with a ladder pattern for better visibility.\n- Install detectable warning strips at curb ramps at intersections.\n- Trim vegetation along key sidewalks and intersections to improve visibility.\n- Repaint crosswalk at Edwards Road and Traverse and add fog lines.\n- Minimize width of Edwards Road and reduce curb radii at Traverse with cost-effective methods.\n- Trim vegetation around school zone signs to improve visibility.","STREETS, INNTERSECTIONS + AREA COVERED":"Linscott Elementary School","THEMES":"Accessibility, Schools, \"Traffic Calming, Speed, Safety \", Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2013\/09\/WalkBoston-SchoolWalkabilityAssessments-Woburn-Summer2013.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WOBURN","YEAR":2013,"SUMMARY":"WalkMass and the City of Woburn's planning department conducted walkability assessments at five of Woburn's public schools in the summer of 2013. The goal of these assessments was to identify areas where improvements could be made to enhance pedestrian safety and encourage more students and community members to walk. A safe and enjoyable walking environment is essential to fostering active transportation, reducing traffic congestion, and promoting a healthier, more sustainable community. These assessments helped pinpoint key issues such as unsafe crossings, damaged sidewalks, and areas with insufficient pedestrian infrastructure, allowing for targeted recommendations for improvement.","LONG TERM RECOMMENDATIONS":"- Replace or repair staircases and explore accessible path from Locust Street.\n- Consider widening the sidewalk on Locust Street.\n- Relocate crosswalk near Locust Street for safer crossing.\n- Consider redesigning the intersection at Bedford and Burlington Streets.\n- Install sidewalk on one side of the road near Joyce Middle School.\n- Install NO TURN ON RED signs at intersections to improve visibility.\n- Upgrade pedestrian signals and extend crossing time.","SHORT TERM RECOMMENDATIONS":"- Install a continuous protected pedestrian route to Willow Street.\n- Clarify and replace faded signs for better wayfinding.\n- Paint crosswalks on driveways and in front of the school entrance.\n- Organize parking stalls and paint diagonal lines to prevent parking near crosswalks.\n- Widen sidewalk on Locust Street near park facilities.\n- Resolve signage inconsistency (school zone and speed limit).\n- Repaint crosswalks near Tudor Glen Village and around the school.\n- Trim vegetation blocking pedestrian signs.\n- Remove no parking sign in the crosswalk.\n- Consider a crosswalk leading to Horn Pond conservation area.\n- Repaint crosswalks at various locations (including Bedford and Burlington Streets).\n- Trim debris and vegetation from road shoulder.\n- Paint fog lines on Willow Street to reduce traffic speeds.","STREETS, INNTERSECTIONS + AREA COVERED":"Joyce Middle School","THEMES":"Accessibility, Schools, Connectivity, Youth, Comfort & Safety","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2013\/09\/WalkBoston-SchoolWalkabilityAssessments-Woburn-Summer2013.pdf?70fb4f&70fb4f","CITY":"WOBURN","NEIGHBORHOOD":null,"TOWN_ID":347.0,"TYPE":"C","COUNTY":"MIDDLESEX"},{"CITY\/TOWN":"WORCESTER","YEAR":2016,"SUMMARY":"WalkBoston and MassBike conducted an assessment of pedestrian and bicycle infrastructure along Chandler Street in the City of Worcester on Tuesday, August 2, 2016. The assessment focused on Chandler Street (Route 122) between Bellevue Street to the west and Wellington Street to the east in the Piedmont neighborhood of Worcester, MA.","LONG TERM RECOMMENDATIONS":"- Construct curb extensions and refuge islands where necessary while installing at least one curb ramp per crossing\n- Consider widening sidewalks to provide a 3' to 4' furnishing zone for street trees and furniture and a 6' to 7' clear pedestrian zone\n- Consider relocation and\/or consolidation of stops to far side locations\n- Upgrade pedestrian APS equipment \n- Install accessible curb ramps and crosswalks on all legs of the Chandler\/King intersection\n- Install pedestrian warning signs, in-street pedestrian signs, yield markings, and analyze if additional crossing treatments are necessary\n- Install additional pedestrian scale LED lighting","SHORT TERM RECOMMENDATIONS":"- Consider lowering the speed limit on Chandler Street\n- Consider narrowing travel lanes to 10.5'\n- Install temporary pedestrian refuge islands and curb extensions via flexposts and paint or other tactical materials\n- Install in-street signs, pedestrian warning signs, and yield markings at unsignalized intersections\n- Conduct a road diet feasibility study\n- Study access management and close, consolidate curb cuts, and minimize driveway widths\n- Daylight crosswalks by restricting parking within 20' of crosswalks\n- Consider bicycle left turn queue boxes and bike boxes\n- Install additional bike parking\n- Install back plates with retroreflective borders at signals\n- Provide bicycle and pedestrian detection at signalized intersections\n- Consider corridor-wide transit prioritization strategies such as signal pre-emption\n- Trim overgrown vegetation to improve visibility\n- Widen crosswalk across Chandler Street at Newbury Street\n- Request Chandler Street Elementary to increase participation in the Safe Routes to School programming, administer MassDOT student travel surveys, and consider bike safety training curriculum\n- Consider performing a school zone warrant analysis\n- Install additional bike racks in front of Chandler Street Elementary School","STREETS, INNTERSECTIONS + AREA COVERED":"Chandler St, Bellevue St, King St, Queen St, Piedmont St, Newbury St, Wellington St","THEMES":"Age Friendly , Accessibility, Schools, \"Traffic Calming, Speed, Safety \", Bike or Bus, Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"Adi Nochur, Stacey Beuttell","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2016\/08\/WalkBoston-BicycleandPedestrianInfrastructureAssessment-Worcester.pdf","CITY":"WORCESTER","NEIGHBORHOOD":null,"TOWN_ID":348.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"WORCESTER","YEAR":2019,"SUMMARY":"A walk audit was conducted in Worcester's Green Hill Neighborhood along Lincoln Street, focusing on improving pedestrian safety and comfort, following 14 pedestrian-involved crashes since 2016, including a fatality in 2019. Supported by a Transportation Justice grant and Mass in Motion funding, the project aims to redesign Lincoln Street to better accommodate walking, biking, and transit. The Green Hill Neighborhood Association is collaborating with Worcester Polytechnic Institute to develop plans, with potential for additional audits in the future.","LONG TERM RECOMMENDATIONS":"- Improve the level of comfort for people walking in the Green Hill neighborhood by adding features that make Lincoln Street feel inclusive for all modes of travel, not just cars.\n- Implement traffic calming strategies to slow vehicle speeds on Lincoln Street.\n- Improve the connection between the bus system and the pedestrian network to increase the safety of local transit users.","SHORT TERM RECOMMENDATIONS":"- Install clearly marked, visible, accessible crosswalks at high pedestrian utilization locations along Lincoln Street.\n- Enhance pedestrian visibility at existing Lincoln Street crosswalks.\n- Improve the connectivity and visibility of the neighborhood’s Green Hill Park entrance.\n","STREETS, INNTERSECTIONS + AREA COVERED":"Lincoln St, Intersection of Lincoln St and Harlow St, & Intersection of Lincoln St and Catharine St","THEMES":"\"Traffic Calming, Speed, Safety \", Comfort & Safety, Connectivity","VIEW":"PDF","FACILITATOR\/AUTHOR":"Brendan Kearney & LeighAnne Taylor","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2019\/11\/WalkBoston-Worcester-Green-Hill-walk-audit-report-FINAL.pdf?70fb4f&70fb4f","CITY":"WORCESTER","NEIGHBORHOOD":null,"TOWN_ID":348.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"WORCESTER","YEAR":2020,"SUMMARY":"The Worcester Indian Lake Virtual Walk Audit was conducted by WalkMass, WalkBike Worcester, and the Worcester Department of Public Health Mass in Motion Program. This walk audit was requested by the Indian Lake Community Association, Inc., who is working to help build a strong, healthy, vibrant connected community through community building and beautification initiatives. In light of the COVID-19 pandemic, this walk audit was conducted virtually.","LONG TERM RECOMMENDATIONS":"- Improve accessibility by repairing and adding ADA-compliant curb ramps, adding a crosswalk and ramps across Neponset St & W Boylston Dr, and considering a full signalized intersection for protected pedestrian phases. Evaluate road diet options, reduce lane width, and add pedestrian features like crosswalks, signage, and street trees.\n- Conduct sidewalk inventory and repair\/replacement, ensure a continuous sidewalk network with a minimum 5-foot width, and introduce street trees. \n- Add protected bike lanes and consider narrowing lanes for a road diet to encourage cycling and walking.\n- Consider gateway treatments and placemaking features like murals, art installations, and wayfinding signage.\n- Plan for beautification, ecological health efforts, family-friendly programming, and water sports. \n- Add placemaking features, signage, and active transportation connections.\n- Add crosswalks across Woodbury St and W. Boylston St, implement midblock bump-outs, and enhance crosswalk visibility with signage and RRFBs. Upgrade pedestrian signals to be fully accessible.","SHORT TERM RECOMMENDATIONS":"- Work with property owners to maintain clear sidewalks year-round, develop snow maintenance and leaf removal plans, and ensure businesses do not obstruct pedestrian paths (e.g., parking, dumpsters, ATM machines).\n- Add RRFBs at Broadman Street midblock crossing and repaint crosswalks with a continental stripe pattern. Improve visibility and safety at intersections (e.g., W Boylston Terrace, Gifford Street, Boardman Street) with better crosswalks, tactile warning panels, and pedestrian signals.\n- Work with city departments on snow maintenance, plowing, and enforcement for sidewalk clearance. Encourage enforcement against obstructed sidewalks due to parked cars or other blockages.\n","STREETS, INNTERSECTIONS + AREA COVERED":"Section 1: W Boylston Dr & Norton Dr\n\nSection 2: W. Boylston Dr, Intersection of W. Boylston Dr\/Merrill Rd, Intersecton of W. Boylston St\/Grove St\n","THEMES":"Age Friendly , Accessibility, Connectivity, Economic Development , Comfort & Safety, Public Health","VIEW":"PDF","FACILITATOR\/AUTHOR":" Leighanne Taylor","VIEW_link":"https:\/\/dev.walkboston.org\/wp-content\/uploads\/2021\/08\/Worcester-Indian-Lake-Walk-Audit_-Recommendations-Memo-public.pdf?8621dc&8621dc&8621dc&8621dc","CITY":"WORCESTER","NEIGHBORHOOD":null,"TOWN_ID":348.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"WORCESTER","YEAR":2023,"SUMMARY":"WalkMassachusetts conducted a walk audit in partnership with CMRPC, WalkBike Worcester, and Worcester's Division of Public Health under the REACH grant. The audit focused on pedestrian safety, accessibility, and infrastructure, with special attention to individuals using mobility-assisted devices. Key issues included safety concerns and lack of amenity maintenance. The report emphasizes the benefits of walkable infrastructure for public health, the environment, and community cohesion, while highlighting the need to prioritize traditionally excluded populations, such as older adults and people with disabilities, through age- and disability-friendly design.","LONG TERM RECOMMENDATIONS":"- Implement Safety Zone Speed limits and adopt Worcester’s mobility action plan for slower, safer traffic near Webster Square Towers.\n- Increase sidewalk widths and add shade-providing trees along Webster Square Crossing to reduce pedestrian and cyclist conflicts.\n- Expand sidewalks and repurpose underutilized parking lots along Main Street to create greenspace and prevent sidewalk parking.\n- Build accessible sidewalks along Curtis Street and explore creating a greenway near Beaver Brook for recreation and heat mitigation.\n- Redesign the streetscape at Main and Stafford Streets with Park Ave to ensure clear distinctions between pedestrian and parking areas.","SHORT TERM RECOMMENDATIONS":"- Install curb bump-outs and better signage to improve pedestrian visibility and safety at 1050 Main Street.\n- Upgrade all signals at Webster Square to include countdowns, audible chirps, and “No Turn on Red” signs.\n- Address litter and improve shading along Main Street by adding trash bins and planting trees in empty pits.\n- Install midblock crosswalks, truncated domes, and crossing signals at Curtis and Main Streets for safer crossings.\n- Replace damaged truncated domes and non-functioning ADA-compliant crossing signals at Main and Stafford Streets with Park Ave.","STREETS, INNTERSECTIONS + AREA COVERED":"Main St. & Mill St. ","THEMES":"Age Friendly , Comfort & Safety, \"Traffic Calming, Speed, Safety \", Public Health, Climate - Shade\/ Tree","VIEW":"PDF","FACILITATOR\/AUTHOR":"Brendan Kearney, Iolando Spinola,  & Jonathan Gomez-Pereira","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1gA1ocLlio9gYE2p8fE7O9V1tmxM69wbk\/view?usp=drive_link","CITY":"WORCESTER","NEIGHBORHOOD":null,"TOWN_ID":348.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"WORCESTER","YEAR":2023,"SUMMARY":"Walk audits were conducted on September 16th and November 30th, 2023, at Woodland and Claremont Academies in Worcester to assess pedestrian safety. Facilitated by WalkMassachusetts using Crime Prevention Through Environmental Design (CPTED), the audits aimed to understand local challenges. The City of Worcester's REACH team partnered with WalkMassachusetts to engage stakeholders and explore issues in the area. The findings will contribute to a larger planning effort to improve walkability and the design of teacher parking lots around the schools. This report summarizes key recommendations and insights from the audits.","LONG TERM RECOMMENDATIONS":"- Improve maintenance and stewardship of the four lots on Claremont Street.\n- Clarify maintenance and stewardship responsibility for all properties near Woodland and Claremont Academy.\n- Identify an enhanced traffic flow plan for dismissal at Woodland and Claremont Academy.","SHORT TERM RECOMMENDATIONS":"-Enhance the visibility of signs and school zone information for drivers.\n- Improve sidewalk conditions around Woodland and Claremont Academy.\n- Improve lighting conditions and install dedicated light posts for pedestrian safety\n","STREETS, INNTERSECTIONS + AREA COVERED":"Woodland Academy & Claremont Academy","THEMES":"Schools, \"Traffic Calming, Speed, Safety \", Youth","VIEW":"PDF","FACILITATOR\/AUTHOR":"WalkMassachusetts","VIEW_link":"https:\/\/drive.google.com\/file\/d\/1-ghT2OD5Y0OC2e4han_b3SbH2RHf4sfd\/view?usp=drive_link","CITY":"WORCESTER","NEIGHBORHOOD":null,"TOWN_ID":348.0,"TYPE":"C","COUNTY":"WORCESTER"},{"CITY\/TOWN":"YARMOUTH","YEAR":2018,"SUMMARY":"WalkMass conducted a walk audit along Route 28 as part of the Executive Office of Public Safety and Security’s (EOPSS) Pedestrian Safety Planning Initiative for High-Fatality Communities. The EOPSS Pedestrian Safety Planning Initiative builds municipal staff understanding and awareness of the components of a safe walking environment. WalkMass is working in partnership with EOPSS to address walking safety concerns in Massachusetts communities with high pedestrian crash rates, with the goal of reducing pedestrian fatalities and serious injuries in the Commonwealth.","LONG TERM RECOMMENDATIONS":"- Upgrade sidewalks along Route 28, making them smoother, wider, and compliant with ADA standards, including curb ramps and detectable warning panels.\n- Redesign Route 28 to adjust curb lines, adding bike lanes and improving pedestrian safety.\n- Add streetscape elements such as trees, benches, and activity hubs to create a pedestrian-friendly corridor.\n- Focus on densifying specific areas along Route 28 to develop vibrant centers of activity.","SHORT TERM RECOMMENDATIONS":"- Install crosswalk pavement markings at all approaches to signalized intersections and evaluate potential locations for additional mid-block crosswalks.\n- Adjust signal phasing and timing at intersections to accommodate the needs of pedestrians.\n- Narrow travel lanes with painted edge (fog) lines to create a safer environment for pedestrians and cyclists.\n- Minimize the width of existing driveways along Route 28 and limit the addition of new driveways.","STREETS, INNTERSECTIONS + AREA COVERED":"Route 28 (Main St)","THEMES":"Economic Development , Comfort & Safety, Bike or Bus","VIEW":"PDF","FACILITATOR\/AUTHOR":"Stacey Beuttell & Brendan Kearney","VIEW_link":"https:\/\/walkmass.org\/wp-content\/uploads\/2018\/08\/WalkBoston-WalkAudit-Route28-Yarmouth.pdf?70fb4f&70fb4f","CITY":"YARMOUTH","NEIGHBORHOOD":null,"TOWN_ID":351.0,"TYPE":"T","COUNTY":"BARNSTABLE"}]